#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

///////////////////////////////////////////
// Binary: client.dll
// Class Count: 210
// Enum Count: 3
///////////////////////////////////////////

// Aligment: 4
// Size: 9
enum class NPC_STATE : uint32_t
{
	NPC_STATE_INVALID = 0xffffffffffffffff,
	NPC_STATE_NONE = 0x0,
	NPC_STATE_IDLE = 0x1,
	NPC_STATE_ALERT = 0x2,
	NPC_STATE_COMBAT = 0x3,
	NPC_STATE_SCRIPT = 0x4,
	NPC_STATE_PLAYDEAD = 0x5,
	NPC_STATE_PRONE = 0x6,
	NPC_STATE_DEAD = 0x7,
};

// Aligment: 4
// Size: 5
enum class C_BaseCombatCharacter::WaterWakeMode_t : uint32_t
{
	C_BaseCombatCharacter::WATER_WAKE_NONE = 0x0,
	C_BaseCombatCharacter::WATER_WAKE_IDLE = 0x1,
	C_BaseCombatCharacter::WATER_WAKE_WALKING = 0x2,
	C_BaseCombatCharacter::WATER_WAKE_RUNNING = 0x3,
	C_BaseCombatCharacter::WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Aligment: 4
// Size: 13
enum class PostProcessParameterNames_t : uint32_t
{
	PPPN_FADE_TIME = 0x0,
	PPPN_LOCAL_CONTRAST_STRENGTH = 0x1,
	PPPN_LOCAL_CONTRAST_EDGE_STRENGTH = 0x2,
	PPPN_VIGNETTE_START = 0x3,
	PPPN_VIGNETTE_END = 0x4,
	PPPN_VIGNETTE_BLUR_STRENGTH = 0x5,
	PPPN_FADE_TO_BLACK_STRENGTH = 0x6,
	PPPN_DEPTH_BLUR_FOCAL_DISTANCE = 0x7,
	PPPN_DEPTH_BLUR_STRENGTH = 0x8,
	PPPN_SCREEN_BLUR_STRENGTH = 0x9,
	PPPN_FILM_GRAIN_STRENGTH = 0xa,
	PPPN_TOP_VIGNETTE_STRENGTH = 0xb,
	POST_PROCESS_PARAMETER_COUNT = 0xc,
};

// Aligment: 4
// Size: 72
struct ActiveModelConfig_t
{
public:
	// MNetworkEnable
	// MNetworkEnable
	ModelConfigHandle_t m_Handle; // 0xc
	// MNetworkEnable
	// MNetworkEnable
	CUtlSymbolLarge m_Name; // 0x10
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x30
};

// Aligment: 6
// Size: 64
class CNetworkedIKProceduralTargetContext
{
public:
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nChainIndex; // 0x14
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nRuleIndex; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	Vector m_vTargetPosition; // 0x1c
	// MNetworkEnable
	// MNetworkEnable
	Quaternion m_qTargetOrientation; // 0x28
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "96"
	float m_flWeight; // 0x38
	// MNetworkEnable
	// MNetworkEnable
	bool m_bIsValid; // 0x3c
};

// Aligment: 19
// Size: 3008
class CAnimGraphNetworkedVariables
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_BoolVariables"
	CUtlVector< bool > m_NetBoolVariables; // 0x8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_ByteVariables"
	CUtlVector< uint8 > m_NetByteVariables; // 0x20
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_IntVariables"
	CUtlVector< int32 > m_NetIntVariables; // 0x38
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_FloatVariables"
	CUtlVector< float32 > m_NetFloatVariables; // 0x50
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_VectorVariables"
	CUtlVector< Vector > m_NetVectorVariables; // 0x68
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_QuaternionVariables"
	CUtlVector< Quaternion > m_NetQuaternionVariables; // 0x80
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredBoolVariables"
	CUtlVector< bool > m_PredNetBoolVariables; // 0x98
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredByteVariables"
	CUtlVector< uint8 > m_PredNetByteVariables; // 0xb0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredIntVariables"
	CUtlVector< int32 > m_PredNetIntVariables; // 0xc8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredFloatVariables"
	CUtlVector< float32 > m_PredNetFloatVariables; // 0xe0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredVectorVariables"
	CUtlVector< Vector > m_PredNetVectorVariables; // 0xf8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredQuaternionVariables"
	CUtlVector< Quaternion > m_PredNetQuaternionVariables; // 0x110
	CUtlVector< bool > m_LocalPredBoolVariables; // 0x128
	CUtlVector< uint8 > m_LocalPredByteVariables; // 0x140
	CUtlVector< int32 > m_LocalPredIntVariables; // 0x158
	CUtlVector< float32 > m_LocalPredFloatVariables; // 0x170
	CUtlVector< Vector > m_LocalPredVectorVariables; // 0x188
	CUtlVector< Quaternion > m_LocalPredQuaternionVariables; // 0x1a0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	float m_flLastTeleportTime; // 0xbb4
};

// Aligment: 5
// Size: 32
class C_BaseFlex::Emphasized_Phoneme
{
public:
	CUtlString m_sClassName; // 0x0
	float m_flAmount; // 0x18
	bool m_bRequired; // 0x1c
	bool m_bBasechecked; // 0x1d
	bool m_bValid; // 0x1e
};

// Aligment: 2
// Size: 856
class C_CommandContext
{
public:
	bool needsprocessing; // 0x0
	int32_t command_number; // 0x350
};

// Aligment: 30
// Size: 488
class CProjectedTextureBase
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hTargetEntity; // 0xc
	// MNetworkEnable
	// MNetworkEnable
	bool m_bState; // 0x10
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAlwaysUpdate; // 0x11
	// MNetworkEnable
	// MNetworkEnable
	float m_flLightFOV; // 0x14
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnableShadows; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	bool m_bSimpleProjection; // 0x19
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightOnlyTarget; // 0x1a
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightWorld; // 0x1b
	// MNetworkEnable
	// MNetworkEnable
	bool m_bCameraSpace; // 0x1c
	// MNetworkEnable
	// MNetworkEnable
	float m_flBrightnessScale; // 0x20
	// MNetworkEnable
	// MNetworkEnable
	Color m_LightColor; // 0x24
	// MNetworkEnable
	// MNetworkEnable
	float m_flIntensity; // 0x28
	// MNetworkEnable
	// MNetworkEnable
	float m_flLinearAttenuation; // 0x2c
	// MNetworkEnable
	// MNetworkEnable
	float m_flQuadraticAttenuation; // 0x30
	// MNetworkEnable
	// MNetworkEnable
	bool m_bVolumetric; // 0x34
	// MNetworkEnable
	// MNetworkEnable
	float m_flVolumetricIntensity; // 0x38
	// MNetworkEnable
	// MNetworkEnable
	float m_flNoiseStrength; // 0x3c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFlashlightTime; // 0x40
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_nNumPlanes; // 0x44
	// MNetworkEnable
	// MNetworkEnable
	float m_flPlaneOffset; // 0x48
	// MNetworkEnable
	// MNetworkEnable
	float m_flColorTransitionTime; // 0x4c
	// MNetworkEnable
	// MNetworkEnable
	float m_flAmbient; // 0x50
	// MNetworkEnable
	// MNetworkEnable
	char[260] m_SpotlightTextureName; // 0x54
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nSpotlightTextureFrame; // 0x158
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "1"
	uint32_t m_nShadowQuality; // 0x15c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "500"
	// MNetworkEncodeFlags
	float m_flNearZ; // 0x160
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "18"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1500"
	// MNetworkEncodeFlags
	float m_flFarZ; // 0x164
	// MNetworkEnable
	// MNetworkEnable
	float m_flProjectionSize; // 0x168
	// MNetworkEnable
	// MNetworkEnable
	float m_flRotation; // 0x16c
	// MNetworkEnable
	// MNetworkEnable
	bool m_bFlipHorizontal; // 0x170
public:
	static float &Get_m_flVisibleBBoxMinHeight() { return *reinterpret_cast<float*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CProjectedTextureBase")->m_static_fiels[0]->m_instance); }
};

// Aligment: 29
// Size: 488
class C_PlayerLocalData
{
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	ChangeAccessorFieldPathIndex_t m_NetworkVar_PathIndex; // 0x8
	// MNetworkEnable
	// MNetworkEnable
	uint8[32] m_chAreaBits; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	uint8[24] m_chAreaPortalBits; // 0x38
	int32_t m_nStepside; // 0x50
	int32_t m_nOldButtons; // 0x54
	// MNetworkEnable
	// MNetworkEnable
	float m_flFOVRate; // 0x58
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "12"
	uint32_t m_iHideHUD; // 0x5c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkPriority "64"
	uint32_t m_nDuckTimeMsecs; // 0x60
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32_t m_nDuckJumpTimeMsecs; // 0x64
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32_t m_nJumpTimeMsecs; // 0x68
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "17"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	float m_flFallVelocity; // 0x6c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkEncodeFlags
	// MNetworkMinValue "0"
	// MNetworkMaxValue "128"
	float m_flStepSize; // 0x70
	// MNetworkEnable
	// MNetworkPriority "64"
	// MNetworkBitCount "32"
	QAngle m_vecPunchAngle; // 0x78
	// MNetworkEnable
	// MNetworkBitCount "32"
	QAngle m_vecPunchAngleVel; // 0x90
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDucked; // 0xa8
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDucking; // 0xa9
	// MNetworkEnable
	// MNetworkEnable
	bool m_bInDuckJump; // 0xaa
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDrawViewmodel; // 0xab
	// MNetworkEnable
	// MNetworkEnable
	bool m_bWearingSuit; // 0xac
	// MNetworkEnable
	// MNetworkEnable
	bool m_bPoisoned; // 0xad
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAllowAutoMovement; // 0xae
	// MNetworkEnable
	// MNetworkEnable
	bool m_bSlowMovement; // 0xaf
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAutoAimTarget; // 0xb0
	// MNetworkEnable
	// MNetworkEnable
	sky3dparams_t m_skybox3d; // 0xb8
	// MNetworkEnable
	// MNetworkEnable
	audioparams_t m_audio; // 0x140
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x1b8
	bool m_bInLanding; // 0x1d4
	float m_flLandingTime; // 0x1d8
	Vector m_vecClientBaseVelocity; // 0x1dc
};

// Aligment: 1
// Size: 56
struct PostProcessParameters_t
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float32[12] m_flParameters; // 0x8
};

// Aligment: 1
// Size: 16
class C_RopeKeyframe::CPhysicsDelegate
{
public:
	C_RopeKeyframe* m_pKeyframe; // 0x8
};

// Aligment: 1
// Size: 24
struct C_SceneEntity::QueuedEvents_t
{
public:
	float starttime; // 0x0
};

// Aligment: 15
// Size: 776
class CFlashlightEffect
{
public:
	bool m_bIsOn; // 0x8
	bool m_bMuzzleFlashEnabled; // 0x18
	float m_flMuzzleFlashBrightness; // 0x1c
	Quaternion m_quatMuzzleFlashOrientation; // 0x20
	Vector m_vecMuzzleFlashOrigin; // 0x30
	float m_flDT; // 0x3c
	float m_flFov; // 0x40
	float m_flFarZ; // 0x44
	float m_flLinearAtten; // 0x48
	bool m_bCastsShadows; // 0x4c
	float m_flCurrentPullBackDist; // 0x50
	CStrongHandle< InfoForResourceTypeCTextureBase > m_FlashlightTexture; // 0x58
	CStrongHandle< InfoForResourceTypeCTextureBase > m_MuzzleFlashTexture; // 0x60
	CWeakHandle< InfoForResourceTypeCTextureBase > m_hCurrentFlashlightTexture; // 0x68
	char[64] m_textureName; // 0x70
};

// Aligment: 0
// Size: 776
class CHeadlightEffect : public CFlashlightEffect
{
public:
// <no members described>
};

// Aligment: 5
// Size: 20
class CInterpolatedValue
{
public:
	float m_flStartTime; // 0x0
	float m_flEndTime; // 0x4
	float m_flStartValue; // 0x8
	float m_flEndValue; // 0xc
	int32_t m_nInterpType; // 0x10
};

// Aligment: 4
// Size: 32
class CGlowSprite
{
public:
	Vector m_vColor; // 0x0
	float m_flHorzSize; // 0xc
	float m_flVertSize; // 0x10
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x18
};

// Aligment: 15
// Size: 208
class CGlowOverlay
{
public:
	Vector m_vPos; // 0x8
	bool m_bDirectional; // 0x14
	Vector m_vDirection; // 0x18
	bool m_bInSky; // 0x24
	float m_skyObstructionScale; // 0x28
	CGlowSprite[4] m_Sprites; // 0x30
	int32_t m_nSprites; // 0xb0
	float m_flProxyRadius; // 0xb4
	float m_flHDRColorScale; // 0xb8
	float m_flGlowObstructionScale; // 0xbc
	bool m_bCacheGlowObstruction; // 0xc0
	bool m_bCacheSkyObstruction; // 0xc1
	int16_t m_bActivated; // 0xc2
	int16_t m_ListIndex; // 0xc4
	int32_t m_queryHandle; // 0xc8
};

// Aligment: 2
// Size: 8
class TimedEvent
{
public:
	float m_TimeBetweenEvents; // 0x0
	float m_fNextEvent; // 0x4
};

// Aligment: 3
// Size: 32
class CViewAngleKeyFrame
{
public:
	QAngle m_vecAngles; // 0x8
	float m_flTime; // 0x14
	int32_t m_iFlags; // 0x18
};

// Aligment: 0
// Size: 8
class IClientAlphaProperty
{
public:
// <no members described>
};

// Aligment: 10
// Size: 96
class JiggleData
{
public:
	int32_t bone; // 0x0
	int32_t id; // 0x4
	float lastUpdate; // 0x8
	Vector basePos; // 0xc
	Vector baseLastPos; // 0x18
	Vector baseVel; // 0x24
	Vector baseAccel; // 0x30
	Vector tipPos; // 0x3c
	Vector tipVel; // 0x48
	Vector tipAccel; // 0x54
};

// Aligment: 0
// Size: 40
class CJiggleBones
{
public:
// <no members described>
};

// Aligment: 3
// Size: 24
class C_PlayerState
{
public:
	bool deadflag; // 0x8
	bool hltv; // 0x9
	QAngle v_angle; // 0xc
};

// Aligment: 10
// Size: 152
class CDecalInfo
{
public:
	float m_flAnimationScale; // 0x0
	float m_flAnimationLifeSpan; // 0x4
	float m_flPlaceTime; // 0x8
	float m_flFadeStartTime; // 0xc
	float m_flFadeDuration; // 0x10
	int32_t m_nVBSlot; // 0x14
	int32_t m_nBoneIndex; // 0x18
	CDecalInfo* m_pNext; // 0x28
	CDecalInfo* m_pPrev; // 0x30
	int32_t m_nDecalMaterialIndex; // 0x90
};

// Aligment: 2
// Size: 8
struct C_CEnvWindShared::WindAveEvent_t
{
public:
	float m_flStartWindSpeed; // 0x0
	float m_flAveWindSpeed; // 0x4
};

// Aligment: 2
// Size: 8
struct C_CEnvWindShared::WindVariationEvent_t
{
public:
	float m_flWindAngleVariation; // 0x0
	float m_flWindSpeedVariation; // 0x4
};

// Aligment: 29
// Size: 576
class C_CEnvWindShared
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartTime; // 0x8
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_iWindSeed; // 0xc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMinWind; // 0x10
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMaxWind; // 0x12
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "14"
	int32_t m_windRadius; // 0x14
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMinGust; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMaxGust; // 0x1a
	// MNetworkEnable
	// MNetworkEnable
	float m_flMinGustDelay; // 0x1c
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxGustDelay; // 0x20
	// MNetworkEnable
	// MNetworkEnable
	float m_flGustDuration; // 0x24
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "9"
	uint16_t m_iGustDirChange; // 0x28
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_location; // 0x2c
	int32_t m_iszGustSound; // 0x38
	int32_t m_iWindDir; // 0x3c
	float m_flWindSpeed; // 0x40
	Vector m_currentWindVector; // 0x44
	Vector m_CurrentSwayVector; // 0x50
	Vector m_PrevSwayVector; // 0x5c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "9"
	uint16_t m_iInitialWindDir; // 0x68
	// MNetworkEnable
	// MNetworkEnable
	float m_flInitialWindSpeed; // 0x6c
	float m_flVariationTime; // 0x70
	float m_flSwayTime; // 0x74
	float m_flSimTime; // 0x78
	float m_flSwitchTime; // 0x7c
	float m_flAveWindSpeed; // 0x80
	bool m_bGusting; // 0x84
	float m_flWindAngleVariation; // 0x88
	float m_flWindSpeedVariation; // 0x8c
	CEntityIndex m_iEntIndex; // 0x90
};

// Aligment: 0
// Size: 8
class C_GameRules
{
public:
// <no members described>
};

// Aligment: 3
// Size: 48
class C_CHintMessageQueue
{
public:
	float m_tmMessageEnd; // 0x8
	CUtlVector< CHintMessage* > m_messages; // 0x10
	C_BasePlayer* m_pPlayer; // 0x28
};

// Aligment: 0
// Size: 32
class C_MultiplayRules : public C_GameRules
{
public:
// <no members described>
};

// Aligment: 14
// Size: 64
struct C_fogplayerparams_t
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "PlayerFogController"
	CHandle< C_FogController > m_hCtrl; // 0x8
	float m_flTransitionTime; // 0xc
	Color m_OldColor; // 0x10
	float m_flOldStart; // 0x14
	float m_flOldEnd; // 0x18
	float m_flOldMaxDensity; // 0x1c
	float m_flOldHDRColorScale; // 0x20
	float m_flOldFarZ; // 0x24
	Color m_NewColor; // 0x28
	float m_flNewStart; // 0x2c
	float m_flNewEnd; // 0x30
	float m_flNewMaxDensity; // 0x34
	float m_flNewHDRColorScale; // 0x38
	float m_flNewFarZ; // 0x3c
};

// Aligment: 4
// Size: 40
class C_CSequenceTransitioner
{
public:
	CUtlVector< CAnimationLayer > m_animationQueue; // 0x0
	bool m_bIsInSimulation; // 0x18
	float m_flSimOrRenderTime; // 0x1c
	float m_flInterpolatedTime; // 0x20
};

// Aligment: 5
// Size: 568
class C_CSequenceTransitioner2
{
public:
	CNetworkedSequenceOperation m_currentOp; // 0x8
	float m_flCurrentPlaybackRate; // 0x48
	float m_flCurrentAnimTime; // 0x4c
	TransitioningLayer_t[4] m_transitioningLayers; // 0x50
	C_BaseAnimatingController* m_pOwner; // 0x1d0
};

// Aligment: 0
// Size: 8
class C_SingleplayRules : public C_GameRules
{
public:
// <no members described>
};

// Aligment: 2
// Size: 24
class C_EconItemAttribute
{
public:
	// MNetworkEnable
	// MNetworkEnable
	uint16_t m_iAttributeDefinitionIndex; // 0x12
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkAlias "m_iRawValue32"
	float m_flValue; // 0x14
};

// Aligment: 3
// Size: 12
struct C_EconEntity::AttachedParticleInfo_t
{
public:
	ParticleIndex_t m_nAttachedParticleIndex; // 0x0
	CUtlStringToken m_customType; // 0x4
	bool m_bShouldDestroyImmediately; // 0x8
};

// Aligment: 1
// Size: 16
struct C_EconEntity::AttachedModelData_t
{
public:
	int32_t m_iModelDisplayFlags; // 0x8
};

// Aligment: 52
// Size: 1368
class CGlobalLightBase
{
public:
	bool m_bSpotLight; // 0x10
	Vector m_SpotLightOrigin; // 0x14
	QAngle m_SpotLightAngles; // 0x20
	Vector m_ShadowDirection; // 0x2c
	Vector m_AmbientDirection; // 0x38
	Vector m_SpecularDirection; // 0x44
	Vector m_InspectorSpecularDirection; // 0x50
	float m_flSpecularPower; // 0x5c
	float m_flSpecularIndependence; // 0x60
	Color m_SpecularColor; // 0x64
	bool m_bStartDisabled; // 0x68
	bool m_bEnabled; // 0x69
	Color m_LightColor; // 0x6a
	Color m_HeroLightColor; // 0x6e
	Color m_AOGradientBottomColor; // 0x72
	bool m_bEnableRainFx; // 0x76
	Color m_AmbientColor1; // 0x77
	Color m_AmbientColor2; // 0x7b
	Color m_AmbientColor3; // 0x7f
	float m_flSunDistance; // 0x84
	float m_flFOV; // 0x88
	float m_flNearZ; // 0x8c
	float m_flFarZ; // 0x90
	bool m_bEnableShadows; // 0x94
	bool m_bOldEnableShadows; // 0x95
	bool m_bBackgroundClearNotRequired; // 0x96
	float m_flCloudScale; // 0x98
	float m_flCloud1Speed; // 0x9c
	float m_flCloud1Direction; // 0xa0
	float m_flCloud2Speed; // 0xa4
	float m_flCloud2Direction; // 0xa8
	float m_flAmbientScale1; // 0xac
	float m_flAmbientScale2; // 0xb0
	float m_flGroundScale; // 0xb4
	float m_flLightScale; // 0xb8
	float m_flHeroLightScale; // 0xbc
	float m_flRainInnerRadius; // 0xc0
	float m_flRainOuterRadius; // 0xc4
	float m_flRainInnerAmount; // 0xc8
	float m_flFoWDarkness; // 0xcc
	bool m_bEnableSeparateSkyboxFog; // 0xd0
	Vector m_vFowColor; // 0xd4
	Vector m_ViewOrigin; // 0xe0
	QAngle m_ViewAngles; // 0xec
	float m_flViewFoV; // 0xf8
	Vector[8] m_WorldPoints; // 0xfc
	Vector2D m_vFogOffsetLayer0; // 0x4e8
	Vector2D m_vFogOffsetLayer1; // 0x4f0
	CHandle< C_BaseEntity > m_hEnvWind; // 0x4f8
	CHandle< C_BaseEntity > m_hEnvSky; // 0x4fc
	float m_fSmoothedAmount; // 0x500
	float m_fSlowSmoothedAmount; // 0x504
};

// Aligment: 9
// Size: 400
class CDeferredLightBase
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "32"
	Color m_LightColor; // 0x10
	// MNetworkEnable
	// MNetworkEnable
	float m_flIntensity; // 0x14
	// MNetworkEnable
	// MNetworkEnable
	float m_flLightSize; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	float m_flSpotFoV; // 0x1c
	// MNetworkEnable
	// MNetworkEnable
	QAngle m_vLightDirection; // 0x20
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartFalloff; // 0x2c
	// MNetworkEnable
	// MNetworkEnable
	float m_flDistanceFalloff; // 0x30
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_nFlags; // 0x34
	// MNetworkEnable
	// MNetworkEnable
	char[260] m_ProjectedTextureName; // 0x38
};

// Aligment: 107
// Size: 1016
class CLightInfoBase
{
public:
	Vector2D m_origin2D; // 0x10
	Color[2] m_Color; // 0x18
	float32[2] m_LightScale; // 0x20
	Color[2] m_HeroColor; // 0x28
	float32[2] m_HeroLightScale; // 0x30
	Color[2] m_AOGradientBottomColor; // 0x38
	bool m_bEnableRainFx; // 0x40
	float m_flRainInnerRadius; // 0x44
	float m_flRainOuterRadius; // 0x48
	float m_flRainInnerAmount; // 0x4c
	Color[2] m_AmbientColor; // 0x50
	float32[2] m_AmbientScale; // 0x58
	Color[2] m_ShadowColor; // 0x60
	Color[2] m_ShadowSecondaryColor; // 0x68
	float32[2] m_ShadowScale; // 0x70
	float32[2] m_ShadowGroundScale; // 0x78
	Color[2] m_SpecularColor; // 0x80
	float32[2] m_flSpecularPower; // 0x88
	float32[2] m_flSpecularIndependence; // 0x90
	Vector[2] m_SpecularDirection; // 0x98
	Vector[2] m_InspectorSpecularDirection; // 0xb0
	Vector[2] m_LightDirection; // 0xc8
	Vector[2] m_AmbientDirection; // 0xe0
	Color[2] m_FogColor; // 0xf8
	float32[2] m_FogStart; // 0x100
	float32[2] m_FogEnd; // 0x108
	float32[2] m_HeightFogValue; // 0x110
	Color[2] m_HeightFogColor; // 0x118
	float32[2] m_FoWDarkness; // 0x120
	float32[2] m_FoWColorR; // 0x128
	float32[2] m_FoWColorG; // 0x130
	float32[2] m_FoWColorB; // 0x138
	Color[2] m_InspectorViewFogColor; // 0x140
	QAngle m_windAngle; // 0x148
	float32[2] m_flWindAmount; // 0x154
	float m_flMinWind; // 0x15c
	float m_flMaxWind; // 0x160
	float m_flMinGust; // 0x164
	float m_flMaxGust; // 0x168
	float m_flMinGustDelay; // 0x16c
	float m_flMaxGustDelay; // 0x170
	float m_flGustDuration; // 0x174
	float m_flGustDirChange; // 0x178
	QAngle[2] m_skyboxAngle; // 0x17c
	CStrongHandle< InfoForResourceTypeIMaterial2 >[2] m_hSkyboxMaterial; // 0x198
	Color[2] m_vSkyboxTintColor; // 0x1a8
	uint8_t m_nSkyboxFogType; // 0x1b0
	float m_flSkyboxAngularFogMaxEnd; // 0x1b4
	float m_flSkyboxAngularFogMaxStart; // 0x1b8
	float m_flSkyboxAngularFogMinStart; // 0x1bc
	float m_flSkyboxAngularFogMinEnd; // 0x1c0
	Vector4D m_vAngularParams; // 0x1c4
	Color[2] m_vHeightFogColor; // 0x1d4
	float m_flFogMaxZ; // 0x1dc
	float32[2] m_flFogDensity; // 0x1e0
	float m_flFogFalloff; // 0x1e8
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTexture0; // 0x1f0
	float m_flFogLayer0Rotation; // 0x1f8
	float m_flFogLayer0Scale; // 0x1fc
	float32[2] m_flFoglayer0ScrollU; // 0x200
	float32[2] m_flFoglayer0ScrollV; // 0x208
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTexture1; // 0x210
	float m_flFogLayer1Rotation; // 0x218
	float m_flFogLayer1Scale; // 0x21c
	float32[2] m_flFoglayer1ScrollU; // 0x220
	float32[2] m_flFoglayer1ScrollV; // 0x228
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTextureOpacity; // 0x230
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hWaterFlowMapTexture; // 0x238
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogFlowMapTexture; // 0x240
	float m_flFogExclusionInnerRadius; // 0x248
	float m_flFogExclusionHeightBias; // 0x24c
	float m_flCausticSpeedScale; // 0x254
	float m_flCausticAmplitudeScale; // 0x258
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hColorWarp; // 0x260
	float m_flColorWarpBlendToFull; // 0x268
	float m_fInnerRadius; // 0x26c
	float m_fOuterRadius; // 0x270
	float m_flLightning_specular_pow_scale_min; // 0x274
	float m_flLightning_specular_pow_scale_max; // 0x278
	Color m_lightningColor; // 0x27c
	float m_flLightningIntensityMin; // 0x280
	float m_flLightningIntensityMax; // 0x284
	float m_flLightningElevation; // 0x288
	float m_flLightningSpecularIntensity; // 0x28c
	float m_flFarZOverride; // 0x290
	float m_flAmbientShadowAmount; // 0x294
	int32_t m_nWeatherType; // 0x298
	CUtlString m_WeatherEffect; // 0x2a0
	float m_flLightning_period_min; // 0x2a8
	float m_flLightning_period_max; // 0x2ac
	float m_flLightning_duration_min; // 0x2b0
	float m_flLightning_duration_max; // 0x2b4
	float m_flLightning_fluctuation_min; // 0x2b8
	float m_flLightning_fluctuation_max; // 0x2bc
	char[260] m_pszLightningSound; // 0x2c0
	float m_flNextLightningStartTime; // 0x3c4
	float m_flNextLightningEndTime; // 0x3c8
	float m_flLightningFluctuationTimeStart; // 0x3cc
	float m_flLightningFluctuationTimeEnd; // 0x3d0
	float m_flLightningNumFluctuations; // 0x3d4
	float m_flNextLightningSoundTime; // 0x3d8
	bool m_bPlayLightingSound; // 0x3dc
	float m_flLightningEventMagnitude; // 0x3e0
	float m_flLightningScale; // 0x3e4
	float m_flLightningFluctuation; // 0x3e8
	float m_flLightningAngle; // 0x3ec
	float m_flLightningEventPercentage; // 0x3f0
};

// Aligment: 1
// Size: 24
struct GCConsumedIDs_t
{
public:
	CUtlVector< item_definition_index_t > m_vecIDs; // 0x0
};

// Aligment: 4
// Size: 56
class CEntityInstance : public IHandleEntity
{
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8
	// MNetworkEnable
	// MNetworkPriority "112"
	CEntityIdentity* m_pEntity; // 0x10
	// MNetworkDisable
	CUtlStringToken m_worldGroupId; // 0x20
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x30
};

// Aligment: 1
// Size: 56
class CScriptComponent : public CEntityComponent
{
public:
	CUtlSymbolLarge m_scriptClassName; // 0x30
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fiels[1]->m_instance); }
};

// Aligment: 0
// Size: 56
class C_GameEntity : public CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 21
// Size: 1104
class C_BaseAnimatingController : public CSkeletonAnimationController
{
public:
	// MNetworkEnable
	// MNetworkChangeCallback "baseAnimBaseLayerChanged"
	CNetworkedSequenceOperation m_baseLayer; // 0x18
	// MNetworkDisable
	bool m_bSequenceFinished; // 0x58
	// MNetworkDisable
	float m_flGroundSpeed; // 0x5c
	// MNetworkDisable
	float m_flLastEventCycle; // 0x60
	// MNetworkDisable
	float m_flLastEventAnimTime; // 0x64
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "-4"
	// MNetworkMaxValue "12"
	// MNetworkEncodeFlags
	// MNetworkPriority "64"
	// MNetworkChangeCallback "playbackRateChanged"
	CNetworkedQuantizedFloat m_flPlaybackRate; // 0x68
	// MNetworkDisable
	float m_flPrevAnimTime; // 0x80
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkUserGroup "m_flPoseParameter"
	// MNetworkChangeCallback "poseParametersChanged"
	float32[24] m_flPoseParameter; // 0x84
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "clientSideAnimationChanged"
	bool m_bClientSideAnimation; // 0xe4
	// MNetworkDisable
	bool m_bNetworkedAnimationInputsChanged; // 0xe5
	// MNetworkDisable
	uint8_t m_nPrevNewSequenceParity; // 0xe6
	// MNetworkDisable
	uint8_t m_nPrevResetEventsParity; // 0xe7
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	// MNetworkPriority "64"
	// MNetworkChangeCallback "clientSideAnimCycleReset"
	int32_t m_nNewSequenceParity; // 0xe8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	// MNetworkPriority "64"
	int32_t m_nResetEventsParity; // 0xec
	// MNetworkDisable
	float m_flIKGroundContactTime; // 0xf0
	// MNetworkDisable
	float m_flIKGroundMinHeight; // 0xf4
	// MNetworkDisable
	float m_flIKGroundMaxHeight; // 0xf8
	// MNetworkDisable
	float m_flIkZAdjustAmount; // 0xfc
	// MNetworkDisable
	C_CSequenceTransitioner2 m_SequenceTransitioner; // 0x128
	// MNetworkDisable
	HSequence m_hLastAnimEventSequence; // 0x3a0
	// MNetworkDisable
	uint32_t m_ClientSideAnimationListHandle; // 0x3a4
};

// Aligment: 1
// Size: 1208
class C_BaseAnimatingOverlayController : public C_BaseAnimatingController, CSkeletonAnimationController
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "overlay_vars"
	// MNetworkChangeCallback "OnOverlaysChanged2"
	CUtlVector< CAnimationLayer > m_AnimOverlay; // 0x450
};

// Aligment: 2
// Size: 64
class CBodyComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	CGameSceneNode* m_pSceneNode; // 0x8
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x20
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fiels[1]->m_instance); }
};

// Aligment: 2
// Size: 448
class CBodyComponentPoint : public CBodyComponent, CEntityComponent
{
public:
	// MNetworkEnable
	CGameSceneNode m_sceneNode; // 0x40
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x1a0
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fiels[1]->m_instance); }
};

// Aligment: 2
// Size: 1312
class CBodyComponentSkeletonInstance : public CBodyComponent, CEntityComponent
{
public:
	// MNetworkEnable
	CSkeletonInstance m_skeletonInstance; // 0x40
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x500
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fiels[1]->m_instance); }
};

// Aligment: 0
// Size: 24
class CHitboxComponent : public CEntityComponent
{
public:
// <no members described>
};

// Aligment: 60
// Size: 400
class CLightComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x48
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_Color; // 0x75
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightness; // 0x7c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessMult; // 0x80
	// MNetworkEnable
	// MNetworkChangeCallback "LightRangeChanged"
	float m_flRange; // 0x84
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFalloff; // 0x88
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation0; // 0x8c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation1; // 0x90
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation2; // 0x94
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flTheta; // 0x98
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flPhi; // 0x9c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlStringToken m_lightCookie; // 0xa0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascades; // 0xa4
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	int32_t m_nCastShadows; // 0xa8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowWidth; // 0xac
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowHeight; // 0xb0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderDiffuse; // 0xb4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nRenderSpecular; // 0xb8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderTransmissive; // 0xbc
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flOrthoLightWidth; // 0xc0
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flOrthoLightHeight; // 0xc4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nStyle; // 0xc8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlString m_Pattern; // 0xd0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance0; // 0xd8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance1; // 0xdc
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance2; // 0xe0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance3; // 0xe4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution0; // 0xe8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution1; // 0xec
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution2; // 0xf0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution3; // 0xf4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nBakeLightIndex; // 0xf8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBakeLightIndexScale; // 0xfc
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bUsesIndexedBakedLighting; // 0x100
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderToCubemaps; // 0x101
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nPriority; // 0x104
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlSymbolLarge m_LightGroups; // 0x108
	// MNetworkEnable
	int32_t m_nDirectLight; // 0x110
	// MNetworkEnable
	int32_t m_nIndirectLight; // 0x114
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMinDist; // 0x118
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMaxDist; // 0x11c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMinDist; // 0x120
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMaxDist; // 0x124
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bEnabled; // 0x128
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bFlicker; // 0x129
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMins; // 0x12c
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMaxs; // 0x138
	// MNetworkEnable
	float m_flPrecomputedMaxRange; // 0x144
	// MNetworkEnable
	Vector m_vPrecomputePosition; // 0x148
	// MNetworkEnable
	Vector m_vPrecomputeDirection; // 0x154
	// MNetworkEnable
	Vector m_vPrecomputeUp; // 0x160
	// MNetworkEnable
	int32_t m_nFogLightingMode; // 0x16c
	// MNetworkEnable
	float m_flFogContributionStength; // 0x170
	// MNetworkEnable
	float m_flNearClipPlane; // 0x174
	// MNetworkEnable
	Color m_SkyColor; // 0x178
	// MNetworkEnable
	float m_flSkyIntensity; // 0x17c
	// MNetworkEnable
	bool m_bLowerHemisphereIsBlack; // 0x180
	// MNetworkEnable
	Color m_SkyAmbientBounce; // 0x181
	// MNetworkEnable
	// MNetworkChangeCallback "MixedShadowsChanged"
	bool m_bMixedShadows; // 0x185
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flLightStyleStartTime; // 0x188
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fiels[1]->m_instance); }
};

// Aligment: 5
// Size: 168
class CRenderComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x10
	bool m_bIsRenderingWithViewModels; // 0x40
	uint32_t m_nSplitscreenFlags; // 0x44
	bool m_bEnableRendering; // 0x50
	bool m_bInterpolationReadyToDraw; // 0xa0
public:
	static EntComponentInfo_t &Get_s_EntComponentInfo() { return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fiels[0]->m_instance); }
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fiels[1]->m_instance); }
};

// Aligment: 85
// Size: 1240
class C_BaseEntity : public C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "96"
	CBodyComponent* m_CBodyComponent; // 0x48
	CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x50
	CUtlString m_sPredictionCopyComment; // 0x268
	int32_t m_nLastThinkTick; // 0x280
	CGameSceneNode* m_pGameSceneNode; // 0x288
	CRenderComponent* m_pRenderComponent; // 0x290
	CCollisionProperty* m_pCollision; // 0x298
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	int32_t m_iMaxHealth; // 0x2a0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "64"
	int32_t m_iHealth; // 0x2a4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "64"
	uint8_t m_lifeState; // 0x2a8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	DamageOptions_t m_takedamage; // 0x2a9
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "2"
	// MNetworkChangeCallback "OnInterpolationFrameChanged"
	uint8_t m_ubInterpolationFrame; // 0x2aa
	CHandle< C_BaseEntity > m_hSceneObjectController; // 0x2ac
	int32_t m_nNoInterpolationTick; // 0x2b0
	float m_flProxyRandomValue; // 0x2b4
	int32_t m_iEFlags; // 0x2b8
	uint8_t m_nWaterType; // 0x2bc
	bool m_bInterpolateEvenWithNoModel; // 0x2bd
	bool m_bPredictionEligible; // 0x2be
	int32_t m_nSimulationTick; // 0x2c0
	int32_t m_iCurrentThinkContext; // 0x2c4
	CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x2c8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnAnimTimeChanged"
	float m_flAnimTime; // 0x2e0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	// MNetworkChangeCallback "OnSimulationTimeChanged"
	float m_flSimulationTime; // 0x2e4
	uint8_t m_nSceneObjectOverrideFlags; // 0x2e8
	bool m_bHasSuccessfullyInterpolated; // 0x2e9
	bool m_bHasAddedVarsToInterpolation; // 0x2ea
	bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x2eb
	int32[2] m_nInterpolationLatchDirtyFlags; // 0x2ec
	uint16[10] m_ListEntry; // 0x2f4
	// MNetworkEnable
	// MNetworkEnable
	float m_flCreateTime; // 0x308
	float m_flSpeed; // 0x30c
	int16_t m_EntClientFlags; // 0x310
	// MNetworkEnable
	// MNetworkEnable
	bool m_bClientSideRagdoll; // 0x312
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "6"
	// MNetworkChangeCallback "OnNetVarTeamNumChanged"
	uint8_t m_iTeamNum; // 0x313
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_spawnflags; // 0x314
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	int32_t m_nNextThinkTick; // 0x318
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkPriority "64"
	// MNetworkSerializer "CropFlagsToPlayerFlagBitsLength"
	// MNetworkUserGroup "Player"
	uint32_t m_fFlags; // 0x31c
	// MNetworkEnable
	Vector m_vecAbsVelocity; // 0x320
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkChangeCallback "OnLocalVelocityChanged"
	// MNetworkPriority "64"
	CNetworkVelocityVector m_vecVelocity; // 0x330
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	Vector m_vecBaseVelocity; // 0x398
	// MNetworkEnable
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hEffectEntity; // 0x3a4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "64"
	CHandle< C_BaseEntity > m_hOwnerEntity; // 0x3a8
	// MNetworkEnable
	// MNetworkEnable
	MoveCollide_t m_MoveCollide; // 0x3ac
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "OnMoveTypeChanged"
	MoveType_t m_MoveType; // 0x3ad
	// MNetworkEnable
	// MNetworkEnable
	gender_t m_Gender; // 0x3ae
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "2"
	// MNetworkUserGroup "Player"
	uint8_t m_nWaterLevel; // 0x3af
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; // 0x3b0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "64"
	// MNetworkUserGroup "Player"
	CHandle< C_BaseEntity > m_hGroundEntity; // 0x3b4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "4"
	// MNetworkEncodeFlags
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; // 0x3b8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkEncoder
	float m_flElasticity; // 0x3bc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bSimulatedEveryTick; // 0x3c0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bAnimatedEveryTick; // 0x3c1
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "2"
	uint8_t m_nMinCPULevel; // 0x3c2
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "2"
	uint8_t m_nMaxCPULevel; // 0x3c3
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	uint8_t m_nMinGPULevel; // 0x3c4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	uint8_t m_nMaxGPULevel; // 0x3c5
	// MNetworkEnable
	// MNetworkEnable
	float m_flNavIgnoreUntilTime; // 0x3c8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint8_t m_iTextureFrameIndex; // 0x3cc
	CBitVec< 1 > m_ShadowBits; // 0x3d0
	float m_flFirstReceivedTime; // 0x3d4
	float m_flLastMessageTime; // 0x3d8
	uint16_t m_hThink; // 0x3dc
	uint8_t m_fBBoxVisFlags; // 0x3e8
	bool m_bIsValidIKAttachment; // 0x3e9
	bool m_bPredictable; // 0x3ea
	bool m_bRenderWithViewModels; // 0x3eb
	CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x3ec
	CHandle< C_BaseEntity > m_hOldMoveParent; // 0x3f0
	CParticleProperty m_Particles; // 0x3f8
	CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x420
	CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x438
	int32_t m_nNextScriptVarRecordID; // 0x468
	int32_t m_nAnimGraphNetVarCreationCommandNumber; // 0x478
	QAngle m_vecAngVelocity; // 0x47c
	float m_flGroundChangeTime; // 0x488
	float m_flGravity; // 0x48c
	int32_t m_DataChangeEventRef; // 0x490
	CUtlVector< CEntityHandle > m_dependencies; // 0x498
	int32_t m_nCreationTick; // 0x4b0
	bool m_bIsDACNPC; // 0x4c8
	bool m_bIsNPC; // 0x4c9
	bool m_bAnimTimeChanged; // 0x4ca
	bool m_bSimulationTimeChanged; // 0x4cb
	bool m_bIsBlurred; // 0x4cc
public:
	static bool &Get_sm_bAccurateTriggerBboxChecks() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[0]->m_instance); }
	static bool &Get_sm_bDisableTouchFuncs() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[1]->m_instance); }
	static bool &Get_m_bAllowPrecache() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[2]->m_instance); }
	static LatchDirtyPermission_t &Get_s_nLatchPermissions() { return *reinterpret_cast<LatchDirtyPermission_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[3]->m_instance); }
	static int32_t &Get_m_nPredictionRandomSeed() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[4]->m_instance); }
	static C_BasePlayer* &Get_m_pPredictionPlayer() { return *reinterpret_cast<C_BasePlayer**>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[5]->m_instance); }
	static bool &Get_s_bAbsQueriesValid() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[6]->m_instance); }
	static bool &Get_s_bAbsRecomputationEnabled() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[7]->m_instance); }
	static bool &Get_s_bComputingInterpolatedValues() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[8]->m_instance); }
	static bool &Get_s_bPreventingSetAnimRunAnimEvents() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[9]->m_instance); }
	static CUtlVector< C_BaseEntity* > &Get_gm_UsableObjects() { return *reinterpret_cast<CUtlVector< C_BaseEntity* >*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fiels[10]->m_instance); }
};

// Aligment: 0
// Size: 1240
class CLogicalEntity : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 18
// Size: 1576
class C_ColorCorrection : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vecOrigin; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	float m_MinFalloff; // 0x4e4
	// MNetworkEnable
	// MNetworkEnable
	float m_MaxFalloff; // 0x4e8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeInDuration; // 0x4ec
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutDuration; // 0x4f0
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxWeight; // 0x4f4
	// MNetworkEnable
	// MNetworkEnable
	float m_flCurWeight; // 0x4f8
	// MNetworkEnable
	// MNetworkEnable
	char[260] m_netlookupFilename; // 0x4fc
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnabled; // 0x600
	// MNetworkEnable
	// MNetworkEnable
	bool m_bMaster; // 0x601
	// MNetworkEnable
	// MNetworkEnable
	bool m_bClientSide; // 0x602
	// MNetworkEnable
	// MNetworkEnable
	bool m_bExclusive; // 0x603
	bool[1] m_bEnabledOnClient; // 0x604
	float32[1] m_flCurWeightOnClient; // 0x608
	bool[1] m_bFadingIn; // 0x60c
	float32[1] m_flFadeStartWeight; // 0x610
	float32[1] m_flFadeStartTime; // 0x614
	float32[1] m_flFadeDuration; // 0x618
};

// Aligment: 1
// Size: 1816
class C_EnvWindClientside : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkDisable
	C_CEnvWindShared m_EnvWindShared; // 0x4d8
};

// Aligment: 3
// Size: 1288
class C_EntityFlame : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hEntAttached; // 0x4d8
	CHandle< C_BaseEntity > m_hOldAttached; // 0x500
	// MNetworkEnable
	// MNetworkEnable
	bool m_bCheapEffect; // 0x504
};

// Aligment: 10
// Size: 1280
class C_PostProcessController : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_fLocalContrastStrength; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	float m_fLocalContrastEdgeStrength; // 0x4dc
	// MNetworkEnable
	// MNetworkEnable
	float m_fVignetteStart; // 0x4e0
	// MNetworkEnable
	// MNetworkEnable
	float m_fVignetteEnd; // 0x4e4
	// MNetworkEnable
	// MNetworkEnable
	float m_fVignetteBlurStrength; // 0x4e8
	// MNetworkEnable
	// MNetworkEnable
	float m_fFadeToBlackStrength; // 0x4ec
	// MNetworkEnable
	// MNetworkEnable
	float m_fGrainStrength; // 0x4f0
	// MNetworkEnable
	// MNetworkEnable
	float m_fTopVignetteStrength; // 0x4f4
	// MNetworkEnable
	// MNetworkEnable
	float m_fFadeTime; // 0x4f8
	// MNetworkEnable
	// MNetworkEnable
	bool m_bMaster; // 0x4fc
};

// Aligment: 11
// Size: 2456
class C_PlayerResource : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge[34] m_szName; // 0x4f0
	Color[32] m_Colors; // 0x600
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32[34] m_iPing; // 0x680
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	int32[34] m_iScore; // 0x708
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "12"
	int32[34] m_iDeaths; // 0x790
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "OnConnectedFlagsChanged"
	bool[34] m_bConnected; // 0x818
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "4"
	int32[34] m_iTeam; // 0x83c
	// MNetworkEnable
	// MNetworkEnable
	bool[34] m_bAlive; // 0x8c4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32[34] m_iHealth; // 0x8e8
	bool[34] m_bIsFakePlayer; // 0x970
	int32_t m_nEventPlayerInfo; // 0x994
};

// Aligment: 4
// Size: 1392
class C_SkyCamera : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	sky3dparams_t m_skyboxData; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	CUtlStringToken m_skyboxSlotToken; // 0x560
	bool m_bUseAngles; // 0x564
	C_SkyCamera* m_pNext; // 0x568
};

// Aligment: 0
// Size: 1264
class C_TintController : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 7
// Size: 1416
class C_Team : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< C_BasePlayer > > m_aPlayers; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_iScore; // 0x4f0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	int32_t m_iRoundsWon; // 0x4f4
	// MNetworkEnable
	// MNetworkEnable
	char[129] m_szTeamname; // 0x4f8
	int32_t m_iDeaths; // 0x57c
	int32_t m_iPing; // 0x580
	int32_t m_iPacketloss; // 0x584
};

// Aligment: 0
// Size: 1240
class C_TriggerCamera : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 14
// Size: 48
class CClientAlphaProperty : public IClientAlphaProperty
{
public:
	uint8_t m_nRenderFX; // 0x10
	uint8_t m_nRenderMode; // 0x11
	bitfield:1 m_bAlphaOverride; // 0x0
	bitfield:1 m_bShadowAlphaOverride; // 0x0
	bitfield:1 m_nDistanceFadeMode; // 0x0
	bitfield:4 m_nReserved; // 0x0
	uint8_t m_nAlpha; // 0x13
	uint16_t m_nDesyncOffset; // 0x14
	uint16_t m_nReserved2; // 0x16
	uint16_t m_nDistFadeStart; // 0x18
	uint16_t m_nDistFadeEnd; // 0x1a
	float m_flFadeScale; // 0x1c
	float m_flRenderFxStartTime; // 0x20
	float m_flRenderFxDuration; // 0x24
};

// Aligment: 5
// Size: 1296
class CViewAngleAnimation : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_flAnimStartTime; // 0x4d8
	bool m_bFinished; // 0x4dc
	CUtlVector< CViewAngleKeyFrame* > m_KeyFrames; // 0x4e0
	QAngle m_vecBaseAngles; // 0x4f8
	int32_t m_iFlags; // 0x504
};

// Aligment: 2
// Size: 1248
class C_EnvDetailController : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeStartDist; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeEndDist; // 0x4dc
};

// Aligment: 0
// Size: 1240
class C_GameRulesProxy : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 15
// Size: 1328
class C_PoseController : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	bool m_bPoseValueParity; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	float m_fPoseValue; // 0x4dc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "10"
	float m_fInterpolationDuration; // 0x4e0
	// MNetworkEnable
	// MNetworkEnable
	bool m_bInterpolationWrap; // 0x4e4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "-10"
	// MNetworkMaxValue "10"
	float m_fCycleFrequency; // 0x4e8
	// MNetworkEnable
	// MNetworkEnable
	PoseController_FModType_t m_nFModType; // 0x4ec
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "-1"
	// MNetworkMaxValue "1"
	float m_fFModTimeOffset; // 0x4f0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "-10"
	// MNetworkMaxValue "10"
	float m_fFModRate; // 0x4f4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "10"
	float m_fFModAmplitude; // 0x4f8
	// MNetworkEnable
	// MNetworkEnable
	CHandle< C_BaseEntity >[4] m_hProps; // 0x4fc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "5"
	uint8[4] m_chPoseIndex; // 0x50c
	bool m_bOldPoseValueParity; // 0x510
	float m_fCurrentPoseValue; // 0x514
	float m_fCurrentFMod; // 0x518
	CInterpolatedValue m_PoseTransitionValue; // 0x51c
};

// Aligment: 17
// Size: 216
class C_EconItemView : public IEconItemInterface
{
public:
	// MNetworkEnable
	// MNetworkEnable
	item_definition_index_t m_iItemDefinitionIndex; // 0x8
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_iEntityQuality; // 0xc
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_iEntityLevel; // 0x10
	// MNetworkEnable
	// MNetworkEnable
	itemid_t m_iItemID; // 0x18
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_iAccountID; // 0x20
	// MNetworkEnable
	uint32_t m_iInventoryPosition; // 0x24
	// MNetworkEnable
	// MNetworkEnable
	bool m_bInitialized; // 0x30
	// MNetworkEnable
	// MNetworkEnable
	style_index_t m_nOverrideStyle; // 0x31
	bool m_bIsStoreItem; // 0x32
	bool m_bIsTradeItem; // 0x33
	bool m_bHasComputedAttachedParticles; // 0x34
	bool m_bHasAttachedParticles; // 0x35
	int32_t m_iEntityQuantity; // 0x38
	uint8_t m_unClientFlags; // 0x3c
	eEconItemOrigin m_unOverrideOrigin; // 0x40
	char* m_pszGrayedOutReason; // 0x50
	// MNetworkEnable
	// MNetworkEnable
	CAttributeList m_AttributeList; // 0x58
};

// Aligment: 1
// Size: 1248
class C_DACGameRulesProxy : public C_GameRulesProxy, C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "64"
	C_SingleplayRules* m_pGameRules; // 0x4d8
};

// Aligment: 0
// Size: 1240
class C_DacShadowmapBoundary : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 2648
class C_GlobalLight : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	uint16_t m_WindClothForceHandle; // 0xa30
public:
	static C_GlobalLight*[5] &Get_sm_pGlobalLight() { return *reinterpret_cast<C_GlobalLight*[5]*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_GlobalLight")->m_static_fiels[0]->m_instance); }
	static CUtlStringToken[5] &Get_sm_pSkyboxSlots() { return *reinterpret_cast<CUtlStringToken[5]*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_GlobalLight")->m_static_fiels[1]->m_instance); }
	static CUtlVector< C_GlobalLight* > &Get_sm_nonPrimaryGlobalLights() { return *reinterpret_cast<CUtlVector< C_GlobalLight* >*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_GlobalLight")->m_static_fiels[2]->m_instance); }
};

// Aligment: 0
// Size: 2256
class C_DOTA_LightInfo : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 15
// Size: 1560
class C_EnvCubemap : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x5b8
	// MNetworkEnable
	bool m_bCustomCubemapTexture; // 0x5c0
	// MNetworkEnable
	float m_flInfluenceRadius; // 0x5c4
	// MNetworkEnable
	Vector m_vBoxProjectMins; // 0x5c8
	// MNetworkEnable
	Vector m_vBoxProjectMaxs; // 0x5d4
	// MNetworkEnable
	CUtlSymbolLarge m_LightGroups; // 0x5e0
	// MNetworkEnable
	bool m_bMoveable; // 0x5e8
	// MNetworkEnable
	int32_t m_nHandshake; // 0x5ec
	// MNetworkEnable
	int32_t m_nEnvCubeMapArrayIndex; // 0x5f0
	// MNetworkEnable
	int32_t m_nIndoorOutdoorLevel; // 0x5f4
	// MNetworkEnable
	int32_t m_nGgxCubemapBlurAccumulationPassCount; // 0x5f8
	// MNetworkEnable
	float m_flEdgeFadeDist; // 0x5fc
	// MNetworkEnable
	bool m_bStartDisabled; // 0x600
	// MNetworkEnable
	bool m_bDefaultEnvMap; // 0x601
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnabled; // 0x610
};

// Aligment: 0
// Size: 1560
class C_EnvCubemapBox : public C_EnvCubemap, C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 11
// Size: 1288
class C_EnvCubemapFog : public C_BaseEntity, C_GameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flEndDistance; // 0x4d8
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartDistance; // 0x4dc
	// MNetworkEnable
	// MNetworkEnable
	float m_flFogFalloffExponent; // 0x4e0
	// MNetworkEnable
	// MNetworkEnable
	float m_flFogHeightWidth; // 0x4e4
	// MNetworkEnable
	// MNetworkEnable
	float m_flFogHeightStart; // 0x4e8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFogHeightExponent; // 0x4ec
	// MNetworkEnable
	// MNetworkEnable
