#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////
// Binary: client.dll
// Classes count: 402
// Enums count: 8
// /////////////////////////////////////////

// Alignment: 4
// Size: 0x5
enum class C_BaseCombatCharacter__WaterWakeMode_t : uint32_t
{ 
	WATER_WAKE_NONE = 0x0,
	WATER_WAKE_IDLE = 0x1,
	WATER_WAKE_WALKING = 0x2,
	WATER_WAKE_RUNNING = 0x3,
	WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Alignment: 4
// Size: 0x6
enum class CompositeMaterialMatchFilterType_t : uint32_t
{ 
	MATCH_FILTER_MATERIAL_ATTRIBUTE_EXISTS = 0x0,
	MATCH_FILTER_MATERIAL_SHADER = 0x1,
	MATCH_FILTER_MATERIAL_NAME_SUBSTR = 0x2,
	MATCH_FILTER_MATERIAL_ATTRIBUTE_EQUALS = 0x3,
	MATCH_FILTER_MATERIAL_PROPERTY_EXISTS = 0x4,
	MATCH_FILTER_MATERIAL_PROPERTY_EQUALS = 0x5,
};

// Alignment: 4
// Size: 0x2
enum class CompositeMaterialVarSystemVar_t : uint32_t
{ 
	COMPMATSYSVAR_COMPOSITETIME = 0x0,
	COMPMATSYSVAR_EMPTY_RESOURCE_SPACER = 0x1,
};

// Alignment: 4
// Size: 0xe
enum class CompositeMaterialInputLooseVariableType_t : uint32_t
{ 
	LOOSE_VARIABLE_TYPE_BOOLEAN = 0x0,
	LOOSE_VARIABLE_TYPE_INTEGER1 = 0x1,
	LOOSE_VARIABLE_TYPE_INTEGER2 = 0x2,
	LOOSE_VARIABLE_TYPE_INTEGER3 = 0x3,
	LOOSE_VARIABLE_TYPE_INTEGER4 = 0x4,
	LOOSE_VARIABLE_TYPE_FLOAT1 = 0x5,
	LOOSE_VARIABLE_TYPE_FLOAT2 = 0x6,
	LOOSE_VARIABLE_TYPE_FLOAT3 = 0x7,
	LOOSE_VARIABLE_TYPE_FLOAT4 = 0x8,
	LOOSE_VARIABLE_TYPE_COLOR4 = 0x9,
	LOOSE_VARIABLE_TYPE_STRING = 0xa,
	LOOSE_VARIABLE_TYPE_SYSTEMVAR = 0xb,
	LOOSE_VARIABLE_TYPE_RESOURCE_MATERIAL = 0xc,
	LOOSE_VARIABLE_TYPE_RESOURCE_TEXTURE = 0xd,
};

// Alignment: 4
// Size: 0x2
enum class CompositeMaterialInputTextureType_t : uint32_t
{ 
	INPUT_TEXTURE_TYPE_DEFAULT = 0x0,
	INPUT_TEXTURE_TYPE_NORMALMAP = 0x1,
};

// Alignment: 4
// Size: 0xa
enum class CompMatPropertyMutatorType_t : uint32_t
{ 
	COMP_MAT_PROPERTY_MUTATOR_INIT = 0x0,
	COMP_MAT_PROPERTY_MUTATOR_COPY_MATCHING_KEYS = 0x1,
	COMP_MAT_PROPERTY_MUTATOR_COPY_KEYS_WITH_SUFFIX = 0x2,
	COMP_MAT_PROPERTY_MUTATOR_COPY_PROPERTY = 0x3,
	COMP_MAT_PROPERTY_MUTATOR_SET_VALUE = 0x4,
	COMP_MAT_PROPERTY_MUTATOR_GENERATE_TEXTURE = 0x5,
	COMP_MAT_PROPERTY_MUTATOR_CONDITIONAL_MUTATORS = 0x6,
	COMP_MAT_PROPERTY_MUTATOR_POP_INPUT_QUEUE = 0x7,
	COMP_MAT_PROPERTY_MUTATOR_DRAW_TEXT = 0x8,
	COMP_MAT_PROPERTY_MUTATOR_RANDOM_ROLL_INPUT_VARIABLES = 0x9,
};

// Alignment: 4
// Size: 0x3
enum class CompMatPropertyMutatorConditionType_t : uint32_t
{ 
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_EXISTS = 0x0,
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_VALUE_EXISTS = 0x1,
	COMP_MAT_MUTATOR_CONDITION_INPUT_CONTAINER_VALUE_EQUALS = 0x2,
};

// Alignment: 4
// Size: 0x6
enum class CompositeMaterialInputContainerSourceType_t : uint32_t
{ 
	CONTAINER_SOURCE_TYPE_TARGET_MATERIAL = 0x0,
	CONTAINER_SOURCE_TYPE_MATERIAL_FROM_TARGET_ATTR = 0x1,
	CONTAINER_SOURCE_TYPE_SPECIFIC_MATERIAL = 0x2,
	CONTAINER_SOURCE_TYPE_LOOSE_VARIABLES = 0x3,
	CONTAINER_SOURCE_TYPE_VARIABLE_FROM_TARGET_ATTR = 0x4,
	CONTAINER_SOURCE_TYPE_TARGET_INSTANCE_MATERIAL = 0x5,
};

// Alignment: 11
// Size: 0x78
class CEntityIdentity : public 
{ 
public:
	// MNetworkEnable
	// MNetworkChangeCallback "entityIdentityNameChanged"
	int32_t m_nameStringableIndex; 	// 0x14
	CUtlSymbolLarge m_name; 	// 0x18
	CUtlSymbolLarge m_designerName; 	// 0x20
	uint32_t m_flags; 	// 0x30
	// MNetworkDisable
	WorldGroupId_t m_worldGroupId; 	// 0x38
	uint32_t m_fDataObjectTypes; 	// 0x3c
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	ChangeAccessorFieldPathIndex_t m_PathIndex; 	// 0x40
	CEntityIdentity* m_pPrev; 	// 0x58
	CEntityIdentity* m_pNext; 	// 0x60
	CEntityIdentity* m_pPrevByClass; 	// 0x68
	CEntityIdentity* m_pNextByClass; 	// 0x70
};

// Alignment: 3
// Size: 0x30
class CEntityInstance : public IHandleEntity
{ 
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; 	// 0x8
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity* m_pEntity; 	// 0x10
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; 	// 0x28
};

// Alignment: 1
// Size: 0x38
class CScriptComponent : public CEntityComponent
{ 
public:
	CUtlSymbolLarge m_scriptClassName; 	// 0x30
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x50
class CBodyComponent : public CEntityComponent
{ 
public:
	// MNetworkDisable
	CGameSceneNode* m_pSceneNode; 	// 0x8
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x20
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x1d0
class CBodyComponentPoint : public CBodyComponent, CEntityComponent
{ 
public:
	// MNetworkEnable
	CGameSceneNode m_sceneNode; 	// 0x50
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x1a0
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x470
class CBodyComponentSkeletonInstance : public CBodyComponent, CEntityComponent
{ 
public:
	// MNetworkEnable
	CSkeletonInstance m_skeletonInstance; 	// 0x50
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x440
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fields[1]->m_instance);};
};

// Alignment: 1
// Size: 0x28
class CHitboxComponent : public CEntityComponent
{ 
public:
	// MNetworkEnable
	uint32[1] m_bvDisabledHitGroups; 	// 0x24
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_referenced_but_impl_is_contained(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 67
// Size: 0x1c8
class CLightComponent : public CEntityComponent
{ 
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x48
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_Color; 	// 0x85
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_SecondaryColor; 	// 0x89
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightness; 	// 0x90
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessScale; 	// 0x94
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessMult; 	// 0x98
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flRange; 	// 0x9c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFalloff; 	// 0xa0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation0; 	// 0xa4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation1; 	// 0xa8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation2; 	// 0xac
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flTheta; 	// 0xb0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flPhi; 	// 0xb4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; 	// 0xb8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascades; 	// 0xc0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCastShadows; 	// 0xc4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowWidth; 	// 0xc8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowHeight; 	// 0xcc
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderDiffuse; 	// 0xd0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nRenderSpecular; 	// 0xd4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderTransmissive; 	// 0xd8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flOrthoLightWidth; 	// 0xdc
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flOrthoLightHeight; 	// 0xe0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nStyle; 	// 0xe4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlString m_Pattern; 	// 0xe8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascadeRenderStaticObjects; 	// 0xf0
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeCrossFade; 	// 0xf4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistanceFade; 	// 0xf8
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance0; 	// 0xfc
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance1; 	// 0x100
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance2; 	// 0x104
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance3; 	// 0x108
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution0; 	// 0x10c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution1; 	// 0x110
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution2; 	// 0x114
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution3; 	// 0x118
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bUsesBakedShadowing; 	// 0x11c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowPriority; 	// 0x120
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nBakedShadowIndex; 	// 0x124
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderToCubemaps; 	// 0x128
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlSymbolLarge m_LightGroups; 	// 0x130
	// MNetworkEnable
	int32_t m_nDirectLight; 	// 0x138
	// MNetworkEnable
	int32_t m_nIndirectLight; 	// 0x13c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMinDist; 	// 0x140
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMaxDist; 	// 0x144
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMinDist; 	// 0x148
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMaxDist; 	// 0x14c
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bEnabled; 	// 0x150
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bFlicker; 	// 0x151
	// MNetworkEnable
	bool m_bPrecomputedFieldsValid; 	// 0x152
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMins; 	// 0x154
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMaxs; 	// 0x160
	// MNetworkEnable
	Vector m_vPrecomputedOBBOrigin; 	// 0x16c
	// MNetworkEnable
	QAngle m_vPrecomputedOBBAngles; 	// 0x178
	// MNetworkEnable
	Vector m_vPrecomputedOBBExtent; 	// 0x184
	// MNetworkEnable
	float m_flPrecomputedMaxRange; 	// 0x190
	// MNetworkEnable
	int32_t m_nFogLightingMode; 	// 0x194
	// MNetworkEnable
	float m_flFogContributionStength; 	// 0x198
	// MNetworkEnable
	float m_flNearClipPlane; 	// 0x19c
	// MNetworkEnable
	Color m_SkyColor; 	// 0x1a0
	// MNetworkEnable
	float m_flSkyIntensity; 	// 0x1a4
	// MNetworkEnable
	Color m_SkyAmbientBounce; 	// 0x1a8
	// MNetworkEnable
	bool m_bUseSecondaryColor; 	// 0x1ac
	// MNetworkEnable
	// MNetworkChangeCallback "MixedShadowsChanged"
	bool m_bMixedShadows; 	// 0x1ad
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	GameTime_t m_flLightStyleStartTime; 	// 0x1b0
	// MNetworkEnable
	float m_flCapsuleLength; 	// 0x1b4
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flMinRoughness; 	// 0x1b8
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 5
// Size: 0xd8
class CRenderComponent : public CEntityComponent
{ 
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x10
	bool m_bIsRenderingWithViewModels; 	// 0x50
	uint32_t m_nSplitscreenFlags; 	// 0x54
	bool m_bEnableRendering; 	// 0x60
	bool m_bInterpolationReadyToDraw; 	// 0xb0
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 1
// Size: 0x20
class CBuoyancyHelper : public 
{ 
public:
	float m_flFluidDensity; 	// 0x18
};

// Alignment: 2
// Size: 0x80
class C_CommandContext : public 
{ 
public:
	bool needsprocessing; 	// 0x0
	int32_t command_number; 	// 0x78
};

// Alignment: 0
// Size: 0x40
class CPlayer_AutoaimServices : public CPlayerPawnComponent
{ 
public:
	// no members available
};

// Alignment: 5
// Size: 0x78
struct audioparams_t : public 
{ 
public:
	// MNetworkEnable
	// MNetworkEncoder
	Vector[8] localSound; 	// 0x8
	// MNetworkEnable
	int32_t soundscapeIndex; 	// 0x68
	// MNetworkEnable
	uint8_t localBits; 	// 0x6c
	// MNetworkEnable
	int32_t soundscapeEntityListIndex; 	// 0x70
	// MNetworkEnable
	uint32_t soundEventHash; 	// 0x74
};

// Alignment: 26
// Size: 0x248
class CPlayer_CameraServices : public CPlayerPawnComponent
{ 
public:
	// MNetworkEnable
	uint32_t m_iFOV; 	// 0x40
	// MNetworkEnable
	uint32_t m_iFOVStart; 	// 0x44
	// MNetworkEnable
	GameTime_t m_flFOVTime; 	// 0x48
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFOVRate; 	// 0x4c
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkBitCount "32"
	// MNetworkChangeCallback "OnPunchChanged"
	QAngle m_vecPunchAngle; 	// 0x50
	// MNetworkEnable
	// MNetworkBitCount "32"
	QAngle m_vecPunchAngleVel; 	// 0x68
	GameTick_t m_nPunchAngleJoltTickClientSide; 	// 0x80
	// MNetworkEnable
	// MNetworkChangeCallback "OnPunchJoltChanged"
	GameTick_t m_nPunchAngleJoltTick; 	// 0x84
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hZoomOwner; 	// 0x88
	// MNetworkEnable
	C_fogplayerparams_t m_PlayerFog; 	// 0x90
	// MNetworkEnable
	CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; 	// 0xd0
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hViewEntity; 	// 0xd4
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerAndObserversExclusive"
	CHandle< C_TonemapController2 > m_hTonemapController; 	// 0xd8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerAndObserversExclusive"
	audioparams_t m_audio; 	// 0xe0
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerAndObserversExclusive"
	C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; 	// 0x158
	float m_flOldPlayerZ; 	// 0x170
	float m_flOldPlayerViewOffsetZ; 	// 0x174
	fogparams_t m_CurrentFog; 	// 0x178
	CHandle< C_FogController > m_hOldFogController; 	// 0x1e0
	bool[5] m_bOverrideFogColor; 	// 0x1e4
	Color[5] m_OverrideFogColor; 	// 0x1e9
	bool[5] m_bOverrideFogStartEnd; 	// 0x1fd
	float32[5] m_fOverrideFogStart; 	// 0x204
	float32[5] m_fOverrideFogEnd; 	// 0x218
	CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; 	// 0x22c
	QAngle m_angDemoViewAngles; 	// 0x230
};

// Alignment: 0
// Size: 0x40
class CPlayer_FlashlightServices : public CPlayerPawnComponent
{ 
public:
	// no members available
};

// Alignment: 0
// Size: 0x40
class CPlayer_ItemServices : public CPlayerPawnComponent
{ 
public:
	// no members available
};

// Alignment: 14
// Size: 0x1b8
class CPlayer_MovementServices : public CPlayerPawnComponent
{ 
public:
	int32_t m_nImpulse; 	// 0x40
	CInButtonState m_nButtons; 	// 0x48
	uint64_t m_nQueuedButtonDownMask; 	// 0x68
	uint64_t m_nQueuedButtonChangeMask; 	// 0x70
	uint64_t m_nButtonDoublePressed; 	// 0x78
	uint32[64] m_pButtonPressedCmdNumber; 	// 0x80
	uint32_t m_nLastCommandNumberProcessed; 	// 0x180
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint64_t m_nToggleButtonDownMask; 	// 0x188
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "2048"
	// MNetworkEncodeFlags
	float m_flMaxspeed; 	// 0x190
	// MNetworkEnable
	float m_flForceSubtickMoveWhen; 	// 0x194
	float m_flForwardMove; 	// 0x198
	float m_flLeftMove; 	// 0x19c
	float m_flUpMove; 	// 0x1a0
	QAngle m_vecOldViewAngles; 	// 0x1a4
};

// Alignment: 12
// Size: 0x1f8
class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices, CPlayerPawnComponent
{ 
public:
	float m_flStepSoundTime; 	// 0x1b8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkBitCount "17"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	// MNetworkEncodeFlags
	float m_flFallVelocity; 	// 0x1bc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bInCrouch; 	// 0x1c0
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32_t m_nCrouchState; 	// 0x1c4
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	GameTime_t m_flCrouchTransitionStartTime; 	// 0x1c8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bDucked; 	// 0x1cc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bDucking; 	// 0x1cd
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bInDuckJump; 	// 0x1ce
	Vector m_groundNormal; 	// 0x1d0
	float m_flSurfaceFriction; 	// 0x1dc
	CUtlStringToken m_surfaceProps; 	// 0x1e0
	int32_t m_nStepside; 	// 0x1f0
};

// Alignment: 5
// Size: 0x58
class CPlayer_ObserverServices : public CPlayerPawnComponent
{ 
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnObserverModeChanged"
	uint8_t m_iObserverMode; 	// 0x40
	// MNetworkEnable
	// MNetworkChangeCallback "OnObserverTargetChanged"
	CHandle< C_BaseEntity > m_hObserverTarget; 	// 0x44
	ObserverMode_t m_iObserverLastMode; 	// 0x48
	bool m_bForcedObserverMode; 	// 0x4c
	float m_flObserverChaseDistance; 	// 0x50
};

// Alignment: 0
// Size: 0x40
class CPlayer_UseServices : public CPlayerPawnComponent
{ 
public:
	// no members available
};

// Alignment: 0
// Size: 0x40
class CPlayer_WaterServices : public CPlayerPawnComponent
{ 
public:
	// no members available
};

// Alignment: 5
// Size: 0xa8
class CPlayer_WeaponServices : public CPlayerPawnComponent
{ 
public:
	bool m_bAllowSwitchToNoWeapon; 	// 0x40
	// MNetworkEnable
	C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; 	// 0x48
	// MNetworkEnable
	CHandle< C_BasePlayerWeapon > m_hActiveWeapon; 	// 0x60
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	CHandle< C_BasePlayerWeapon > m_hLastWeapon; 	// 0x64
	// MNetworkEnable
	uint16[32] m_iAmmo; 	// 0x68
};

// Alignment: 2
// Size: 0x1730
class CBodyComponentBaseAnimGraph : public CBodyComponentSkeletonInstance, CBodyComponent, CEntityComponent
{ 
public:
	// MNetworkEnable
	CBaseAnimGraphController m_animationController; 	// 0x470
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x1708
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentBaseAnimGraph")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentBaseAnimGraph")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x48
struct EntityRenderAttribute_t : public 
{ 
public:
	// MNetworkEnable
	CUtlStringToken m_ID; 	// 0x30
	// MNetworkEnable
	Vector4D m_Values; 	// 0x34
};

// Alignment: 4
// Size: 0x68
struct ActiveModelConfig_t : public 
{ 
public:
	// MNetworkEnable
	ModelConfigHandle_t m_Handle; 	// 0x28
	// MNetworkEnable
	CUtlSymbolLarge m_Name; 	// 0x30
	// MNetworkEnable
	C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; 	// 0x38
	// MNetworkEnable
	C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; 	// 0x50
};

// Alignment: 1
// Size: 0x4a0
class CBodyComponentBaseModelEntity : public CBodyComponentSkeletonInstance, CBodyComponent, CEntityComponent
{ 
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x470
	static EntComponentInfo_t &Get_s_EntComponentInfo(){ return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentBaseModelEntity")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentBaseModelEntity")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x10
class CGameSceneNodeHandle : public 
{ 
public:
	// MNetworkEnable
	CEntityHandle m_hOwner; 	// 0x8
	// MNetworkEnable
	CUtlStringToken m_name; 	// 0xc
};

// Alignment: 33
// Size: 0x150
class CGameSceneNode : public 
{ 
public:
	// MNetworkDisable
	CTransform m_nodeToWorld; 	// 0x10
	// MNetworkDisable
	CEntityInstance* m_pOwner; 	// 0x30
	// MNetworkDisable
	CGameSceneNode* m_pParent; 	// 0x38
	// MNetworkDisable
	CGameSceneNode* m_pChild; 	// 0x40
	// MNetworkDisable
	CGameSceneNode* m_pNextSibling; 	// 0x48
	// MNetworkEnable
	// MNetworkSerializer "gameSceneNode"
	// MNetworkChangeCallback "gameSceneNodeHierarchyParentChanged"
	// MNetworkPriority "32"
	// MNetworkVarEmbeddedFieldOffsetDelta "8"
	CGameSceneNodeHandle m_hParent; 	// 0x70
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Origin"
	// MNetworkChangeCallback "gameSceneNodeLocalOriginChanged"
	CNetworkOriginCellCoordQuantizedVector m_vecOrigin; 	// 0x80
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkSerializer "gameSceneNodeStepSimulationAnglesSerializer"
	// MNetworkChangeCallback "gameSceneNodeLocalAnglesChanged"
	QAngle m_angRotation; 	// 0xb8
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeLocalScaleChanged"
	// MNetworkPriority "32"
	float m_flScale; 	// 0xc4
	// MNetworkDisable
	Vector m_vecAbsOrigin; 	// 0xc8
	// MNetworkDisable
	QAngle m_angAbsRotation; 	// 0xd4
	// MNetworkDisable
	float m_flAbsScale; 	// 0xe0
	// MNetworkDisable
	int16_t m_nParentAttachmentOrBone; 	// 0xe4
	// MNetworkDisable
	bool m_bDebugAbsOriginChanges; 	// 0xe6
	// MNetworkDisable
	bool m_bDormant; 	// 0xe7
	// MNetworkDisable
	bool m_bForceParentToBeNetworked; 	// 0xe8
	// MNetworkDisable
	uint8_t m_bDirtyHierarchy:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bDirtyBoneMergeInfo:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bNetworkedPositionChanged:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bNetworkedAnglesChanged:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bNetworkedScaleChanged:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bWillBeCallingPostDataUpdate:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bNotifyBoneTransformsChanged:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bBoneMergeFlex:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_nLatchAbsOrigin:2; 	// 0x0
	// MNetworkDisable
	uint8_t m_bDirtyBoneMergeBoneToRoot:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_nHierarchicalDepth; 	// 0xeb
	// MNetworkDisable
	uint8_t m_nHierarchyType; 	// 0xec
	// MNetworkDisable
	uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; 	// 0xed
	// MNetworkEnable
	CUtlStringToken m_name; 	// 0xf0
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeHierarchyAttachmentChanged"
	CUtlStringToken m_hierarchyAttachName; 	// 0x130
	// MNetworkDisable
	float m_flZOffset; 	// 0x134
	// MNetworkDisable
	Vector m_vRenderOrigin; 	// 0x138
};

// Alignment: 8
// Size: 0x28
class CNetworkedSequenceOperation : public 
{ 
public:
	// MNetworkEnable
	// MNetworkSerializer "minusone"
	// MNetworkChangeCallback "sequenceOpSequenceChanged"
	// MNetworkPriority "32"
	HSequence m_hSequence; 	// 0x8
	// MNetworkEnable
	// MNetworkBitCount "15"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkEncodeFlags
	// MNetworkPriority "32"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkUserGroup "m_flCycle"
	float m_flPrevCycle; 	// 0xc
	// MNetworkEnable
	// MNetworkBitCount "15"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkEncodeFlags
	// MNetworkPriority "32"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkUserGroup "m_flCycle"
	// MNetworkChangeCallback "sequenceOpCycleChanged"
	float m_flCycle; 	// 0x10
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkEncodeFlags
	CNetworkedQuantizedFloat m_flWeight; 	// 0x14
	// MNetworkDisable
	bool m_bSequenceChangeNetworked; 	// 0x1c
	// MNetworkDisable
	bool m_bDiscontinuity; 	// 0x1d
	// MNetworkDisable
	float m_flPrevCycleFromDiscontinuity; 	// 0x20
	// MNetworkDisable
	float m_flPrevCycleForAnimEventDetection; 	// 0x24
};

// Alignment: 7
// Size: 0x230
class CModelState : public 
{ 
public:
	// MNetworkEnable
	// MNetworkChangeCallback "skeletonModelChanged"
	CStrongHandle< InfoForResourceTypeCModel > m_hModel; 	// 0xa0
	// MNetworkDisable
	CUtlSymbolLarge m_ModelName; 	// 0xa8
	// MNetworkEnable
	bool m_bClientClothCreationSuppressed; 	// 0xe8
	// MNetworkEnable
	// MNetworkChangeCallback "skeletonMeshGroupMaskChanged"
	uint64_t m_MeshGroupMask; 	// 0x180
	// MNetworkEnable
	// MNetworkChangeCallback "skeletonMotionTypeChanged"
	int8_t m_nIdealMotionType; 	// 0x222
	// MNetworkDisable
	int8_t m_nForceLOD; 	// 0x223
	// MNetworkDisable
	int8_t m_nClothUpdateFlags; 	// 0x224
};

// Alignment: 8
// Size: 0x3f0
class CSkeletonInstance : public CGameSceneNode
{ 
public:
	// MNetworkEnable
	CModelState m_modelState; 	// 0x160
	// MNetworkEnable
	bool m_bIsAnimationEnabled; 	// 0x390
	// MNetworkEnable
	bool m_bUseParentRenderBounds; 	// 0x391
	// MNetworkDisable
	bool m_bDisableSolidCollisionsForHierarchy; 	// 0x392
	// MNetworkDisable
	uint8_t m_bDirtyMotionType:1; 	// 0x0
	// MNetworkDisable
	uint8_t m_bIsGeneratingLatchedParentSpaceState:1; 	// 0x0
	// MNetworkEnable
	// MNetworkChangeCallback "skeletonMaterialGroupChanged"
	CUtlStringToken m_materialGroup; 	// 0x394
	// MNetworkEnable
	uint8_t m_nHitboxSet; 	// 0x398
};

// Alignment: 2
// Size: 0x10
class IntervalTimer : public 
{ 
public:
	// MNetworkEnable
	GameTime_t m_timestamp; 	// 0x8
	// MNetworkEnable
	WorldGroupId_t m_nWorldGroupId; 	// 0xc
};

// Alignment: 4
// Size: 0x18
class CountdownTimer : public 
{ 
public:
	// MNetworkEnable
	float m_duration; 	// 0x8
	// MNetworkEnable
	GameTime_t m_timestamp; 	// 0xc
	// MNetworkEnable
	float m_timescale; 	// 0x10
	// MNetworkEnable
	WorldGroupId_t m_nWorldGroupId; 	// 0x14
};

// Alignment: 3
// Size: 0x18
class EngineCountdownTimer : public 
{ 
public:
	// MNetworkEnable
	float m_duration; 	// 0x8
	// MNetworkEnable
	float m_timestamp; 	// 0xc
	// MNetworkEnable
	float m_timescale; 	// 0x10
};

// Alignment: 7
// Size: 0x228
class CTimeline : public IntervalTimer
{ 
public:
	// MNetworkEnable
	float32[64] m_flValues; 	// 0x10
	// MNetworkEnable
	int32[64] m_nValueCounts; 	// 0x110
	// MNetworkEnable
	int32_t m_nBucketCount; 	// 0x210
	// MNetworkEnable
	float m_flInterval; 	// 0x214
	// MNetworkEnable
	float m_flFinalValue; 	// 0x218
	// MNetworkEnable
	TimelineCompression_t m_nCompressionType; 	// 0x21c
	// MNetworkEnable
	bool m_bStopped; 	// 0x220
};

// Alignment: 20
// Size: 0x1138
class CAnimGraphNetworkedVariables : public 
{ 
public:
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetBoolVarChanged"
	// MNetworkAlias "m_PredBoolVariables"
	C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; 	// 0x8
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetByteVarChanged"
	// MNetworkAlias "m_PredByteVariables"
	C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; 	// 0x20
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetUInt16VarChanged"
	// MNetworkAlias "m_PredUInt16Variables"
	C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; 	// 0x38
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetIntVarChanged"
	// MNetworkAlias "m_PredIntVariables"
	C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; 	// 0x50
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetUInt32VarChanged"
	// MNetworkAlias "m_PredUInt32Variables"
	C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; 	// 0x68
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetFloatVarChanged"
	// MNetworkAlias "m_PredFloatVariables"
	C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; 	// 0x80
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVectorVarChanged"
	// MNetworkAlias "m_PredVectorVariables"
	C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; 	// 0x98
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetQuaternionVarChanged"
	// MNetworkAlias "m_PredQuaternionVariables"
	C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; 	// 0xb0
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOBoolVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetBoolVariables"
	C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; 	// 0xc8
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOByteVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetByteVariables"
	C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; 	// 0xe0
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOUInt16VarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetUInt16Variables"
	C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; 	// 0xf8
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOIntVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetIntVariables"
	C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; 	// 0x110
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOUInt32VarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetUInt32Variables"
	C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; 	// 0x128
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOFloatVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetFloatVariables"
	C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; 	// 0x140
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOVectorVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetVectorVariables"
	C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; 	// 0x158
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkSendProxyRecipientsFilter
	// MNetworkChangeCallback "OnNetOOQuaternionVarChanged"
	// MNetworkAlias "m_OwnerOnlyPredNetQuaternionVariables"
	C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; 	// 0x170
	// MNetworkEnable
	int32_t m_nBoolVariablesCount; 	// 0x188
	// MNetworkEnable
	int32_t m_nOwnerOnlyBoolVariablesCount; 	// 0x18c
	// MNetworkEnable
	int32_t m_nRandomSeedOffset; 	// 0x190
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	float m_flLastTeleportTime; 	// 0x1120
};

// Alignment: 82
// Size: 0x538
class C_BaseEntity : public CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "48"
	CBodyComponent* m_CBodyComponent; 	// 0x30
	CNetworkTransmitComponent m_NetworkTransmitComponent; 	// 0x38
	GameTick_t m_nLastThinkTick; 	// 0x2f8
	CGameSceneNode* m_pGameSceneNode; 	// 0x300
	CRenderComponent* m_pRenderComponent; 	// 0x308
	CCollisionProperty* m_pCollision; 	// 0x310
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	int32_t m_iMaxHealth; 	// 0x318
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	int32_t m_iHealth; 	// 0x31c
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	uint8_t m_lifeState; 	// 0x320
	// MNetworkEnable
	bool m_bTakesDamage; 	// 0x321
	// MNetworkEnable
	TakeDamageFlags_t m_nTakeDamageFlags; 	// 0x324
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationFrameChanged"
	uint8_t m_ubInterpolationFrame; 	// 0x328
	CHandle< C_BaseEntity > m_hSceneObjectController; 	// 0x32c
	int32_t m_nNoInterpolationTick; 	// 0x330
	int32_t m_nVisibilityNoInterpolationTick; 	// 0x334
	float m_flProxyRandomValue; 	// 0x338
	int32_t m_iEFlags; 	// 0x33c
	uint8_t m_nWaterType; 	// 0x340
	bool m_bInterpolateEvenWithNoModel; 	// 0x341
	bool m_bPredictionEligible; 	// 0x342
	bool m_bApplyLayerMatchIDToModel; 	// 0x343
	CUtlStringToken m_tokLayerMatchID; 	// 0x344
	// MNetworkEnable
	// MNetworkChangeCallback "OnSubclassIDChanged"
	CUtlStringToken m_nSubclassID; 	// 0x348
	int32_t m_nSimulationTick; 	// 0x358
	int32_t m_iCurrentThinkContext; 	// 0x35c
	CUtlVector< thinkfunc_t > m_aThinkFunctions; 	// 0x360
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	// MNetworkChangeCallback "OnAnimTimeChanged"
	float m_flAnimTime; 	// 0x378
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	// MNetworkChangeCallback "OnSimulationTimeChanged"
	float m_flSimulationTime; 	// 0x37c
	uint8_t m_nSceneObjectOverrideFlags; 	// 0x380
	bool m_bHasSuccessfullyInterpolated; 	// 0x381
	bool m_bHasAddedVarsToInterpolation; 	// 0x382
	bool m_bRenderEvenWhenNotSuccessfullyInterpolated; 	// 0x383
	int32[2] m_nInterpolationLatchDirtyFlags; 	// 0x384
	uint16[11] m_ListEntry; 	// 0x38c
	// MNetworkEnable
	GameTime_t m_flCreateTime; 	// 0x3a4
	float m_flSpeed; 	// 0x3a8
	uint16_t m_EntClientFlags; 	// 0x3ac
	// MNetworkEnable
	bool m_bClientSideRagdoll; 	// 0x3ae
	// MNetworkEnable
	// MNetworkChangeCallback "OnNetVarTeamNumChanged"
	uint8_t m_iTeamNum; 	// 0x3af
	// MNetworkEnable
	uint32_t m_spawnflags; 	// 0x3b0
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	GameTick_t m_nNextThinkTick; 	// 0x3b4
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	uint32_t m_fFlags; 	// 0x3b8
	Vector m_vecAbsVelocity; 	// 0x3bc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkChangeCallback "OnLocalVelocityChanged"
	// MNetworkPriority "32"
	CNetworkVelocityVector m_vecVelocity; 	// 0x3c8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	Vector m_vecBaseVelocity; 	// 0x3f8
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hEffectEntity; 	// 0x404
	// MNetworkEnable
	// MNetworkPriority "32"
	CHandle< C_BaseEntity > m_hOwnerEntity; 	// 0x408
	// MNetworkEnable
	MoveCollide_t m_MoveCollide; 	// 0x40c
	// MNetworkEnable
	// MNetworkChangeCallback "OnMoveTypeChanged"
	MoveType_t m_MoveType; 	// 0x40d
	// MNetworkEnable
	// MNetworkUserGroup "Water"
	// MNetworkChangeCallback "OnWaterLevelChangeNetworked"
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkEncodeFlags
	float m_flWaterLevel; 	// 0x410
	// MNetworkEnable
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; 	// 0x414
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CHandle< C_BaseEntity > m_hGroundEntity; 	// 0x418
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "4"
	// MNetworkEncodeFlags
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; 	// 0x41c
	// MNetworkEnable
	// MNetworkEncoder
	float m_flElasticity; 	// 0x420
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flGravityScale; 	// 0x424
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flTimeScale; 	// 0x428
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bSimulatedEveryTick; 	// 0x42c
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bAnimatedEveryTick; 	// 0x42d
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMinCPULevel; 	// 0x42e
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMaxCPULevel; 	// 0x42f
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMinGPULevel; 	// 0x430
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMaxGPULevel; 	// 0x431
	// MNetworkEnable
	// MNetworkChangeCallback "OnNavIgnoreChanged"
	GameTime_t m_flNavIgnoreUntilTime; 	// 0x434
	uint16_t m_hThink; 	// 0x438
	uint8_t m_fBBoxVisFlags; 	// 0x448
	bool m_bPredictable; 	// 0x449
	bool m_bRenderWithViewModels; 	// 0x44a
	CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; 	// 0x44c
	int32_t m_nFirstPredictableCommand; 	// 0x450
	int32_t m_nLastPredictableCommand; 	// 0x454
	CHandle< C_BaseEntity > m_hOldMoveParent; 	// 0x458
	CParticleProperty m_Particles; 	// 0x460
	CUtlVector< float32 > m_vecPredictedScriptFloats; 	// 0x488
	CUtlVector< int32 > m_vecPredictedScriptFloatIDs; 	// 0x4a0
	int32_t m_nNextScriptVarRecordID; 	// 0x4d0
	QAngle m_vecAngVelocity; 	// 0x4e0
	int32_t m_DataChangeEventRef; 	// 0x4ec
	CUtlVector< CEntityHandle > m_dependencies; 	// 0x4f0
	int32_t m_nCreationTick; 	// 0x508
	bool m_bAnimTimeChanged; 	// 0x521
	bool m_bSimulationTimeChanged; 	// 0x522
	CUtlString m_sUniqueHammerID; 	// 0x530
	static bool &Get_sm_bDatadescValidating(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[0]->m_instance);};
	static bool &Get_sm_bAccurateTriggerBboxChecks(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[1]->m_instance);};
	static bool &Get_sm_bDisableTouchFuncs(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[2]->m_instance);};
	static bool &Get_m_bAllowPrecache(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[3]->m_instance);};
	static LatchDirtyPermission_t &Get_s_nLatchPermissions(){ return *reinterpret_cast<LatchDirtyPermission_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[4]->m_instance);};
	static int32_t &Get_m_nPredictionRandomSeed(){ return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[5]->m_instance);};
	static CBasePlayerController* &Get_m_pPredictionPlayerController(){ return *reinterpret_cast<CBasePlayerController**>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[6]->m_instance);};
	static bool &Get_s_bAbsQueriesValid(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[7]->m_instance);};
	static bool &Get_s_bAbsRecomputationEnabled(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[8]->m_instance);};
	static bool &Get_s_bComputingInterpolatedValues(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[9]->m_instance);};
	static bool &Get_s_bPreventingSetAnimRunAnimEvents(){ return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[10]->m_instance);};
	static CUtlVector< C_BaseEntity* > &Get_gm_UsableObjects(){ return *reinterpret_cast<CUtlVector< C_BaseEntity* >*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[11]->m_instance);};
};

// Alignment: 0
// Size: 0x538
class CLogicalEntity : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// no members available
};

// Alignment: 5
// Size: 0x20
class C_BaseFlex::Emphasized_Phoneme : public 
{ 
public:
	CUtlString m_sClassName; 	// 0x0
	float m_flAmount; 	// 0x18
	bool m_bRequired; 	// 0x1c
	bool m_bBasechecked; 	// 0x1d
	bool m_bValid; 	// 0x1e
};

// Alignment: 18
// Size: 0x780
class C_ColorCorrection : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	Vector m_vecOrigin; 	// 0x538
	// MNetworkEnable
	float m_MinFalloff; 	// 0x544
	// MNetworkEnable
	float m_MaxFalloff; 	// 0x548
	// MNetworkEnable
	float m_flFadeInDuration; 	// 0x54c
	// MNetworkEnable
	float m_flFadeOutDuration; 	// 0x550
	// MNetworkEnable
	float m_flMaxWeight; 	// 0x554
	// MNetworkEnable
	float m_flCurWeight; 	// 0x558
	// MNetworkEnable
	char[512] m_netlookupFilename; 	// 0x55c
	// MNetworkEnable
	bool m_bEnabled; 	// 0x75c
	// MNetworkEnable
	bool m_bMaster; 	// 0x75d
	// MNetworkEnable
	bool m_bClientSide; 	// 0x75e
	// MNetworkEnable
	bool m_bExclusive; 	// 0x75f
	bool[1] m_bEnabledOnClient; 	// 0x760
	float32[1] m_flCurWeightOnClient; 	// 0x764
	bool[1] m_bFadingIn; 	// 0x768
	float32[1] m_flFadeStartWeight; 	// 0x76c
	float32[1] m_flFadeStartTime; 	// 0x770
	float32[1] m_flFadeDuration; 	// 0x774
};

// Alignment: 1
// Size: 0x740
class C_EnvWindClientside : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	// MNetworkDisable
	C_EnvWindShared m_EnvWindShared; 	// 0x538
};

// Alignment: 3
// Size: 0x570
class C_EntityFlame : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hEntAttached; 	// 0x538
	CHandle< C_BaseEntity > m_hOldAttached; 	// 0x560
	// MNetworkEnable
	bool m_bCheapEffect; 	// 0x564
};

// Alignment: 30
// Size: 0x2e0
class CProjectedTextureBase : public 
{ 
public:
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hTargetEntity; 	// 0xc
	// MNetworkEnable
	bool m_bState; 	// 0x10
	// MNetworkEnable
	bool m_bAlwaysUpdate; 	// 0x11
	// MNetworkEnable
	float m_flLightFOV; 	// 0x14
	// MNetworkEnable
	bool m_bEnableShadows; 	// 0x18
	// MNetworkEnable
	bool m_bSimpleProjection; 	// 0x19
	// MNetworkEnable
	bool m_bLightOnlyTarget; 	// 0x1a
	// MNetworkEnable
	bool m_bLightWorld; 	// 0x1b
	// MNetworkEnable
	bool m_bCameraSpace; 	// 0x1c
	// MNetworkEnable
	float m_flBrightnessScale; 	// 0x20
	// MNetworkEnable
	Color m_LightColor; 	// 0x24
	// MNetworkEnable
	float m_flIntensity; 	// 0x28
	// MNetworkEnable
	float m_flLinearAttenuation; 	// 0x2c
	// MNetworkEnable
	float m_flQuadraticAttenuation; 	// 0x30
	// MNetworkEnable
	bool m_bVolumetric; 	// 0x34
	// MNetworkEnable
	float m_flVolumetricIntensity; 	// 0x38
	// MNetworkEnable
	float m_flNoiseStrength; 	// 0x3c
	// MNetworkEnable
	float m_flFlashlightTime; 	// 0x40
	// MNetworkEnable
	uint32_t m_nNumPlanes; 	// 0x44
	// MNetworkEnable
	float m_flPlaneOffset; 	// 0x48
	// MNetworkEnable
	float m_flColorTransitionTime; 	// 0x4c
	// MNetworkEnable
	float m_flAmbient; 	// 0x50
	// MNetworkEnable
	char[512] m_SpotlightTextureName; 	// 0x54
	// MNetworkEnable
	int32_t m_nSpotlightTextureFrame; 	// 0x254
	// MNetworkEnable
	uint32_t m_nShadowQuality; 	// 0x258
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "500"
	// MNetworkEncodeFlags
	float m_flNearZ; 	// 0x25c
	// MNetworkEnable
	// MNetworkBitCount "18"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1500"
	// MNetworkEncodeFlags
	float m_flFarZ; 	// 0x260
	// MNetworkEnable
	float m_flProjectionSize; 	// 0x264
	// MNetworkEnable
	float m_flRotation; 	// 0x268
	// MNetworkEnable
	bool m_bFlipHorizontal; 	// 0x26c
	static float &Get_m_flVisibleBBoxMinHeight(){ return *reinterpret_cast<float*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CProjectedTextureBase")->m_static_fields[0]->m_instance);};
};

// Alignment: 4
// Size: 0x548
class C_BaseFire : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	float m_flScale; 	// 0x538
	// MNetworkEnable
	float m_flStartScale; 	// 0x53c
	// MNetworkEnable
	float m_flScaleTime; 	// 0x540
	// MNetworkEnable
	uint32_t m_nFlags; 	// 0x544
};

// Alignment: 13
// Size: 0x5b0
class C_FireSmoke : public C_BaseFire, C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	int32_t m_nFlameModelIndex; 	// 0x548
	// MNetworkEnable
	int32_t m_nFlameFromAboveModelIndex; 	// 0x54c
	float m_flScaleRegister; 	// 0x550
	float m_flScaleStart; 	// 0x554
	float m_flScaleEnd; 	// 0x558
	GameTime_t m_flScaleTimeStart; 	// 0x55c
	GameTime_t m_flScaleTimeEnd; 	// 0x560
	float m_flChildFlameSpread; 	// 0x564
	float m_flClipPerc; 	// 0x578
	bool m_bClipTested; 	// 0x57c
	bool m_bFadingOut; 	// 0x57d
	TimedEvent m_tParticleSpawn; 	// 0x580
	CFireOverlay* m_pFireOverlay; 	// 0x588
};

// Alignment: 1
// Size: 0x10
class C_RopeKeyframe::CPhysicsDelegate : public 
{ 
public:
	C_RopeKeyframe* m_pKeyframe; 	// 0x8
};

// Alignment: 1
// Size: 0x18
struct C_SceneEntity__QueuedEvents_t : public 
{ 
public:
	float starttime; 	// 0x0
};

// Alignment: 0
// Size: 0x550
class C_TintController : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// no members available
};

// Alignment: 0
// Size: 0x538
class C_TriggerCamera : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// no members available
};

// Alignment: 13
// Size: 0x2e0
class CFlashlightEffect : public 
{ 
public:
	bool m_bIsOn; 	// 0x10
	bool m_bMuzzleFlashEnabled; 	// 0x20
	float m_flMuzzleFlashBrightness; 	// 0x24
	Quaternion m_quatMuzzleFlashOrientation; 	// 0x30
	Vector m_vecMuzzleFlashOrigin; 	// 0x40
	float m_flFov; 	// 0x4c
	float m_flFarZ; 	// 0x50
	float m_flLinearAtten; 	// 0x54
	bool m_bCastsShadows; 	// 0x58
	float m_flCurrentPullBackDist; 	// 0x5c
	CStrongHandle< InfoForResourceTypeCTextureBase > m_FlashlightTexture; 	// 0x60
	CStrongHandle< InfoForResourceTypeCTextureBase > m_MuzzleFlashTexture; 	// 0x68
	char[64] m_textureName; 	// 0x70
};

// Alignment: 5
// Size: 0x14
class CInterpolatedValue : public 
{ 
public:
	float m_flStartTime; 	// 0x0
	float m_flEndTime; 	// 0x4
	float m_flStartValue; 	// 0x8
	float m_flEndValue; 	// 0xc
	int32_t m_nInterpType; 	// 0x10
};

// Alignment: 4
// Size: 0x20
class CGlowSprite : public 
{ 
public:
	Vector m_vColor; 	// 0x0
	float m_flHorzSize; 	// 0xc
	float m_flVertSize; 	// 0x10
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; 	// 0x18
};

// Alignment: 15
// Size: 0xd0
class CGlowOverlay : public 
{ 
public:
	Vector m_vPos; 	// 0x8
	bool m_bDirectional; 	// 0x14
	Vector m_vDirection; 	// 0x18
	bool m_bInSky; 	// 0x24
	float m_skyObstructionScale; 	// 0x28
	CGlowSprite[4] m_Sprites; 	// 0x30
	int32_t m_nSprites; 	// 0xb0
	float m_flProxyRadius; 	// 0xb4
	float m_flHDRColorScale; 	// 0xb8
	float m_flGlowObstructionScale; 	// 0xbc
	bool m_bCacheGlowObstruction; 	// 0xc0
	bool m_bCacheSkyObstruction; 	// 0xc1
	int16_t m_bActivated; 	// 0xc2
	uint16_t m_ListIndex; 	// 0xc4
	int32_t m_queryHandle; 	// 0xc8
};

// Alignment: 0
// Size: 0x8
class IClientAlphaProperty : public 
{ 
public:
	// no members available
};

// Alignment: 2
// Size: 0x540
class CSkyboxReference : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	WorldGroupId_t m_worldGroupId; 	// 0x538
	CHandle< C_SkyCamera > m_hSkyCamera; 	// 0x53c
};

// Alignment: 4
// Size: 0x5d8
class C_SkyCamera : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	sky3dparams_t m_skyboxData; 	// 0x538
	// MNetworkEnable
	CUtlStringToken m_skyboxSlotToken; 	// 0x5c8
	bool m_bUseAngles; 	// 0x5cc
	C_SkyCamera* m_pNext; 	// 0x5d0
};

// Alignment: 2
// Size: 0x8
class TimedEvent : public 
{ 
public:
	float m_TimeBetweenEvents; 	// 0x0
	float m_fNextEvent; 	// 0x4
};

// Alignment: 8
// Size: 0x30
struct VPhysicsCollisionAttribute_t : public 
{ 
public:
	// MNetworkEnable
	uint64_t m_nInteractsAs; 	// 0x8
	// MNetworkEnable
	uint64_t m_nInteractsWith; 	// 0x10
	// MNetworkEnable
	uint64_t m_nInteractsExclude; 	// 0x18
	// MNetworkEnable
	uint32_t m_nEntityId; 	// 0x20
	// MNetworkEnable
	uint32_t m_nOwnerId; 	// 0x24
	// MNetworkEnable
	uint16_t m_nHierarchyId; 	// 0x28
	// MNetworkEnable
	uint8_t m_nCollisionGroup; 	// 0x2a
	// MNetworkEnable
	uint8_t m_nCollisionFunctionMask; 	// 0x2b
};

// Alignment: 17
// Size: 0xb0
class CCollisionProperty : public 
{ 
public:
	// MNetworkEnable
	// MNetworkChangeCallback "CollisionAttributeChanged"
	VPhysicsCollisionAttribute_t m_collisionAttribute; 	// 0x10
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMins; 	// 0x40
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMaxs; 	// 0x4c
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidFlags"
	uint8_t m_usSolidFlags; 	// 0x5a
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidType"
	SolidType_t m_nSolidType; 	// 0x5b
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	uint8_t m_triggerBloat; 	// 0x5c
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	SurroundingBoundsType_t m_nSurroundType; 	// 0x5d
	// MNetworkEnable
	uint8_t m_CollisionGroup; 	// 0x5e
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateEnablePhysics"
	uint8_t m_nEnablePhysics; 	// 0x5f
	float m_flBoundingRadius; 	// 0x60
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMins; 	// 0x64
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMaxs; 	// 0x70
	Vector m_vecSurroundingMaxs; 	// 0x7c
	Vector m_vecSurroundingMins; 	// 0x88
	// MNetworkEnable
	Vector m_vCapsuleCenter1; 	// 0x94
	// MNetworkEnable
	Vector m_vCapsuleCenter2; 	// 0xa0
	// MNetworkEnable
	float m_flCapsuleRadius; 	// 0xac
};

// Alignment: 10
// Size: 0x98
class CDecalInfo : public 
{ 
public:
	float m_flAnimationScale; 	// 0x0
	float m_flAnimationLifeSpan; 	// 0x4
	float m_flPlaceTime; 	// 0x8
	float m_flFadeStartTime; 	// 0xc
	float m_flFadeDuration; 	// 0x10
	int32_t m_nVBSlot; 	// 0x14
	int32_t m_nBoneIndex; 	// 0x18
	CDecalInfo* m_pNext; 	// 0x28
	CDecalInfo* m_pPrev; 	// 0x30
	int32_t m_nDecalMaterialIndex; 	// 0x90
};

// Alignment: 21
// Size: 0x70
class CEffectData : public 
{ 
public:
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_vOrigin; 	// 0x8
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_vStart; 	// 0x14
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_vNormal; 	// 0x20
	// MNetworkEnable
	// MNetworkEncoder
	QAngle m_vAngles; 	// 0x2c
	// MNetworkEnable
	CEntityHandle m_hEntity; 	// 0x38
	// MNetworkEnable
	CEntityHandle m_hOtherEntity; 	// 0x3c
	// MNetworkEnable
	float m_flScale; 	// 0x40
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1023"
	// MNetworkEncodeFlags
	float m_flMagnitude; 	// 0x44
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1023"
	// MNetworkEncodeFlags
	float m_flRadius; 	// 0x48
	// MNetworkEnable
	CUtlStringToken m_nSurfaceProp; 	// 0x4c
	// MNetworkEnable
	CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > m_nEffectIndex; 	// 0x50
	// MNetworkEnable
	uint32_t m_nDamageType; 	// 0x58
	// MNetworkEnable
	uint8_t m_nPenetrate; 	// 0x5c
	// MNetworkEnable
	uint16_t m_nMaterial; 	// 0x5e
	// MNetworkEnable
	uint16_t m_nHitBox; 	// 0x60
	// MNetworkEnable
	uint8_t m_nColor; 	// 0x62
	// MNetworkEnable
	uint8_t m_fFlags; 	// 0x63
	// MNetworkEnable
	AttachmentHandle_t m_nAttachmentIndex; 	// 0x64
	// MNetworkEnable
	CUtlStringToken m_nAttachmentName; 	// 0x68
	// MNetworkEnable
	uint16_t m_iEffectName; 	// 0x6c
	// MNetworkEnable
	uint8_t m_nExplosionType; 	// 0x6e
};

// Alignment: 2
// Size: 0x540
class C_EnvDetailController : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// MNetworkEnable
	float m_flFadeStartDist; 	// 0x538
	// MNetworkEnable
	float m_flFadeEndDist; 	// 0x53c
};

// Alignment: 29
// Size: 0x208
class C_EnvWindShared : public 
{ 
public:
	// MNetworkEnable
	GameTime_t m_flStartTime; 	// 0x8
	// MNetworkEnable
	uint32_t m_iWindSeed; 	// 0xc
	// MNetworkEnable
	uint16_t m_iMinWind; 	// 0x10
	// MNetworkEnable
	uint16_t m_iMaxWind; 	// 0x12
	// MNetworkEnable
	int32_t m_windRadius; 	// 0x14
	// MNetworkEnable
	uint16_t m_iMinGust; 	// 0x18
	// MNetworkEnable
	uint16_t m_iMaxGust; 	// 0x1a
	// MNetworkEnable
	float m_flMinGustDelay; 	// 0x1c
	// MNetworkEnable
	float m_flMaxGustDelay; 	// 0x20
	// MNetworkEnable
	float m_flGustDuration; 	// 0x24
	// MNetworkEnable
	uint16_t m_iGustDirChange; 	// 0x28
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_location; 	// 0x2c
	int32_t m_iszGustSound; 	// 0x38
	int32_t m_iWindDir; 	// 0x3c
	float m_flWindSpeed; 	// 0x40
	Vector m_currentWindVector; 	// 0x44
	Vector m_CurrentSwayVector; 	// 0x50
	Vector m_PrevSwayVector; 	// 0x5c
	// MNetworkEnable
	uint16_t m_iInitialWindDir; 	// 0x68
	// MNetworkEnable
	float m_flInitialWindSpeed; 	// 0x6c
	GameTime_t m_flVariationTime; 	// 0x70
	GameTime_t m_flSwayTime; 	// 0x74
	GameTime_t m_flSimTime; 	// 0x78
	GameTime_t m_flSwitchTime; 	// 0x7c
	float m_flAveWindSpeed; 	// 0x80
	bool m_bGusting; 	// 0x84
	float m_flWindAngleVariation; 	// 0x88
	float m_flWindSpeedVariation; 	// 0x8c
	CEntityIndex m_iEntIndex; 	// 0x90
};

// Alignment: 2
// Size: 0x8
struct C_EnvWindShared__WindAveEvent_t : public 
{ 
public:
	float m_flStartWindSpeed; 	// 0x0
	float m_flAveWindSpeed; 	// 0x4
};

// Alignment: 2
// Size: 0x8
struct C_EnvWindShared__WindVariationEvent_t : public 
{ 
public:
	float m_flWindAngleVariation; 	// 0x0
	float m_flWindSpeedVariation; 	// 0x4
};

// Alignment: 0
// Size: 0x538
class C_InfoLadderDismount : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// no members available
};

// Alignment: 13
// Size: 0x60
struct shard_model_desc_t : public 
{ 
public:
	// MNetworkEnable
	int32_t m_nModelID; 	// 0x8
	// MNetworkEnable
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; 	// 0x10
	// MNetworkEnable
	ShardSolid_t m_solid; 	// 0x18
	// MNetworkEnable
	ShatterPanelMode m_ShatterPanelMode; 	// 0x19
	// MNetworkEnable
	Vector2D m_vecPanelSize; 	// 0x1c
	// MNetworkEnable
	Vector2D m_vecStressPositionA; 	// 0x24
	// MNetworkEnable
	Vector2D m_vecStressPositionB; 	// 0x2c
	// MNetworkEnable
	C_NetworkUtlVectorBase< Vector2D > m_vecPanelVertices; 	// 0x38
	// MNetworkEnable
	float m_flGlassHalfThickness; 	// 0x50
	// MNetworkEnable
	bool m_bHasParent; 	// 0x54
	// MNetworkEnable
	bool m_bParentFrozen; 	// 0x55
	// MNetworkEnable
	CUtlStringToken m_SurfacePropStringToken; 	// 0x58
	// MNetworkEnable
	CUtlStringToken m_LightGroup; 	// 0x5c
};

// Alignment: 0
// Size: 0x538
class C_GameRulesProxy : public C_BaseEntity, CEntityInstance, IHandleEntity
{ 
public:
	// no members available
};

// Alignment: 0
// Size: 0x8
class C_GameRules : public 
{ 
public:
	// no members available
};

// Alignment: 11
// Size: 0x58
class CGlowProperty : public 
{ 
public:
	Vector m_fGlowColor; 	// 0x8
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowTypeChanged"
	int32_t m_iGlowType; 	// 0x30
	// MNetworkEnable
	int32_t m_iGlowTeam; 	// 0x34
	// MNetworkEnable
	int32_t m_nGlowRange; 	// 0x38
	// MNetworkEnable
	int32_t m_nGlowRangeMin; 	// 0x3c
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowColorChanged"
	Color m_glowColorOverride; 	// 0x40
	// MNetworkEnable
	bool m_bFlashing; 	// 0x44
	// MNetworkEnable
	float m_flGlowTime; 	// 0x48
	// MNetworkEnable
	float m_flGlowStartTime; 	// 0x4c
	// MNetworkEnable
	bool m_bEligibleForScreenHighlight; 	// 0x50
	bool m_bGlowing; 	// 0x51
};

// Alignment: 0
// Size: 0x8
class C_MultiplayRules : public C_GameRules
{ 
public:
	// no members available
};

// Alignment: 25
// Size: 0x68
struct fogparams_t : public 
{ 
public:
	// MNetworkEnable
	// MNetworkEncoder
	Vector dirPrimary; 	// 0x8
	// MNetworkEnable
	Color colorPrimary; 	// 0x14
	// MNetworkEnable
	Color colorSecondary; 	// 0x18
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorPrimaryLerpTo; 	// 0x1c
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorSecondaryLerpTo; 	// 0x20
	// MNetworkEnable
	float start; 	// 0x24
