#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////////////////////////
// Binary: client.dll
// Classes count: 7671
// Enums count: 61
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

// Alignment: 4
// Size: 0x5
enum class C_BaseCombatCharacter__WaterWakeMode_t : uint32_t
{
	WATER_WAKE_NONE = 0x0,
	WATER_WAKE_IDLE = 0x1,
	WATER_WAKE_WALKING = 0x2,
	WATER_WAKE_RUNNING = 0x3,
	WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Alignment: 4
// Size: 0x5
enum class P2P_Messages : uint32_t
{
	p2p_TextMessage = 0x100,
	p2p_Voice = 0x101,
	p2p_Ping = 0x102,
	p2p_VRAvatarPosition = 0x103,
	p2p_WatchSynchronization = 0x104,
};

// Alignment: 4
// Size: 0x2
enum class ETournamentTemplate : uint32_t
{
	k_ETournamentTemplate_None = 0x0,
	k_ETournamentTemplate_AutomatedWin3 = 0x1,
};

// Alignment: 4
// Size: 0xa
enum class ETournamentGameState : uint32_t
{
	k_ETournamentGameState_Unknown = 0x0,
	k_ETournamentGameState_Canceled = 0x1,
	k_ETournamentGameState_Scheduled = 0x2,
	k_ETournamentGameState_Active = 0x3,
	k_ETournamentGameState_RadVictory = 0x14,
	k_ETournamentGameState_DireVictory = 0x15,
	k_ETournamentGameState_RadVictoryByForfeit = 0x16,
	k_ETournamentGameState_DireVictoryByForfeit = 0x17,
	k_ETournamentGameState_ServerFailure = 0x28,
	k_ETournamentGameState_NotNeeded = 0x29,
};

// Alignment: 4
// Size: 0x15
enum class ETournamentTeamState : uint32_t
{
	k_ETournamentTeamState_Unknown = 0x0,
	k_ETournamentTeamState_Node1 = 0x1,
	k_ETournamentTeamState_NodeMax = 0x400,
	k_ETournamentTeamState_Eliminated = 0x36b3,
	k_ETournamentTeamState_Forfeited = 0x36b4,
	k_ETournamentTeamState_Finished1st = 0x3a99,
	k_ETournamentTeamState_Finished2nd = 0x3a9a,
	k_ETournamentTeamState_Finished3rd = 0x3a9b,
	k_ETournamentTeamState_Finished4th = 0x3a9c,
	k_ETournamentTeamState_Finished5th = 0x3a9d,
	k_ETournamentTeamState_Finished6th = 0x3a9e,
	k_ETournamentTeamState_Finished7th = 0x3a9f,
	k_ETournamentTeamState_Finished8th = 0x3aa0,
	k_ETournamentTeamState_Finished9th = 0x3aa1,
	k_ETournamentTeamState_Finished10th = 0x3aa2,
	k_ETournamentTeamState_Finished11th = 0x3aa3,
	k_ETournamentTeamState_Finished12th = 0x3aa4,
	k_ETournamentTeamState_Finished13th = 0x3aa5,
	k_ETournamentTeamState_Finished14th = 0x3aa6,
	k_ETournamentTeamState_Finished15th = 0x3aa7,
	k_ETournamentTeamState_Finished16th = 0x3aa8,
};

// Alignment: 4
// Size: 0xc
enum class ETournamentState : uint32_t
{
	k_ETournamentState_Unknown = 0x0,
	k_ETournamentState_CanceledByAdmin = 0x1,
	k_ETournamentState_Completed = 0x2,
	k_ETournamentState_Merged = 0x3,
	k_ETournamentState_ServerFailure = 0x4,
	k_ETournamentState_TeamAbandoned = 0x5,
	k_ETournamentState_TeamTimeoutForfeit = 0x6,
	k_ETournamentState_TeamTimeoutRefund = 0x7,
	k_ETournamentState_ServerFailureGrantedVictory = 0x8,
	k_ETournamentState_TeamTimeoutGrantedVictory = 0x9,
	k_ETournamentState_InProgress = 0x64,
	k_ETournamentState_WaitingToMerge = 0x65,
};

// Alignment: 4
// Size: 0xe
enum class ETournamentNodeState : uint32_t
{
	k_ETournamentNodeState_Unknown = 0x0,
	k_ETournamentNodeState_Canceled = 0x1,
	k_ETournamentNodeState_TeamsNotYetAssigned = 0x2,
	k_ETournamentNodeState_InBetweenGames = 0x3,
	k_ETournamentNodeState_GameInProgress = 0x4,
	k_ETournamentNodeState_A_Won = 0x5,
	k_ETournamentNodeState_B_Won = 0x6,
	k_ETournamentNodeState_A_WonByForfeit = 0x7,
	k_ETournamentNodeState_B_WonByForfeit = 0x8,
	k_ETournamentNodeState_A_Bye = 0x9,
	k_ETournamentNodeState_A_Abandoned = 0xa,
	k_ETournamentNodeState_ServerFailure = 0xb,
	k_ETournamentNodeState_A_TimeoutForfeit = 0xc,
	k_ETournamentNodeState_A_TimeoutRefund = 0xd,
};

// Alignment: 4
// Size: 0xa
enum class EDOTAGroupMergeResult : uint32_t
{
	k_EDOTAGroupMergeResult_OK = 0x0,
	k_EDOTAGroupMergeResult_FAILED_GENERIC = 0x1,
	k_EDOTAGroupMergeResult_NOT_LEADER = 0x2,
	k_EDOTAGroupMergeResult_TOO_MANY_PLAYERS = 0x3,
	k_EDOTAGroupMergeResult_TOO_MANY_COACHES = 0x4,
	k_EDOTAGroupMergeResult_ENGINE_MISMATCH = 0x5,
	k_EDOTAGroupMergeResult_NO_SUCH_GROUP = 0x6,
	k_EDOTAGroupMergeResult_OTHER_GROUP_NOT_OPEN = 0x7,
	k_EDOTAGroupMergeResult_ALREADY_INVITED = 0x8,
	k_EDOTAGroupMergeResult_NOT_INVITED = 0x9,
};

// Alignment: 4
// Size: 0x2
enum class EPartyBeaconType : uint32_t
{
	k_EPartyBeaconType_Available = 0x0,
	k_EPartyBeaconType_Joinable = 0x1,
};

// Alignment: 4
// Size: 0x4
enum class CMsgDOTARequestMatches_SkillLevel : uint32_t
{
	CMsgDOTARequestMatches_SkillLevel_Any = 0x0,
	CMsgDOTARequestMatches_SkillLevel_Normal = 0x1,
	CMsgDOTARequestMatches_SkillLevel_High = 0x2,
	CMsgDOTARequestMatches_SkillLevel_VeryHigh = 0x3,
};

// Alignment: 4
// Size: 0x2
enum class DOTA_WatchReplayType : uint32_t
{
	DOTA_WATCH_REPLAY_NORMAL = 0x0,
	DOTA_WATCH_REPLAY_HIGHLIGHTS = 0x1,
};

// Alignment: 4
// Size: 0x4
enum class EItemEditorReservationResult : uint32_t
{
	k_EItemEditorReservationResult_OK = 0x1,
	k_EItemEditorReservationResult_AlreadyExists = 0x2,
	k_EItemEditorReservationResult_Reserved = 0x3,
	k_EItemEditorReservationResult_TimedOut = 0x4,
};

// Alignment: 4
// Size: 0x4
enum class EWeekendTourneyRichPresenceEvent : uint32_t
{
	k_EWeekendTourneyRichPresenceEvent_None = 0x0,
	k_EWeekendTourneyRichPresenceEvent_StartedMatch = 0x1,
	k_EWeekendTourneyRichPresenceEvent_WonMatch = 0x2,
	k_EWeekendTourneyRichPresenceEvent_Eliminated = 0x3,
};

// Alignment: 4
// Size: 0x6
enum class EDOTATriviaAnswerResult : uint32_t
{
	k_EDOTATriviaAnswerResult_Success = 0x0,
	k_EDOTATriviaAnswerResult_InvalidQuestion = 0x1,
	k_EDOTATriviaAnswerResult_InvalidAnswer = 0x2,
	k_EDOTATriviaAnswerResult_QuestionLocked = 0x3,
	k_EDOTATriviaAnswerResult_AlreadyAnswered = 0x4,
	k_EDOTATriviaAnswerResult_TriviaDisabled = 0x5,
};

// Alignment: 4
// Size: 0x8
enum class EPurchaseHeroRelicResult : uint32_t
{
	k_EPurchaseHeroRelicResult_Success = 0x0,
	k_EPurchaseHeroRelicResult_FailedToSend = 0x1,
	k_EPurchaseHeroRelicResult_NotEnoughPoints = 0x2,
	k_EPurchaseHeroRelicResult_InternalServerError = 0x3,
	k_EPurchaseHeroRelicResult_PurchaseNotAllowed = 0x4,
	k_EPurchaseHeroRelicResult_InvalidRelic = 0x5,
	k_EPurchaseHeroRelicResult_AlreadyOwned = 0x6,
	k_EPurchaseHeroRelicResult_InvalidRarity = 0x7,
};

// Alignment: 4
// Size: 0x7
enum class EDevEventRequestResult : uint32_t
{
	k_EDevEventRequestResult_Success = 0x0,
	k_EDevEventRequestResult_NotAllowed = 0x1,
	k_EDevEventRequestResult_InvalidEvent = 0x2,
	k_EDevEventRequestResult_SqlFailure = 0x3,
	k_EDevEventRequestResult_Timeout = 0x4,
	k_EDevEventRequestResult_LockFailure = 0x5,
	k_EDevEventRequestResult_SDOLoadFailure = 0x6,
};

// Alignment: 4
// Size: 0xe
enum class ESupportEventRequestResult : uint32_t
{
	k_ESupportEventRequestResult_Success = 0x0,
	k_ESupportEventRequestResult_Timeout = 0x1,
	k_ESupportEventRequestResult_CantLockSOCache = 0x2,
	k_ESupportEventRequestResult_ItemNotInInventory = 0x3,
	k_ESupportEventRequestResult_InvalidItemDef = 0x4,
	k_ESupportEventRequestResult_InvalidEvent = 0x5,
	k_ESupportEventRequestResult_EventExpired = 0x6,
	k_ESupportEventRequestResult_InvalidSupportAccount = 0x7,
	k_ESupportEventRequestResult_InvalidSupportMessage = 0x8,
	k_ESupportEventRequestResult_InvalidEventPoints = 0x9,
	k_ESupportEventRequestResult_InvalidPremiumPoints = 0xa,
	k_ESupportEventRequestResult_InvalidActionID = 0xb,
	k_ESupportEventRequestResult_InvalidActionScore = 0xc,
	k_ESupportEventRequestResult_TransactionFailed = 0xd,
};

// Alignment: 4
// Size: 0xc
enum class EUnderDraftResponse : uint32_t
{
	k_eInternalError = 0x0,
	k_eSuccess = 0x1,
	k_eNoGold = 0x2,
	k_eInvalidSlot = 0x3,
	k_eNoBenchSpace = 0x4,
	k_eNoTickets = 0x5,
	k_eEventNotOwned = 0x6,
	k_eInvalidReward = 0x7,
	k_eHasBigReward = 0x8,
	k_eNoGCConnection = 0x9,
	k_eTooBusy = 0xa,
	k_eCantRollBack = 0xb,
};

// Alignment: 4
// Size: 0x6
enum class EDOTADraftTriviaAnswerResult : uint32_t
{
	k_EDOTADraftTriviaAnswerResult_Success = 0x0,
	k_EDOTADraftTriviaAnswerResult_InvalidMatchID = 0x1,
	k_EDOTADraftTriviaAnswerResult_AlreadyAnswered = 0x2,
	k_EDOTADraftTriviaAnswerResult_InternalError = 0x3,
	k_EDOTADraftTriviaAnswerResult_TriviaDisabled = 0x4,
	k_EDOTADraftTriviaAnswerResult_GCDown = 0x5,
};

// Alignment: 4
// Size: 0x43
enum class CMsgBattleReport_HighlightType : uint32_t
{
	k_eHighlightTypeInvalid = 0xffffffffffffffff,
	k_eGameWinrate = 0x0,
	k_eLaneWinrate = 0x1,
	k_eMMRDelta = 0x2,
	k_eNumHeroesPlayed = 0x3,
	k_eNumGamesPlayed = 0x4,
	k_eAveragePowerRunesTaken = 0x5,
	k_eAverageBountyRunesTaken = 0x6,
	k_eTotalKillEnemyT1First = 0x7,
	k_eTotalRoshanKills = 0x8,
	k_eTotalDewards = 0x9,
	k_eTotalCampsStacked = 0xa,
	k_eMaxWinstreak = 0xb,
	k_eAverageDewards = 0xc,
	k_eAverageKills = 0xd,
	k_eMaxKills = 0xe,
	k_eAverageAssists = 0xf,
	k_eMaxAssists = 0x10,
	k_eAverageDeaths = 0x11,
	k_eMinDeaths = 0x12,
	k_eAverageCampsStacked = 0x13,
	k_eTotalLastHits = 0x14,
	k_eAverageLastHits = 0x15,
	k_eTotalDenies = 0x16,
	k_eAverageDenies = 0x17,
	k_eTotalGamesWithRoshanAdvantage = 0x18,
	k_ePercentGamesWithRoshanAdvantage = 0x19,
	k_eAverageStunDuration = 0x1a,
	k_eTotalStunDuration = 0x1b,
	k_eAverageTeleportsUsed = 0x1c,
	k_eTotalTeleportsUsed = 0x1d,
	k_eAverageHeroDamage = 0x1e,
	k_eTotalHeroDamage = 0x1f,
	k_eAverageHeroHealing = 0x20,
	k_eTotalHeroHealing = 0x21,
	k_eAverageTowerDamage = 0x22,
	k_eTotalTowerDamage = 0x23,
	k_eMaxLossStreak = 0x24,
	k_eAverageGameDuration = 0x25,
	k_eMaxGameDuration = 0x26,
	k_eMinGameDuration = 0x27,
	k_eAverageWinDuration = 0x28,
	k_eMaxWinDuration = 0x29,
	k_eMinWinDuration = 0x2a,
	k_eAverageLossDuration = 0x2b,
	k_eMaxLossDuration = 0x2c,
	k_eMinLossDuration = 0x2d,
	k_ePctGamesEnemyT1TakenFirst = 0x2e,
	k_eMaxCampsStacked = 0x2f,
	k_eMaxDewards = 0x30,
	k_eMaxRoshanKills = 0x31,
	k_eMaxBountyRunesTaken = 0x32,
	k_eMaxPowerRunesTaken = 0x33,
	k_eMaxDeaths = 0x34,
	k_eMaxLastHits = 0x35,
	k_eMaxDenies = 0x36,
	k_eRadiantWinRate = 0x37,
	k_eDireWinRate = 0x38,
	k_eRadiantGameCount = 0x39,
	k_eDireGameCount = 0x3a,
	k_eMaxDamage = 0x3b,
	k_eMaxHealing = 0x3c,
	k_eMaxTowerDamage = 0x3d,
	k_eAverageGPM = 0x3e,
	k_eMaxGPM = 0x3f,
	k_eAverageXPM = 0x40,
	k_eMaxXPM = 0x41,
};

// Alignment: 4
// Size: 0x3
enum class CMsgBattleReport_HighlightCategory : uint32_t
{
	k_eHighlightGeneral = 0x0,
	k_eHighlightHero = 0x1,
	k_eHighlightRole = 0x2,
};

// Alignment: 4
// Size: 0x6
enum class CMsgBattleReport_Role : uint32_t
{
	k_eUnknownRole = 0xffffffffffffffff,
	k_eSafelane = 0x0,
	k_eMidlane = 0x1,
	k_eOfflane = 0x2,
	k_eSoftSupport = 0x3,
	k_eHardSupport = 0x4,
};

// Alignment: 4
// Size: 0x5
enum class CMsgBattleReport_CompareContext : uint32_t
{
	k_eCompareContextInvalid = 0xffffffffffffffff,
	k_eAbsoluteValue = 0x0,
	k_ePlayersOfSimilarRank = 0x1,
	k_eAllPlayers = 0x2,
	k_ePlayersPersonalHistory = 0x3,
};

// Alignment: 4
// Size: 0x6
enum class CMsgBattleReport_HighlightTier : uint32_t
{
	k_eHighlightTierLow = 0xffffffffffffffff,
	k_eHighlightTierNone = 0x0,
	k_eHighlightTier1 = 0x1,
	k_eHighlightTier2 = 0x2,
	k_eHighlightTier3 = 0x3,
	k_eHighlightTierCustom = 0x4,
};

// Alignment: 4
// Size: 0x3
enum class CMsgBattleReport_HighlightRarity : uint32_t
{
	k_eHighlightCommon = 0x0,
	k_eHighlightUncommon = 0x1,
	k_eHighlightRare = 0x2,
};

// Alignment: 4
// Size: 0x2
enum class CMsgBattleReport_EOutcome : uint32_t
{
	k_eWin = 0x0,
	k_eLoss = 0x1,
};

// Alignment: 4
// Size: 0x4
enum class CMsgBattleReport_ELaneOutcome : uint32_t
{
	k_eUnknownLaneOutcome = 0xffffffffffffffff,
	k_eWonLane = 0x0,
	k_eLostLane = 0x1,
	k_eEvenLane = 0x2,
};

// Alignment: 4
// Size: 0x9
enum class ECandyShopAuditAction : uint32_t
{
	k_ECandyShopAuditAction_Invalid = 0x0,
	k_ECandyShopAuditAction_SupportModify = 0x1,
	k_ECandyShopAuditAction_PurchaseReward = 0x2,
	k_ECandyShopAuditAction_OpenBags = 0x3,
	k_ECandyShopAuditAction_RerollRewards = 0x4,
	k_ECandyShopAuditAction_DoVariableExchange = 0x5,
	k_ECandyShopAuditAction_DoExchange = 0x6,
	k_ECandyShopAuditAction_EventActionGrantInventorySizeIncrease = 0x7,
	k_ECandyShopAuditAction_EventActionGrantRerollChargesIncrease = 0x8,
};

// Alignment: 4
// Size: 0x4
enum class ECandyShopRewardType : uint32_t
{
	k_eCandyShopRewardType_None = 0x0,
	k_eCandyShopRewardType_Item = 0x1,
	k_eCandyShopRewardType_EventAction = 0x2,
	k_eCandyShopRewardType_EventPoints = 0x3,
};

// Alignment: 4
// Size: 0x4
enum class ECoachTeammateRating : uint32_t
{
	k_ECoachTeammateRating_None = 0x0,
	k_ECoachTeammateRating_Positive = 0x1,
	k_ECoachTeammateRating_Negative = 0x2,
	k_ECoachTeammateRating_Abusive = 0x3,
};

// Alignment: 4
// Size: 0x6
enum class EPrivateCoachingSessionState : uint32_t
{
	k_ePrivateCoachingSessionState_Invalid = 0x0,
	k_ePrivateCoachingSessionState_SearchingForCoach = 0x1,
	k_ePrivateCoachingSessionState_CoachAssigned = 0x2,
	k_ePrivateCoachingSessionState_Finished = 0x3,
	k_ePrivateCoachingSessionState_Expired = 0x4,
	k_ePrivateCoachingSessionState_Abandoned = 0x5,
};

// Alignment: 4
// Size: 0x3
enum class EPrivateCoachingSessionMemberFlag : uint32_t
{
	k_EPrivateCoachingSessionMemberFlag_Requester = 0x1,
	k_EPrivateCoachingSessionMemberFlag_Coach = 0x2,
	k_EPrivateCoachingSessionMemberFlag_LeftSession = 0x4,
};

// Alignment: 4
// Size: 0x2
enum class EPlayerCoachMatchFlag : uint32_t
{
	k_EPlayerCoachMatchFlag_EligibleForRewards = 0x1,
	k_EPlayerCoachMatchFlag_PrivateCoach = 0x2,
};

// Alignment: 4
// Size: 0x60
enum class DOTA_2013PassportSelectionIndices : uint32_t
{
	PP13_SEL_ALLSTAR_PLAYER_0 = 0x0,
	PP13_SEL_ALLSTAR_PLAYER_1 = 0x1,
	PP13_SEL_ALLSTAR_PLAYER_2 = 0x2,
	PP13_SEL_ALLSTAR_PLAYER_3 = 0x3,
	PP13_SEL_ALLSTAR_PLAYER_4 = 0x4,
	PP13_SEL_ALLSTAR_PLAYER_5 = 0x5,
	PP13_SEL_ALLSTAR_PLAYER_6 = 0x6,
	PP13_SEL_ALLSTAR_PLAYER_7 = 0x7,
	PP13_SEL_ALLSTAR_PLAYER_8 = 0x8,
	PP13_SEL_ALLSTAR_PLAYER_9 = 0x9,
	PP13_SEL_QUALPRED_WEST_0 = 0xa,
	PP13_SEL_QUALPRED_WEST_1 = 0xb,
	PP13_SEL_QUALPRED_WEST_2 = 0xc,
	PP13_SEL_QUALPRED_WEST_3 = 0xd,
	PP13_SEL_QUALPRED_WEST_4 = 0xe,
	PP13_SEL_QUALPRED_WEST_5 = 0xf,
	PP13_SEL_QUALPRED_WEST_6 = 0x10,
	PP13_SEL_QUALPRED_WEST_7 = 0x11,
	PP13_SEL_QUALPRED_WEST_8 = 0x12,
	PP13_SEL_QUALPRED_WEST_9 = 0x13,
	PP13_SEL_QUALPRED_WEST_10 = 0x14,
	PP13_SEL_QUALPRED_WEST_11 = 0x15,
	PP13_SEL_QUALPRED_WEST_12 = 0x16,
	PP13_SEL_QUALPRED_WEST_13 = 0x17,
	PP13_SEL_QUALPRED_WEST_14 = 0x18,
	PP13_SEL_QUALPRED_EAST_0 = 0x19,
	PP13_SEL_QUALPRED_EAST_1 = 0x1a,
	PP13_SEL_QUALPRED_EAST_2 = 0x1b,
	PP13_SEL_QUALPRED_EAST_3 = 0x1c,
	PP13_SEL_QUALPRED_EAST_4 = 0x1d,
	PP13_SEL_QUALPRED_EAST_5 = 0x1e,
	PP13_SEL_QUALPRED_EAST_6 = 0x1f,
	PP13_SEL_QUALPRED_EAST_7 = 0x20,
	PP13_SEL_QUALPRED_EAST_8 = 0x21,
	PP13_SEL_QUALPRED_EAST_9 = 0x22,
	PP13_SEL_QUALPRED_EAST_10 = 0x23,
	PP13_SEL_QUALPRED_EAST_11 = 0x24,
	PP13_SEL_QUALPRED_EAST_12 = 0x25,
	PP13_SEL_QUALPRED_EAST_13 = 0x26,
	PP13_SEL_QUALPRED_EAST_14 = 0x27,
	PP13_SEL_TEAMCUP_TEAM = 0x28,
	PP13_SEL_TEAMCUP_PLAYER = 0x29,
	PP13_SEL_TEAMCUP_TEAM_LOCK = 0x2a,
	PP13_SEL_TEAMCUP_PLAYER_LOCK = 0x2b,
	PP13_SEL_EVENTPRED_0 = 0x2c,
	PP13_SEL_EVENTPRED_1 = 0x2d,
	PP13_SEL_EVENTPRED_2 = 0x2e,
	PP13_SEL_EVENTPRED_3 = 0x2f,
	PP13_SEL_EVENTPRED_4 = 0x30,
	PP13_SEL_EVENTPRED_5 = 0x31,
	PP13_SEL_EVENTPRED_6 = 0x32,
	PP13_SEL_EVENTPRED_7 = 0x33,
	PP13_SEL_EVENTPRED_8 = 0x34,
	PP13_SEL_EVENTPRED_9 = 0x35,
	PP13_SEL_EVENTPRED_10 = 0x36,
	PP13_SEL_EVENTPRED_11 = 0x37,
	PP13_SEL_EVENTPRED_12 = 0x38,
	PP13_SEL_EVENTPRED_13 = 0x39,
	PP13_SEL_EVENTPRED_14 = 0x3a,
	PP13_SEL_EVENTPRED_15 = 0x3b,
	PP13_SEL_EVENTPRED_16 = 0x3c,
	PP13_SEL_EVENTPRED_17 = 0x3d,
	PP13_SEL_EVENTPRED_18 = 0x3e,
	PP13_SEL_EVENTPRED_19 = 0x3f,
	PP13_SEL_EVENTPRED_20 = 0x40,
	PP13_SEL_EVENTPRED_21 = 0x41,
	PP13_SEL_EVENTPRED_22 = 0x42,
	PP13_SEL_EVENTPRED_23 = 0x43,
	PP13_SEL_EVENTPRED_24 = 0x44,
	PP13_SEL_EVENTPRED_25 = 0x45,
	PP13_SEL_EVENTPRED_26 = 0x46,
	PP13_SEL_EVENTPRED_27 = 0x47,
	PP13_SEL_EVENTPRED_28 = 0x48,
	PP13_SEL_EVENTPRED_29 = 0x49,
	PP13_SEL_EVENTPRED_30 = 0x4a,
	PP13_SEL_EVENTPRED_31 = 0x4b,
	PP13_SEL_EVENTPRED_32 = 0x4c,
	PP13_SEL_EVENTPRED_33 = 0x4d,
	PP13_SEL_EVENTPRED_34 = 0x4e,
	PP13_SEL_EVENTPRED_35 = 0x4f,
	PP13_SEL_EVENTPRED_36 = 0x50,
	PP13_SEL_EVENTPRED_37 = 0x51,
	PP13_SEL_EVENTPRED_38 = 0x52,
	PP13_SEL_EVENTPRED_39 = 0x53,
	PP13_SEL_EVENTPRED_40 = 0x54,
	PP13_SEL_EVENTPRED_41 = 0x55,
	PP13_SEL_EVENTPRED_42 = 0x56,
	PP13_SEL_EVENTPRED_43 = 0x57,
	PP13_SEL_SOLO_0 = 0x58,
	PP13_SEL_SOLO_1 = 0x59,
	PP13_SEL_SOLO_2 = 0x5a,
	PP13_SEL_SOLO_3 = 0x5b,
	PP13_SEL_SOLO_4 = 0x5c,
	PP13_SEL_SOLO_5 = 0x5d,
	PP13_SEL_SOLO_6 = 0x5e,
	PP13_SEL_SOLO_7 = 0x5f,
};

// Alignment: 4
// Size: 0x1a
enum class EGuildAuditAction : uint32_t
{
	k_EGuildAuditAction_Invalid = 0x0,
	k_EGuildAuditAction_GuildCreated = 0x1,
	k_EGuildAuditAction_GuildLanguageChanged = 0x2,
	k_EGuildAuditAction_GuildFlagsChanged = 0x3,
	k_EGuildAuditAction_GuildMemberJoined = 0x5,
	k_EGuildAuditAction_GuildMemberLeft = 0x6,
	k_EGuildAuditAction_GuildMemberKicked = 0x7,
	k_EGuildAuditAction_GuildMemberRoleChanged = 0x8,
	k_EGuildAuditAction_GuildLogoChanged = 0x9,
	k_EGuildAuditAction_GuildRegionChanged = 0xa,
	k_EGuildAuditAction_GuildDescriptionChanged = 0xb,
	k_EGuildAuditAction_GuildPrimaryColorChanged = 0xc,
	k_EGuildAuditAction_GuildSecondaryColorChanged = 0xd,
	k_EGuildAuditAction_GuildPatternChanged = 0xe,
	k_EGuildAuditAction_AdminClearedLogo = 0xf,
	k_EGuildAuditAction_GuildRequiredRankChanged = 0x10,
	k_EGuildAuditAction_GuildMotDChanged = 0x12,
	k_EGuildAuditAction_AdminResetName = 0x13,
	k_EGuildAuditAction_AdminResetTag = 0x14,
	k_EGuildAuditAction_AdminLock = 0x15,
	k_EGuildAuditAction_GuildNameChanged = 0x16,
	k_EGuildAuditAction_GuildTagChanged = 0x17,
	k_EGuildAuditAction_AdminPermitted = 0x18,
	k_EGuildAuditAction_AdminBlocked = 0x19,
	k_EGuildAuditAction_AdminBannedUser = 0x1a,
	k_EGuildAuditAction_AdminExonerated = 0x1b,
};

// Alignment: 4
// Size: 0x3
enum class EGuildChatType : uint32_t
{
	k_EGuildChatType_Unspecified = 0x0,
	k_EGuildChatType_SteamChatGroup = 0x1,
	k_EGuildChatType_GC = 0x2,
};

// Alignment: 4
// Size: 0x9
enum class EGuildEventAuditAction : uint32_t
{
	k_EGuildEventAuditAction_Invalid = 0x0,
	k_EGuildEventAuditAction_DevGrant = 0x1,
	k_EGuildEventAuditAction_CompleteContract = 0x2,
	k_EGuildEventAuditAction_CompleteChallenge = 0x3,
	k_EGuildEventAuditAction_CompleteMatch_Winner = 0x4,
	k_EGuildEventAuditAction_ChallengeProgress = 0x5,
	k_EGuildEventAuditAction_CompleteMatch_Loser = 0x6,
	k_EGuildEventAuditAction_WeeklyLeaderboard = 0x7,
	k_EGuildEventAuditAction_ManualGrant = 0x8,
};

// Alignment: 4
// Size: 0x26
enum class EStartFindingMatchResult : uint32_t
{
	k_EStartFindingMatchResult_Invalid = 0x0,
	k_EStartFindingMatchResult_OK = 0x1,
	k_EStartFindingMatchResult_AlreadySearching = 0x2,
	k_EStartFindingMatchResult_FailGeneric = 0x64,
	k_EStartFindingMatchResult_FailedIgnore = 0x65,
	k_EStartFindingMatchResult_MatchmakingDisabled = 0x66,
	k_EStartFindingMatchResult_RegionOffline = 0x67,
	k_EStartFindingMatchResult_MatchmakingCooldown = 0x68,
	k_EStartFindingMatchResult_ClientOutOfDate = 0x69,
	k_EStartFindingMatchResult_CompetitiveNoLowPriority = 0x6a,
	k_EStartFindingMatchResult_CompetitiveNotUnlocked = 0x6b,
	k_EStartFindingMatchResult_GameModeNotUnlocked = 0x6c,
	k_EStartFindingMatchResult_CompetitiveNotEnoughPlayTime = 0x6d,
	k_EStartFindingMatchResult_MissingInitialSkill = 0x6e,
	k_EStartFindingMatchResult_CompetitiveRankSpreadTooLarge = 0x6f,
	k_EStartFindingMatchResult_MemberAlreadyInLobby = 0x70,
	k_EStartFindingMatchResult_MemberNotVACVerified = 0x71,
	k_EStartFindingMatchResult_WeekendTourneyBadPartySize = 0x72,
	k_EStartFindingMatchResult_WeekendTourneyTeamBuyInTooSmall = 0x73,
	k_EStartFindingMatchResult_WeekendTourneyIndividualBuyInTooLarge = 0x74,
	k_EStartFindingMatchResult_WeekendTourneyTeamBuyInTooLarge = 0x75,
	k_EStartFindingMatchResult_MemberMissingEventOwnership = 0x76,
	k_EStartFindingMatchResult_WeekendTourneyNotUnlocked = 0x77,
	k_EStartFindingMatchResult_WeekendTourneyRecentParticipation = 0x78,
	k_EStartFindingMatchResult_MemberMissingAnchoredPhoneNumber = 0x79,
	k_EStartFindingMatchResult_NotMemberOfClan = 0x7a,
	k_EStartFindingMatchResult_CoachesChallengeBadPartySize = 0x7b,
	k_EStartFindingMatchResult_CoachesChallengeRequirementsNotMet = 0x7c,
	k_EStartFindingMatchResult_InvalidRoleSelections = 0x7d,
	k_EStartFindingMatchResult_PhoneNumberDiscrepancy = 0x7e,
	k_EStartFindingMatchResult_NoQueuePoints = 0x7f,
	k_EStartFindingMatchResult_MemberMissingGauntletFlag = 0x80,
	k_EStartFindingMatchResult_MemberGauntletTooRecent = 0x81,
	k_EStartFindingMatchResult_DifficultyNotUnlocked = 0x82,
	k_EStartFindingMatchResult_CoachesNotAllowedInParty = 0x83,
	k_EStartFindingMatchResult_MatchmakingBusy = 0x84,
	k_EStartFindingMatchResult_SteamChinaBanned = 0x85,
	k_EStartFindingMatchResult_SteamChinaInvalidMixedParty = 0x86,
};

// Alignment: 4
// Size: 0xe
enum class ETeamInviteResult : uint32_t
{
	TEAM_INVITE_SUCCESS = 0x0,
	TEAM_INVITE_FAILURE_INVITE_REJECTED = 0x1,
	TEAM_INVITE_FAILURE_INVITE_TIMEOUT = 0x2,
	TEAM_INVITE_ERROR_TEAM_AT_MEMBER_LIMIT = 0x3,
	TEAM_INVITE_ERROR_TEAM_LOCKED = 0x4,
	TEAM_INVITE_ERROR_INVITEE_NOT_AVAILABLE = 0x5,
	TEAM_INVITE_ERROR_INVITEE_BUSY = 0x6,
	TEAM_INVITE_ERROR_INVITEE_ALREADY_MEMBER = 0x7,
	TEAM_INVITE_ERROR_INVITEE_AT_TEAM_LIMIT = 0x8,
	TEAM_INVITE_ERROR_INVITEE_INSUFFICIENT_PLAY_TIME = 0x9,
	TEAM_INVITE_ERROR_INVITER_INVALID_ACCOUNT_TYPE = 0xa,
	TEAM_INVITE_ERROR_INVITER_NOT_ADMIN = 0xb,
	TEAM_INVITE_ERROR_INCORRECT_USER_RESPONDED = 0xc,
	TEAM_INVITE_ERROR_UNSPECIFIED = 0xd,
};

// Alignment: 4
// Size: 0xc
enum class ETournamentEvent : uint32_t
{
	k_ETournamentEvent_None = 0x0,
	k_ETournamentEvent_TournamentCreated = 0x1,
	k_ETournamentEvent_TournamentsMerged = 0x2,
	k_ETournamentEvent_GameOutcome = 0x3,
	k_ETournamentEvent_TeamGivenBye = 0x4,
	k_ETournamentEvent_TournamentCanceledByAdmin = 0x5,
	k_ETournamentEvent_TeamAbandoned = 0x6,
	k_ETournamentEvent_ScheduledGameStarted = 0x7,
	k_ETournamentEvent_Canceled = 0x8,
	k_ETournamentEvent_TeamParticipationTimedOut_EntryFeeRefund = 0x9,
	k_ETournamentEvent_TeamParticipationTimedOut_EntryFeeForfeit = 0xa,
	k_ETournamentEvent_TeamParticipationTimedOut_GrantedVictory = 0xb,
};

// Alignment: 4
// Size: 0x3
enum class ETeamFanContentStatus : uint32_t
{
	TEAM_FAN_CONTENT_STATUS_INVALID = 0x0,
	TEAM_FAN_CONTENT_STATUS_PENDING = 0x1,
	TEAM_FAN_CONTENT_STATUS_EVALUATED = 0x2,
};

// Alignment: 4
// Size: 0x9
enum class ETeamFanContentAssetType : uint32_t
{
	k_eFanContentAssetType_LogoPNG = 0x1,
	k_eFanContentAssetType_LogoSVG = 0x2,
	k_eFanContentAssetType_Logo3D = 0x3,
	k_eFanContentAssetType_Players = 0x4,
	k_eFanContentAssetType_Sprays = 0x5,
	k_eFanContentAssetType_Wallpapers = 0x6,
	k_eFanContentAssetType_Emoticons = 0x7,
	k_eFanContentAssetType_VoiceLines = 0x8,
	k_eFanContentAssetType_Localization = 0x9,
};

// Alignment: 4
// Size: 0x3
enum class ETeamFanContentAssetStatus : uint32_t
{
	k_eFanContentAssetStatus_None = 0x0,
	k_eFanContentAssetStatus_Approved = 0x1,
	k_eFanContentAssetStatus_Rejected = 0x2,
};

// Alignment: 4
// Size: 0x4
enum class PlayerOrderIssuer_t : uint32_t
{
	DOTA_ORDER_ISSUER_SELECTED_UNITS = 0x0,
	DOTA_ORDER_ISSUER_CURRENT_UNIT_ONLY = 0x1,
	DOTA_ORDER_ISSUER_HERO_ONLY = 0x2,
	DOTA_ORDER_ISSUER_PASSED_UNIT_ONLY = 0x3,
};

// Alignment: 4
// Size: 0x3
enum class OrderQueueBehavior_t : uint32_t
{
	DOTA_ORDER_QUEUE_DEFAULT = 0x0,
	DOTA_ORDER_QUEUE_NEVER = 0x1,
	DOTA_ORDER_QUEUE_ALWAYS = 0x2,
};

// Alignment: 4
// Size: 0x2
enum class NeutralCampStackPullAlarmType_t : uint32_t
{
	DOTA_NEUTRAL_CAMP_STACK_PULL_ALARM_TYPE_STACK = 0x1,
	DOTA_NEUTRAL_CAMP_STACK_PULL_ALARM_TYPE_PULL = 0x2,
};

// Alignment: 4
// Size: 0x8
enum class DOTAKeybindTemplate_t : uint32_t
{
	DOTA_KEYBIND_TEMPLATE_ARROW = 0x0,
	DOTA_KEYBIND_TEMPLATE_WASD = 0x1,
	DOTA_KEYBIND_TEMPLATE_LEGACY = 0x2,
	DOTA_KEYBIND_TEMPLATE_MMO = 0x3,
	DOTA_KEYBIND_TEMPLATE_LOL = 0x4,
	DOTA_KEYBIND_TEMPLATE_HON = 0x5,
	DOTA_KEYBIND_TEMPLATE_SMITE = 0x6,
	DOTA_KEYBIND_TEMPLATE_COUNT = 0x7,
};

// Alignment: 4
// Size: 0xf0
enum class DOTAKeybindCommand_t : uint32_t
{
	DOTA_KEYBIND_NONE = 0x0,
	DOTA_KEYBIND_FIRST = 0x1,
	DOTA_KEYBIND_CAMERA_UP = 0x1,
	DOTA_KEYBIND_CAMERA_DOWN = 0x2,
	DOTA_KEYBIND_CAMERA_LEFT = 0x3,
	DOTA_KEYBIND_CAMERA_RIGHT = 0x4,
	DOTA_KEYBIND_CAMERA_GRIP = 0x5,
	DOTA_KEYBIND_CAMERA_YAW_GRIP = 0x6,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_1 = 0x7,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_2 = 0x8,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_3 = 0x9,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_4 = 0xa,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_5 = 0xb,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_6 = 0xc,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_7 = 0xd,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_8 = 0xe,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_9 = 0xf,
	DOTA_KEYBIND_CAMERA_SAVED_POSITION_10 = 0x10,
	DOTA_KEYBIND_HERO_ATTACK = 0x11,
	DOTA_KEYBIND_HERO_MOVE = 0x12,
	DOTA_KEYBIND_HERO_MOVE_DIRECTION = 0x13,
	DOTA_KEYBIND_PATROL = 0x14,
	DOTA_KEYBIND_HERO_STOP = 0x15,
	DOTA_KEYBIND_HERO_HOLD = 0x16,
	DOTA_KEYBIND_HERO_SELECT = 0x17,
	DOTA_KEYBIND_COURIER_SELECT = 0x18,
	DOTA_KEYBIND_COURIER_DELIVER = 0x19,
	DOTA_KEYBIND_COURIER_BURST = 0x1a,
	DOTA_KEYBIND_COURIER_SHIELD = 0x1b,
	DOTA_KEYBIND_PAUSE = 0x1c,
	DOTA_SELECT_ALL = 0x1d,
	DOTA_SELECT_ALL_OTHERS = 0x1e,
	DOTA_RECENT_EVENT = 0x1f,
	DOTA_KEYBIND_CHAT_TEAM = 0x20,
	DOTA_KEYBIND_CHAT_GLOBAL = 0x21,
	DOTA_KEYBIND_CHAT_TEAM2 = 0x22,
	DOTA_KEYBIND_CHAT_GLOBAL2 = 0x23,
	DOTA_KEYBIND_CHAT_VOICE_PARTY = 0x24,
	DOTA_KEYBIND_CHAT_VOICE_TEAM = 0x25,
	DOTA_KEYBIND_CHAT_WHEEL = 0x26,
	DOTA_KEYBIND_CHAT_WHEEL2 = 0x27,
	DOTA_KEYBIND_CHAT_WHEEL_CARE = 0x28,
	DOTA_KEYBIND_CHAT_WHEEL_BACK = 0x29,
	DOTA_KEYBIND_CHAT_WHEEL_NEED_WARDS = 0x2a,
	DOTA_KEYBIND_CHAT_WHEEL_STUN = 0x2b,
	DOTA_KEYBIND_CHAT_WHEEL_HELP = 0x2c,
	DOTA_KEYBIND_CHAT_WHEEL_GET_PUSH = 0x2d,
	DOTA_KEYBIND_CHAT_WHEEL_GOOD_JOB = 0x2e,
	DOTA_KEYBIND_CHAT_WHEEL_MISSING = 0x2f,
	DOTA_KEYBIND_CHAT_WHEEL_MISSING_TOP = 0x30,
	DOTA_KEYBIND_CHAT_WHEEL_MISSING_MIDDLE = 0x31,
	DOTA_KEYBIND_CHAT_WHEEL_MISSING_BOTTOM = 0x32,
	DOTA_KEYBIND_HERO_CHAT_WHEEL = 0x33,
	DOTA_KEYBIND_SPRAY_WHEEL = 0x34,
	DOTA_KEYBIND_ABILITY_PRIMARY1 = 0x35,
	DOTA_KEYBIND_ABILITY_PRIMARY2 = 0x36,
	DOTA_KEYBIND_ABILITY_PRIMARY3 = 0x37,
	DOTA_KEYBIND_ABILITY_SECONDARY1 = 0x38,
	DOTA_KEYBIND_ABILITY_SECONDARY2 = 0x39,
	DOTA_KEYBIND_ABILITY_ULTIMATE = 0x3a,
	DOTA_KEYBIND_TALENT_UPGRADE_LEFT = 0x3b,
	DOTA_KEYBIND_TALENT_UPGRADE_RIGHT = 0x3c,
	DOTA_KEYBIND_TALENT_UPGRADE_ATTRIBUTE = 0x3d,
	DOTA_KEYBIND_ABILITY_PRIMARY1_QUICKCAST = 0x3e,
	DOTA_KEYBIND_ABILITY_PRIMARY2_QUICKCAST = 0x3f,
	DOTA_KEYBIND_ABILITY_PRIMARY3_QUICKCAST = 0x40,
	DOTA_KEYBIND_ABILITY_SECONDARY1_QUICKCAST = 0x41,
	DOTA_KEYBIND_ABILITY_SECONDARY2_QUICKCAST = 0x42,
	DOTA_KEYBIND_ABILITY_ULTIMATE_QUICKCAST = 0x43,
	DOTA_KEYBIND_ABILITY_PRIMARY1_EXPLICIT_AUTOCAST = 0x44,
	DOTA_KEYBIND_ABILITY_PRIMARY2_EXPLICIT_AUTOCAST = 0x45,
	DOTA_KEYBIND_ABILITY_PRIMARY3_EXPLICIT_AUTOCAST = 0x46,
	DOTA_KEYBIND_ABILITY_SECONDARY1_EXPLICIT_AUTOCAST = 0x47,
	DOTA_KEYBIND_ABILITY_SECONDARY2_EXPLICIT_AUTOCAST = 0x48,
	DOTA_KEYBIND_ABILITY_ULTIMATE_EXPLICIT_AUTOCAST = 0x49,
	DOTA_KEYBIND_ABILITY_PRIMARY1_QUICKCAST_AUTOCAST = 0x4a,
	DOTA_KEYBIND_ABILITY_PRIMARY2_QUICKCAST_AUTOCAST = 0x4b,
	DOTA_KEYBIND_ABILITY_PRIMARY3_QUICKCAST_AUTOCAST = 0x4c,
	DOTA_KEYBIND_ABILITY_SECONDARY1_QUICKCAST_AUTOCAST = 0x4d,
	DOTA_KEYBIND_ABILITY_SECONDARY2_QUICKCAST_AUTOCAST = 0x4e,
	DOTA_KEYBIND_ABILITY_ULTIMATE_QUICKCAST_AUTOCAST = 0x4f,
	DOTA_KEYBIND_ABILITY_PRIMARY1_AUTOMATIC_AUTOCAST = 0x50,
	DOTA_KEYBIND_ABILITY_PRIMARY2_AUTOMATIC_AUTOCAST = 0x51,
	DOTA_KEYBIND_ABILITY_PRIMARY3_AUTOMATIC_AUTOCAST = 0x52,
	DOTA_KEYBIND_ABILITY_SECONDARY1_AUTOMATIC_AUTOCAST = 0x53,
	DOTA_KEYBIND_ABILITY_SECONDARY2_AUTOMATIC_AUTOCAST = 0x54,
	DOTA_KEYBIND_ABILITY_ULTIMATE_AUTOMATIC_AUTOCAST = 0x55,
	DOTA_KEYBIND_INVENTORY1 = 0x56,
	DOTA_KEYBIND_INVENTORY2 = 0x57,
	DOTA_KEYBIND_INVENTORY3 = 0x58,
	DOTA_KEYBIND_INVENTORY4 = 0x59,
	DOTA_KEYBIND_INVENTORY5 = 0x5a,
	DOTA_KEYBIND_INVENTORY6 = 0x5b,
	DOTA_KEYBIND_INVENTORYTP = 0x5c,
	DOTA_KEYBIND_INVENTORYNEUTRAL = 0x5d,
	DOTA_KEYBIND_INVENTORY1_QUICKCAST = 0x5e,
	DOTA_KEYBIND_INVENTORY2_QUICKCAST = 0x5f,
	DOTA_KEYBIND_INVENTORY3_QUICKCAST = 0x60,
	DOTA_KEYBIND_INVENTORY4_QUICKCAST = 0x61,
	DOTA_KEYBIND_INVENTORY5_QUICKCAST = 0x62,
	DOTA_KEYBIND_INVENTORY6_QUICKCAST = 0x63,
	DOTA_KEYBIND_INVENTORYTP_QUICKCAST = 0x64,
	DOTA_KEYBIND_INVENTORYNEUTRAL_QUICKCAST = 0x65,
	DOTA_KEYBIND_INVENTORY1_AUTOCAST = 0x66,
	DOTA_KEYBIND_INVENTORY2_AUTOCAST = 0x67,
	DOTA_KEYBIND_INVENTORY3_AUTOCAST = 0x68,
	DOTA_KEYBIND_INVENTORY4_AUTOCAST = 0x69,
	DOTA_KEYBIND_INVENTORY5_AUTOCAST = 0x6a,
	DOTA_KEYBIND_INVENTORY6_AUTOCAST = 0x6b,
	DOTA_KEYBIND_INVENTORYTP_AUTOCAST = 0x6c,
	DOTA_KEYBIND_INVENTORYNEUTRAL_AUTOCAST = 0x6d,
	DOTA_KEYBIND_INVENTORY1_QUICKAUTOCAST = 0x6e,
	DOTA_KEYBIND_INVENTORY2_QUICKAUTOCAST = 0x6f,
	DOTA_KEYBIND_INVENTORY3_QUICKAUTOCAST = 0x70,
	DOTA_KEYBIND_INVENTORY4_QUICKAUTOCAST = 0x71,
	DOTA_KEYBIND_INVENTORY5_QUICKAUTOCAST = 0x72,
	DOTA_KEYBIND_INVENTORY6_QUICKAUTOCAST = 0x73,
	DOTA_KEYBIND_INVENTORYTP_QUICKAUTOCAST = 0x74,
	DOTA_KEYBIND_INVENTORYNEUTRAL_QUICKAUTOCAST = 0x75,
	DOTA_KEYBIND_CONTROL_GROUP1 = 0x76,
	DOTA_KEYBIND_CONTROL_GROUP2 = 0x77,
	DOTA_KEYBIND_CONTROL_GROUP3 = 0x78,
	DOTA_KEYBIND_CONTROL_GROUP4 = 0x79,
	DOTA_KEYBIND_CONTROL_GROUP5 = 0x7a,
	DOTA_KEYBIND_CONTROL_GROUP6 = 0x7b,
	DOTA_KEYBIND_CONTROL_GROUP7 = 0x7c,
	DOTA_KEYBIND_CONTROL_GROUP8 = 0x7d,
	DOTA_KEYBIND_CONTROL_GROUP9 = 0x7e,
	DOTA_KEYBIND_CONTROL_GROUP10 = 0x7f,
	DOTA_KEYBIND_CONTROL_GROUPCYCLE = 0x80,
	DOTA_KEYBIND_SELECT_ALLY1 = 0x81,
	DOTA_KEYBIND_SELECT_ALLY2 = 0x82,
	DOTA_KEYBIND_SELECT_ALLY3 = 0x83,
	DOTA_KEYBIND_SELECT_ALLY4 = 0x84,
	DOTA_KEYBIND_SELECT_ALLY5 = 0x85,
	DOTA_KEYBIND_SHOP_TOGGLE = 0x86,
	DOTA_KEYBIND_SCOREBOARD_TOGGLE = 0x87,
	DOTA_KEYBIND_COMBATLOG_TOGGLE = 0x88,
	DOTA_KEYBIND_SCREENSHOT = 0x89,
	DOTA_KEYBIND_ESCAPE = 0x8a,
	DOTA_KEYBIND_CONSOLE = 0x8b,
	DOTA_KEYBIND_DEATH_SUMMARY = 0x8c,
	DOTA_KEYBIND_LEARN_ABILITIES = 0x8d,
	DOTA_KEYBIND_LEARN_STATS = 0x8e,
	DOTA_KEYBIND_ACTIVATE_GLYPH = 0x8f,
	DOTA_KEYBIND_ACTIVATE_RADAR = 0x90,
	DOTA_KEYBIND_PURCHASE_QUICKBUY = 0x91,
	DOTA_KEYBIND_PURCHASE_STICKY = 0x92,
	DOTA_KEYBIND_GRAB_STASH_ITEMS = 0x93,
	DOTA_KEYBIND_TOGGLE_AUTOATTACK = 0x94,
	DOTA_KEYBIND_TAUNT = 0x95,
	DOTA_KEYBIND_SHOP_CONSUMABLES = 0x96,
	DOTA_KEYBIND_SHOP_ATTRIBUTES = 0x97,
	DOTA_KEYBIND_SHOP_ARMAMENTS = 0x98,
	DOTA_KEYBIND_SHOP_ARCANE = 0x99,
	DOTA_KEYBIND_SHOP_BASICS = 0x9a,
	DOTA_KEYBIND_SHOP_SUPPORT = 0x9b,
	DOTA_KEYBIND_SHOP_CASTER = 0x9c,
	DOTA_KEYBIND_SHOP_WEAPONS = 0x9d,
	DOTA_KEYBIND_SHOP_ARMOR = 0x9e,
	DOTA_KEYBIND_SHOP_ARTIFACTS = 0x9f,
	DOTA_KEYBIND_SHOP_SIDE_PAGE_1 = 0xa0,
	DOTA_KEYBIND_SHOP_SIDE_PAGE_2 = 0xa1,
	DOTA_KEYBIND_SHOP_SECRET = 0xa2,
	DOTA_KEYBIND_SHOP_SEARCHBOX = 0xa3,
	DOTA_KEYBIND_SHOP_SLOT_1 = 0xa4,
	DOTA_KEYBIND_SHOP_SLOT_2 = 0xa5,
	DOTA_KEYBIND_SHOP_SLOT_3 = 0xa6,
	DOTA_KEYBIND_SHOP_SLOT_4 = 0xa7,
	DOTA_KEYBIND_SHOP_SLOT_5 = 0xa8,
	DOTA_KEYBIND_SHOP_SLOT_6 = 0xa9,
	DOTA_KEYBIND_SHOP_SLOT_7 = 0xaa,
	DOTA_KEYBIND_SHOP_SLOT_8 = 0xab,
	DOTA_KEYBIND_SHOP_SLOT_9 = 0xac,
	DOTA_KEYBIND_SHOP_SLOT_10 = 0xad,
	DOTA_KEYBIND_SHOP_SLOT_11 = 0xae,
	DOTA_KEYBIND_SHOP_SLOT_12 = 0xaf,
	DOTA_KEYBIND_SHOP_SLOT_13 = 0xb0,
	DOTA_KEYBIND_SHOP_SLOT_14 = 0xb1,
	DOTA_KEYBIND_SPEC_CAMERA_UP = 0xb2,
	DOTA_KEYBIND_SPEC_CAMERA_DOWN = 0xb3,
	DOTA_KEYBIND_SPEC_CAMERA_LEFT = 0xb4,
	DOTA_KEYBIND_SPEC_CAMERA_RIGHT = 0xb5,
	DOTA_KEYBIND_SPEC_CAMERA_GRIP = 0xb6,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_1 = 0xb7,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_2 = 0xb8,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_3 = 0xb9,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_4 = 0xba,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_5 = 0xbb,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_6 = 0xbc,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_7 = 0xbd,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_8 = 0xbe,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_9 = 0xbf,
	DOTA_KEYBIND_SPEC_CAMERA_SAVED_POSITION_10 = 0xc0,
	DOTA_KEYBIND_SPEC_UNIT_SELECT = 0xc1,
	DOTA_KEYBIND_SPEC_HERO_SELECT = 0xc2,
	DOTA_KEYBIND_SPEC_PAUSE = 0xc3,
	DOTA_KEYBIND_SPEC_CHAT = 0xc4,
	DOTA_KEYBIND_SPEC_SCOREBOARD = 0xc5,
	DOTA_KEYBIND_SPEC_INCREASE_REPLAY_SPEED = 0xc6,
	DOTA_KEYBIND_SPEC_DECREASE_REPLAY_SPEED = 0xc7,
	DOTA_KEYBIND_SPEC_STATS_HARVEST = 0xc8,
	DOTA_KEYBIND_SPEC_STATS_ITEM = 0xc9,
	DOTA_KEYBIND_SPEC_STATS_GOLD = 0xca,
	DOTA_KEYBIND_SPEC_STATS_XP = 0xcb,
	DOTA_KEYBIND_SPEC_STATS_FANTASY = 0xcc,
	DOTA_KEYBIND_SPEC_STATS_WINCHANCE = 0xcd,
	DOTA_KEYBIND_SPEC_FOW_TOGGLEBOTH = 0xce,
	DOTA_KEYBIND_SPEC_FOW_TOGGLERADIENT = 0xcf,
	DOTA_KEYBIND_SPEC_FOW_TOGGLEDIRE = 0xd0,
	DOTA_KEYBIND_SPEC_OPEN_BROADCASTER_MENU = 0xd1,
	DOTA_KEYBIND_SPEC_DROPDOWN_KDA = 0xd2,
	DOTA_KEYBIND_SPEC_DROPDOWN_LASTHITS_DENIES = 0xd3,
	DOTA_KEYBIND_SPEC_DROPDOWN_LEVEL = 0xd4,
	DOTA_KEYBIND_SPEC_DROPDOWN_XP_PER_MIN = 0xd5,
	DOTA_KEYBIND_SPEC_DROPDOWN_GOLD = 0xd6,
	DOTA_KEYBIND_SPEC_DROPDOWN_TOTALGOLD = 0xd7,
	DOTA_KEYBIND_SPEC_DROPDOWN_GOLD_PER_MIN = 0xd8,
	DOTA_KEYBIND_SPEC_DROPDOWN_BUYBACK = 0xd9,
	DOTA_KEYBIND_SPEC_DROPDOWN_NETWORTH = 0xda,
	DOTA_KEYBIND_SPEC_DROPDOWN_FANTASY = 0xdb,
	DOTA_KEYBIND_SPEC_DROPDOWN_SORT = 0xdc,
	DOTA_KEYBIND_SPEC_DROPDOWN_CLOSE = 0xdd,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_1 = 0xde,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_2 = 0xdf,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_3 = 0xe0,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_4 = 0xe1,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_5 = 0xe2,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_6 = 0xe3,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_7 = 0xe4,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_8 = 0xe5,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_9 = 0xe6,
	DOTA_KEYBIND_SPEC_FOCUS_PLAYER_10 = 0xe7,
	DOTA_KEYBIND_SPEC_COACH_VIEWTOGGLE = 0xe8,
	DOTA_KEYBIND_INSPECTHEROINWORLD = 0xe9,
	DOTA_KEYBIND_CAMERA_ZOOM_IN = 0xea,
	DOTA_KEYBIND_CAMERA_ZOOM_OUT = 0xeb,
	DOTA_KEYBIND_CONTROL_GROUPCYCLEPREV = 0xec,
	DOTA_KEYBIND_DOTA_ALT = 0xed,
	DOTA_KEYBIND_COUNT = 0xee,
};

// Alignment: 4
// Size: 0x4
enum class ECandyShopRewardOptionType : uint32_t
{
	k_eCandyShopRewardOptionType_SingleItem = 0x0,
	k_eCandyShopRewardOptionType_LootList = 0x1,
	k_eCandyShopRewardOptionType_SingleEventAction = 0x2,
	k_eCandyShopRewardOptionType_EventPoints = 0x3,
};

// Alignment: 4
// Size: 0x2
enum class StartupBehavior_t : uint32_t
{
	UNIT_STARTUP_BEHAVIOR_DEFAULT = 0x0,
	UNIT_STARTUP_BEHAVIOR_TAUNT = 0x1,
};

// Alignment: 4
// Size: 0x5
enum class PortraitDisplayMode_t : uint32_t
{
	PORTRAIT_DISPLAY_MODE_INVALID = 0xffffffffffffffff,
	PORTRAIT_DISPLAY_MODE_LOADOUT = 0x0,
	PORTRAIT_DISPLAY_MODE_LOADOUT_DIRE = 0x1,
	PORTRAIT_DISPLAY_MODE_LOADOUT_SMALL = 0x2,
	PORTRAIT_DISPLAY_MODE_TREASURE_SMALL = 0x3,
};

// Alignment: 4
// Size: 0x6
enum class PortraitScale_t : uint32_t
{
	PORTRAIT_SCALE_INVALID = 0xffffffffffffffff,
	PORTRAIT_SCALE_LOADOUT = 0x0,
	PORTRAIT_SCALE_ALTERNATE_LOADOUT = 0x1,
	PORTRAIT_SCALE_WORLD = 0x2,
	PORTRAIT_SCALE_SPECTATOR_LOADOUT = 0x3,
	PORTRAIT_SCALE_VERSUS_LOADOUT = 0x4,
};

// Alignment: 4
// Size: 0xa
enum class DotaCustomUIType_t : uint32_t
{
	DOTA_CUSTOM_UI_TYPE_HUD = 0x0,
	DOTA_CUSTOM_UI_TYPE_HERO_SELECTION = 0x1,
	DOTA_CUSTOM_UI_TYPE_PREGAME_STRATEGY = 0x2,
	DOTA_CUSTOM_UI_TYPE_GAME_INFO = 0x3,
	DOTA_CUSTOM_UI_TYPE_GAME_SETUP = 0x4,
	DOTA_CUSTOM_UI_TYPE_FLYOUT_SCOREBOARD = 0x5,
	DOTA_CUSTOM_UI_TYPE_HUD_TOP_BAR = 0x6,
	DOTA_CUSTOM_UI_TYPE_END_SCREEN = 0x7,
	DOTA_CUSTOM_UI_TYPE_COUNT = 0x8,
	DOTA_CUSTOM_UI_TYPE_INVALID = 0xffffffffffffffff,
};

// Alignment: 4
// Size: 0x13
enum class SteamUGCQuery : uint32_t
{
	RankedByVote = 0x0,
	RankedByPublicationDate = 0x1,
	AcceptedForGameRankedByAcceptanceDate = 0x2,
	RankedByTrend = 0x3,
	FavoritedByFriendsRankedByPublicationDate = 0x4,
	CreatedByFriendsRankedByPublicationDate = 0x5,
	RankedByNumTimesReported = 0x6,
	CreatedByFollowedUsersRankedByPublicationDate = 0x7,
	NotYetRated = 0x8,
	RankedByTotalVotesAsc = 0x9,
	RankedByVotesUp = 0xa,
	RankedByTextSearch = 0xb,
	RankedByTotalUniqueSubscriptions = 0xc,
	RankedByPlaytimeTrend = 0xd,
	RankedByTotalPlaytime = 0xe,
	RankedByAveragePlaytimeTrend = 0xf,
	RankedByLifetimeAveragePlaytime = 0x10,
	RankedByPlaytimeSessionsTrend = 0x11,
	RankedByLifetimePlaytimeSessions = 0x12,
};

// Alignment: 4
// Size: 0xe
enum class SteamUGCMatchingUGCType : uint32_t
{
	Items = 0x0,
	Items_Mtx = 0x1,
	Items_ReadyToUse = 0x2,
	Collections = 0x3,
	Artwork = 0x4,
	Videos = 0x5,
	Screenshots = 0x6,
	AllGuides = 0x7,
	WebGuides = 0x8,
	IntegratedGuides = 0x9,
	UsableInGame = 0xa,
	ControllerBindings = 0xb,
	GameManagedItems = 0xc,
	All = 0xffffffffffffffff,
};

// Alignment: 4
// Size: 0x5
enum class SteamUniverse : uint32_t
{
	Invalid = 0x0,
	Internal = 0x3,
	Dev = 0x4,
	Beta = 0x2,
	Public = 0x1,
};

// Alignment: 4
// Size: 0x4
enum class PlayerUltimateStateOrTime_t : uint32_t
{
	PLAYER_ULTIMATE_STATE_READY = 0x0,
	PLAYER_ULTIMATE_STATE_NO_MANA = 0xffffffffffffffff,
	PLAYER_ULTIMATE_STATE_NOT_LEVELED = 0xfffffffffffffffe,
	PLAYER_ULTIMATE_STATE_HIDDEN = 0xfffffffffffffffd,
};

// Alignment: 4
// Size: 0x3
enum class CDOTA_BaseNPC_AghsFort_Watch_Tower__ExitDirection_t : uint32_t
{
	EXIT_DIRECTION_LEFT = 0x0,
	EXIT_DIRECTION_TOP = 0x1,
	EXIT_DIRECTION_RIGHT = 0x2,
};

// Alignment: 4
// Size: 0x5
enum class EHighlightScoreComparison : uint32_t
{
	k_eScoreLessThan = 0x0,
	k_eScoreLessThanOrEqual = 0x1,
	k_eScoreEqual = 0x2,
	k_eScoreGreaterThanOrEqual = 0x3,
	k_eScoreGreaterThan = 0x4,
};

// Alignment: 4
// Size: 0x4
enum class EHighlightNumberFormat : uint32_t
{
	k_eFloat = 0x0,
	k_eInteger = 0x1,
	k_ePercentage = 0x2,
	k_eTime = 0x3,
};

// Alignment: 4
// Size: 0x19
enum class EHeroSelectionText : uint32_t
{
	k_EHeroSelectionText_Invalid = 0xffffffffffffffff,
	k_EHeroSelectionText_None = 0x0,
	k_EHeroSelectionText_ChooseHero = 0x1,
	k_EHeroSelectionText_AllDraft_Planning_YouFirst = 0x2,
	k_EHeroSelectionText_AllDraft_Planning_TheyFirst = 0x3,
	k_EHeroSelectionText_AllDraft_Banning = 0x4,
	k_EHeroSelectionText_AllDraft_Ban_Waiting = 0x5,
	k_EHeroSelectionText_AllDraft_PickTwo = 0x6,
	k_EHeroSelectionText_AllDraft_PickOneMore = 0x7,
	k_EHeroSelectionText_AllDraft_PickOne = 0x8,
	k_EHeroSelectionText_AllDraft_WaitingRadiant = 0x9,
	k_EHeroSelectionText_AllDraft_WaitingDire = 0xa,
	k_EHeroSelectionText_AllDraft_TeammateRandomed = 0xb,
	k_EHeroSelectionText_AllDraft_YouPicking_LosingGold = 0xc,
	k_EHeroSelectionText_AllDraft_TheyPicking_LosingGold = 0xd,
	k_EHeroSelectionText_CaptainsMode_ChooseCaptain = 0xe,
	k_EHeroSelectionText_CaptainsMode_WaitingForChooseCaptain = 0xf,
	k_EHeroSelectionText_CaptainsMode_YouSelect = 0x10,
	k_EHeroSelectionText_CaptainsMode_TheySelect = 0x11,
	k_EHeroSelectionText_CaptainsMode_YouBan = 0x12,
	k_EHeroSelectionText_CaptainsMode_TheyBan = 0x13,
	k_EHeroSelectionText_RandomDraft_HeroReview = 0x14,
	k_EHeroSelectionText_RandomDraft_RoundDisplay = 0x15,
	k_EHeroSelectionText_RandomDraft_Waiting = 0x16,
	k_EHeroSelectionText_EventGame_BanPhase = 0x17,
};

struct ChangeAccessorFieldPathIndex_t;
struct CEntityIdentity;
struct CScriptComponent;
struct CGameSceneNode;
struct CNetworkVarChainer;
struct CSkeletonInstance;
struct GameTime_t;
struct C_fogplayerparams_t;
struct audioparams_t;
struct fogparams_t;
struct CInButtonState;
struct AmmoIndex_t;
struct CBaseAnimGraphController;
struct ModelConfigHandle_t;
struct CEntityInstance;
struct CGameSceneNodeHandle;
struct CNetworkOriginCellCoordQuantizedVector;
struct HSequence;
struct CModelState;
struct CBodyComponent;
struct CNetworkTransmitComponent;
struct GameTick_t;
struct CRenderComponent;
struct CCollisionProperty;
struct CNetworkVelocityVector;
struct CParticleProperty;
struct C_EnvWindShared;
struct C_RopeKeyframe;
struct sky3dparams_t;
struct C_SkyCamera;
struct VPhysicsCollisionAttribute_t;
struct CDecalInfo;
struct AttachmentHandle_t;
struct CAttributeManager;
struct attrib_definition_index_t;
struct C_EconItemView;
struct ParticleIndex_t;
struct CNetworkedSequenceOperation;
struct C_CSequenceTransitioner2;
struct AnimationUpdateListHandle_t;
struct C_BaseAnimatingController;
struct C_BaseAnimatingOverlayController;
struct C_DOTAGameManager;
struct C_DOTAGamerules;
struct AbilityID_t;
struct PlayerID_t;
struct CountdownTimer;
struct itemid_t;
struct DOTA_AssassinMinigameNetworkState;
struct MatchID_t;
struct LeagueID_t;
struct CDOTA_ArcanaDataEntity_DrowRanger;
struct CDOTA_ArcanaDataEntity_FacelessVoid;
struct CDOTA_ArcanaDataEntity_Razor;
struct CModifierParams;
struct CDOTA_Buff;
struct sSpiritInfo;
struct CNewParticleEffect;
struct PeriodicResourceID_t;
struct item_definition_index_t;
struct GuildID_t;
struct CavernCrawlMapVariant_t;
struct C_DOTA_UnitInventory;
struct CandyShopCandyTypeID_t;
struct CandyShopRewardOptionID_t;
struct CandyShopID_t;
struct C_DOTASpectatorGraphManager;
struct CEntityIOOutput;
struct C_PointCamera;
struct C_CommandContext;
struct CSkillFloat;
struct CHitboxComponent;
struct CGlowProperty;
struct CNetworkViewOffsetVector;
struct CClientAlphaProperty;
struct C_RopeKeyframe::CPhysicsDelegate;
struct CPointOffScreenIndicatorUi;
struct C_PointClientUIWorldPanel;
struct style_index_t;
struct CAttributeList;
struct C_DOTABaseAbility;
struct C_DOTA_BaseNPC;
struct CLightComponent;
struct CBaseAnimGraph;
struct PhysicsRagdollPose_t;
struct CAttributeContainer;
struct CPlayer_WeaponServices;
struct CPlayer_ItemServices;
struct CPlayer_AutoaimServices;
struct CPlayer_ObserverServices;
struct CPlayer_WaterServices;
struct CPlayer_UseServices;
struct CPlayer_FlashlightServices;
struct CPlayer_CameraServices;
struct CPlayer_MovementServices;
struct CDOTA_ModifierManager;
struct CAnnouncerDescriptor;

// Alignment: 11
// Size: 0x78
class CEntityIdentity
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x14]; // 0x0
public:
	// MNetworkEnable
	// MNetworkChangeCallback "entityIdentityNameChanged"
	int32_t m_nameStringableIndex; // 0x14	
	CUtlSymbolLarge m_name; // 0x18	
	CUtlSymbolLarge m_designerName; // 0x20	
private:
	[[maybe_unused]] uint8_t __pad0028[0x8]; // 0x28
public:
	uint32_t m_flags; // 0x30	
private:
	[[maybe_unused]] uint8_t __pad0034[0x4]; // 0x34
public:
	// MNetworkDisable
	WorldGroupId_t m_worldGroupId; // 0x38	
	uint32_t m_fDataObjectTypes; // 0x3c	
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	ChangeAccessorFieldPathIndex_t m_PathIndex; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad0042[0x16]; // 0x42
public:
	CEntityIdentity* m_pPrev; // 0x58	
	CEntityIdentity* m_pNext; // 0x60	
	CEntityIdentity* m_pPrevByClass; // 0x68	
	CEntityIdentity* m_pNextByClass; // 0x70	
};

// Alignment: 3
// Size: 0x30
class CEntityInstance : public IHandleEntity
{
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8	
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity* m_pEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0018[0x10]; // 0x18
public:
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x28	
};

// Alignment: 1
// Size: 0x38
class CScriptComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x28]; // 0x8
public:
	CUtlSymbolLarge m_scriptClassName; // 0x30	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x50
class CBodyComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	CGameSceneNode* m_pSceneNode; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0010[0x10]; // 0x10
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x20	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x10
class CGameSceneNodeHandle
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	CEntityHandle m_hOwner; // 0x8	
	// MNetworkEnable
	CUtlStringToken m_name; // 0xc	
};

// Alignment: 33
// Size: 0x150
class CGameSceneNode
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	// MNetworkDisable
	CTransform m_nodeToWorld; // 0x10	
	// MNetworkDisable
	CEntityInstance* m_pOwner; // 0x30	
	// MNetworkDisable
	CGameSceneNode* m_pParent; // 0x38	
	// MNetworkDisable
	CGameSceneNode* m_pChild; // 0x40	
	// MNetworkDisable
	CGameSceneNode* m_pNextSibling; // 0x48	
private:
	[[maybe_unused]] uint8_t __pad0050[0x20]; // 0x50
public:
	// MNetworkEnable
	// MNetworkSerializer "gameSceneNode"
	// MNetworkChangeCallback "gameSceneNodeHierarchyParentChanged"
	// MNetworkPriority "32"
	// MNetworkVarEmbeddedFieldOffsetDelta "8"
	CGameSceneNodeHandle m_hParent; // 0x70	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Origin"
	// MNetworkChangeCallback "gameSceneNodeLocalOriginChanged"
	CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80	
private:
	[[maybe_unused]] uint8_t __pad00b0[0x8]; // 0xb0
public:
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkSerializer "gameSceneNodeStepSimulationAnglesSerializer"
	// MNetworkChangeCallback "gameSceneNodeLocalAnglesChanged"
	QAngle m_angRotation; // 0xb8	
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeLocalScaleChanged"
	// MNetworkPriority "32"
	float m_flScale; // 0xc4	
	// MNetworkDisable
	Vector m_vecAbsOrigin; // 0xc8	
	// MNetworkDisable
	QAngle m_angAbsRotation; // 0xd4	
	// MNetworkDisable
	float m_flAbsScale; // 0xe0	
	// MNetworkDisable
	int16_t m_nParentAttachmentOrBone; // 0xe4	
	// MNetworkDisable
	bool m_bDebugAbsOriginChanges; // 0xe6	
	// MNetworkDisable
	bool m_bDormant; // 0xe7	
	// MNetworkDisable
	bool m_bForceParentToBeNetworked; // 0xe8	
	struct 
	{
		// MNetworkDisable
		uint8_t m_bDirtyHierarchy: 1; 		
		// MNetworkDisable
		uint8_t m_bDirtyBoneMergeInfo: 1; 		
		// MNetworkDisable
		uint8_t m_bNetworkedPositionChanged: 1; 		
		// MNetworkDisable
		uint8_t m_bNetworkedAnglesChanged: 1; 		
		// MNetworkDisable
		uint8_t m_bNetworkedScaleChanged: 1; 		
		// MNetworkDisable
		uint8_t m_bWillBeCallingPostDataUpdate: 1; 		
		// MNetworkDisable
		uint8_t m_bNotifyBoneTransformsChanged: 1; 		
		// MNetworkDisable
		uint8_t m_bBoneMergeFlex: 1; 		
		// MNetworkDisable
		uint8_t m_nLatchAbsOrigin: 2; 		
		// MNetworkDisable
		uint8_t m_bDirtyBoneMergeBoneToRoot: 1; 		
		uint16_t __pad0: 13;
	}; // 24 bits
	// MNetworkDisable
	uint8_t m_nHierarchicalDepth; // 0xeb	
	// MNetworkDisable
	uint8_t m_nHierarchyType; // 0xec	
	// MNetworkDisable
	uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xed	
private:
	[[maybe_unused]] uint8_t __pad00ee[0x2]; // 0xee
public:
	// MNetworkEnable
	CUtlStringToken m_name; // 0xf0	
private:
	[[maybe_unused]] uint8_t __pad00f4[0x3c]; // 0xf4
public:
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeHierarchyAttachmentChanged"
	CUtlStringToken m_hierarchyAttachName; // 0x130	
	// MNetworkDisable
	float m_flZOffset; // 0x134	
	// MNetworkDisable
	Vector m_vRenderOrigin; // 0x138	
};

// Alignment: 1
// Size: 0x28
class CHitboxComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x1c]; // 0x8
public:
	// MNetworkEnable
	uint32_t m_bvDisabledHitGroups[1]; // 0x24	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_referenced_but_impl_is_contained(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 70
// Size: 0x1d0
class CLightComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x40]; // 0x8
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x48	
private:
	[[maybe_unused]] uint8_t __pad0070[0x15]; // 0x70
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_Color; // 0x85	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_SecondaryColor; // 0x89	
private:
	[[maybe_unused]] uint8_t __pad008d[0x3]; // 0x8d
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightness; // 0x90	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessScale; // 0x94	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessMult; // 0x98	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flRange; // 0x9c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFalloff; // 0xa0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation0; // 0xa4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation1; // 0xa8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation2; // 0xac	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flTheta; // 0xb0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flPhi; // 0xb4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0xb8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascades; // 0xc0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCastShadows; // 0xc4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowWidth; // 0xc8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowHeight; // 0xcc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderDiffuse; // 0xd0	
private:
	[[maybe_unused]] uint8_t __pad00d1[0x3]; // 0xd1
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nRenderSpecular; // 0xd4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderTransmissive; // 0xd8	
private:
	[[maybe_unused]] uint8_t __pad00d9[0x3]; // 0xd9
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flOrthoLightWidth; // 0xdc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flOrthoLightHeight; // 0xe0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nStyle; // 0xe4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlString m_Pattern; // 0xe8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascadeRenderStaticObjects; // 0xf0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeCrossFade; // 0xf4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistanceFade; // 0xf8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance0; // 0xfc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance1; // 0x100	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance2; // 0x104	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance3; // 0x108	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution0; // 0x10c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution1; // 0x110	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution2; // 0x114	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution3; // 0x118	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nBakeLightIndex; // 0x11c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBakeLightIndexScale; // 0x120	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bUsesIndexedBakedLighting; // 0x124	
private:
	[[maybe_unused]] uint8_t __pad0125[0x3]; // 0x125
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nPriority; // 0x128	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowPriority; // 0x12c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nBakedShadowIndex; // 0x130	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderToCubemaps; // 0x134	
private:
	[[maybe_unused]] uint8_t __pad0135[0x3]; // 0x135
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlSymbolLarge m_LightGroups; // 0x138	
	// MNetworkEnable
	int32_t m_nDirectLight; // 0x140	
	// MNetworkEnable
	int32_t m_nIndirectLight; // 0x144	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMinDist; // 0x148	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMaxDist; // 0x14c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMinDist; // 0x150	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMaxDist; // 0x154	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bEnabled; // 0x158	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bFlicker; // 0x159	
	// MNetworkEnable
	bool m_bPrecomputedFieldsValid; // 0x15a	
private:
	[[maybe_unused]] uint8_t __pad015b[0x1]; // 0x15b
public:
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMins; // 0x15c	
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMaxs; // 0x168	
	// MNetworkEnable
	Vector m_vPrecomputedOBBOrigin; // 0x174	
	// MNetworkEnable
	QAngle m_vPrecomputedOBBAngles; // 0x180	
	// MNetworkEnable
	Vector m_vPrecomputedOBBExtent; // 0x18c	
	// MNetworkEnable
	float m_flPrecomputedMaxRange; // 0x198	
	// MNetworkEnable
	int32_t m_nFogLightingMode; // 0x19c	
	// MNetworkEnable
	float m_flFogContributionStength; // 0x1a0	
	// MNetworkEnable
	float m_flNearClipPlane; // 0x1a4	
	// MNetworkEnable
	Color m_SkyColor; // 0x1a8	
	// MNetworkEnable
	float m_flSkyIntensity; // 0x1ac	
	// MNetworkEnable
	Color m_SkyAmbientBounce; // 0x1b0	
	// MNetworkEnable
	bool m_bUseSecondaryColor; // 0x1b4	
	// MNetworkEnable
	// MNetworkChangeCallback "MixedShadowsChanged"
	bool m_bMixedShadows; // 0x1b5	
private:
	[[maybe_unused]] uint8_t __pad01b6[0x2]; // 0x1b6
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	GameTime_t m_flLightStyleStartTime; // 0x1b8	
	// MNetworkEnable
	float m_flCapsuleLength; // 0x1bc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flMinRoughness; // 0x1c0	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 5
// Size: 0xd8
class CRenderComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x8]; // 0x8
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0038[0x18]; // 0x38
public:
	bool m_bIsRenderingWithViewModels; // 0x50	
private:
	[[maybe_unused]] uint8_t __pad0051[0x3]; // 0x51
public:
	uint32_t m_nSplitscreenFlags; // 0x54	
private:
	[[maybe_unused]] uint8_t __pad0058[0x8]; // 0x58
public:
	bool m_bEnableRendering; // 0x60	
private:
	[[maybe_unused]] uint8_t __pad0061[0x4f]; // 0x61
public:
	bool m_bInterpolationReadyToDraw; // 0xb0	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fields[1]->m_instance);};
};

// Alignment: 2
// Size: 0x28
class CBuoyancyHelper
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x18]; // 0x0
public:
	float m_flFluidDensity; // 0x18	
	float m_flDisplacementFromObjects; // 0x1c	
};

// Alignment: 2
// Size: 0x78
class C_CommandContext
{
public:
	bool needsprocessing; // 0x0	
	int32_t command_number; // 0x70	
};

// Alignment: 0
// Size: 0x40
class CPlayer_AutoaimServices : public CPlayerPawnComponent
{
public:
	// No members available
};

// Alignment: 5
// Size: 0x78
struct audioparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEncoder
	Vector localSound[8]; // 0x8	
	// MNetworkEnable
	int32_t soundscapeIndex; // 0x68	
	// MNetworkEnable
	uint8_t localBits; // 0x6c	
private:
	[[maybe_unused]] uint8_t __pad006d[0x3]; // 0x6d
public:
	// MNetworkEnable
	int32_t soundscapeEntityListIndex; // 0x70	
	// MNetworkEnable
	uint32_t soundEventHash; // 0x74	
};

// Alignment: 25
// Size: 0x68
struct fogparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEncoder
	Vector dirPrimary; // 0x8	
	// MNetworkEnable
	Color colorPrimary; // 0x14	
	// MNetworkEnable
	Color colorSecondary; // 0x18	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorPrimaryLerpTo; // 0x1c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorSecondaryLerpTo; // 0x20	
	// MNetworkEnable
	float start; // 0x24	
	// MNetworkEnable
	float end; // 0x28	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float farz; // 0x2c	
	// MNetworkEnable
	float maxdensity; // 0x30	
	// MNetworkEnable
	float exponent; // 0x34	
	// MNetworkEnable
	float HDRColorScale; // 0x38	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactor; // 0x3c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactorLerpTo; // 0x40	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float startLerpTo; // 0x44	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float endLerpTo; // 0x48	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float maxdensityLerpTo; // 0x4c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	GameTime_t lerptime; // 0x50	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float duration; // 0x54	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float blendtobackground; // 0x58	
