#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

///////////////////////////////////////////
// Binary: server.dll
// Class Count: 481
// Enum Count: 0
///////////////////////////////////////////

// Aligment: 18
// Size: 2016
class CPhysBox : public CBreakable, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_damageType; // 0x630
	float m_massScale; // 0x634
	int32_t m_damageToEnableMotion; // 0x638
	float m_flForceToEnableMotion; // 0x63c
	QAngle m_angPreferredCarryAngles; // 0x640
	bool m_bNotSolidToWorld; // 0x64c
	int32_t m_iExploitableByPlayer; // 0x650
	float m_flTouchOutputPerEntityDelay; // 0x654
	CEntityIOOutput m_OnDamaged; // 0x658
	CEntityIOOutput m_OnAwakened; // 0x680
	CEntityIOOutput m_OnMotionEnabled; // 0x6a8
	CEntityIOOutput m_OnPhysGunPickup; // 0x6d0
	CEntityIOOutput m_OnPhysGunPunt; // 0x6f8
	CEntityIOOutput m_OnPhysGunOnlyPickup; // 0x720
	CEntityIOOutput m_OnPhysGunDrop; // 0x748
	CEntityIOOutput m_OnPlayerUse; // 0x770
	CEntityIOOutput m_OnStartTouch; // 0x798
	CHandle< CBasePlayer > m_hCarryingPlayer; // 0x7c0
};

// Aligment: 2
// Size: 2032
class CPhysBoxMultiplayer : public CPhysBox, CBreakable, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "1"
	uint32_t m_iPhysicsMode; // 0x7e8
	// MNetworkEnable
	// MNetworkEnable
	float m_fMass; // 0x7ec
};

// Aligment: 0
// Size: 2696
class CPhysicsPropMultiplayer : public CPhysicsProp, CBreakableProp, CBaseProp, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 5
// Size: 2752
class CPhysicsPropRespawnable : public CPhysicsProp, CBreakableProp, CBaseProp, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vOriginalSpawnOrigin; // 0xa88
	QAngle m_vOriginalSpawnAngles; // 0xa94
	Vector m_vOriginalMins; // 0xaa0
	Vector m_vOriginalMaxs; // 0xaac
	float m_flRespawnDuration; // 0xab8
};

// Aligment: 0
// Size: 848
class CFuncPropRespawnZone : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 3
// Size: 864
class CPointHMDAnchor : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDisabled; // 0x350
	// MNetworkEnable
	// MNetworkEnable
	float m_flEnableTime; // 0x354
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	int32_t m_nPlayerIndex; // 0x358
};

// Aligment: 0
// Size: 864
class CPointHMDAnchorOverride : public CPointHMDAnchor, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 9
// Size: 1768
class CPropVRTrackedObject : public CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bShouldBePhysicallyConstrained; // 0x690
	bool m_bFoundInitialSafeLocation; // 0x691
	// MNetworkEnable
	bool m_bIsTracking; // 0x6b0
	// MNetworkEnable
	Vector m_vTrackedPosition; // 0x6b4
	// MNetworkEnable
	QAngle m_qTrackedAngles; // 0x6c0
	// MNetworkEnable
	Vector m_vPhysicallyConstrainedPosition; // 0x6cc
	// MNetworkEnable
	QAngle m_qPhysicallyConstrainedAngles; // 0x6d8
	// MNetworkEnable
	bool m_bClientIsAuthoritativeForTransform; // 0x6e4
	// MNetworkEnable
	bool m_bIsInContact; // 0x6e5
};

// Aligment: 4
// Size: 1808
class CPropHMDAvatar : public CPropVRTrackedObject, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	int32[2] m_hLiteralControllerSlots; // 0x6e8
	// MNetworkEnable
	// MNetworkEnable
	int32[2] m_hLogicalControllerSlots; // 0x6f0
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPropVRHand >[4] m_hVRControllers; // 0x6f8
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPointWorldText > m_hCloseCaption; // 0x708
};

// Aligment: 5
// Size: 52
struct HandHistoryInfo_t
{
public:
	Vector m_vVelocity; // 0x0
	Vector m_vFilteredVelocity; // 0xc
	Vector m_vFilteredThrowVel; // 0x18
	Vector m_vPosition; // 0x24
	float m_flSampleTime; // 0x30
};

// Aligment: 39
// Size: 2456
class CPropVRHand : public CPropVRTrackedObject, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseVRHandAttachment > m_hActiveHandAttachment; // 0x720
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPropHMDAvatar > m_hHMDAvatar; // 0x724
	// MNetworkEnable
	bool m_bVrSkeletonActive; // 0x728
	// MNetworkEnable
	int32_t m_nVrBoneCount; // 0x72c
	// MNetworkEnable
	uint32_t m_unVrCompressedBoneTransformsSize; // 0x730
	// MNetworkEnable
	uint8[64] m_vrCompressedBoneTransforms; // 0x734
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkTypeAlias "CBaseVRHandAttachmentHandle"
	CUtlVector< CHandle< CBaseVRHandAttachment > > m_hAttachments; // 0x778
	// MNetworkEnable
	// MNetworkEnable
	bool m_bInitialized; // 0x790
	// MNetworkEnable
	// MNetworkEnable
	bool m_bIsInView; // 0x791
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nHandID; // 0x794
	// MNetworkEnable
	// MNetworkEnable
	float m_flTriggerAnalogValue; // 0x798
	// MNetworkEnable
	// MNetworkEnable
	float m_flGripAnalogValue; // 0x79c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFinger0; // 0x7a0
	// MNetworkEnable
	// MNetworkEnable
	float m_flFinger1; // 0x7a4
	// MNetworkEnable
	// MNetworkEnable
	float m_flFinger2; // 0x7a8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFinger3; // 0x7ac
	// MNetworkEnable
	// MNetworkEnable
	float m_flFinger4; // 0x7b0
	// MNetworkEnable
	// MNetworkEnable
	float m_flFingerSplay0; // 0x7b4
	// MNetworkEnable
	// MNetworkEnable
	float m_flFingerSplay1; // 0x7b8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFingerSplay2; // 0x7bc
	// MNetworkEnable
	// MNetworkEnable
	float m_flFingerSplay3; // 0x7c0
	// MNetworkEnable
	// MNetworkEnable
	float m_flTrackpadAnalogValueX; // 0x7c4
	// MNetworkEnable
	// MNetworkEnable
	float m_flTrackpadAnalogValueY; // 0x7c8
	// MNetworkEnable
	// MNetworkEnable
	float m_flJoystickAnalogValueX; // 0x7cc
	// MNetworkEnable
	// MNetworkEnable
	float m_flJoystickAnalogValueY; // 0x7d0
	// MNetworkEnable
	// MNetworkEnable
	bool m_bCanPerformUse; // 0x7d4
	// MNetworkEnable
	// MNetworkEnable
	bool m_bTipTransformInitialized; // 0x7d5
	// MNetworkEnable
	// MNetworkEnable
	Vector m_localTipOrigin; // 0x7d8
	// MNetworkEnable
	// MNetworkEnable
	QAngle m_localTipAngles; // 0x7e4
	// MNetworkEnable
	// MNetworkEnable
	float m_flHapticPulseTime; // 0x7f0
	// MNetworkEnable
	// MNetworkEnable
	int16_t m_nHapticPulseInterval; // 0x7f4
	CInteractionManager m_InteractionMgr; // 0x7f8
	matrix3x4_t m_matUseTransform; // 0x8d0
	uint8_t m_nAttachUseIndex; // 0x900
	matrix3x4_t m_matHoldTransform; // 0x904
	uint8_t m_nAttachHoldIndex; // 0x934
	matrix3x4_t m_matHoverTransform; // 0x938
	uint8_t m_nAttachHoverIndex; // 0x968
	// MNetworkEnable
	// MNetworkEnable
	eLiteralHandType m_LiteralHandType; // 0x96c
};

// Aligment: 2
// Size: 16
struct prevent_interaction_t
{
public:
	CHandle< CBaseEntity > m_hEntity; // 0x8
	float m_flUntilTime; // 0xc
};

// Aligment: 12
// Size: 216
class CInteractionManager
{
public:
	interactions_t m_nActiveInteraction; // 0x8
	matrix3x4_t m_matHoldTransform; // 0xc
	CHandle< CBaseAnimating > m_hSelf; // 0x3c
	CHandle< CBasePlayer > m_hPlayer; // 0x40
	CHandle< CBaseAnimating > m_hInteractionTarget; // 0x44
	matrix3x4_t m_mInteractionTransformInit; // 0x48
	matrix3x4_t m_mInteractionTransformTarget; // 0x78
	float m_flInteractionLerp; // 0xa8
	bool[8] m_bSelfInteractionRequirementMet; // 0xac
	bool[8] m_bInteractionsDisabled; // 0xb4
	bool m_bAllInteractionsDisabled; // 0xbc
	CUtlVector< prevent_interaction_t > m_vecPreventionEntities; // 0xc0
};

// Aligment: 15
// Size: 224
class CVRHandAttachmentInput
{
public:
	uint64_t m_nButtons; // 0x0
	uint64_t m_afButtonPressed; // 0x8
	uint64_t m_afButtonReleased; // 0x10
	float m_flTriggerAnalogValue; // 0x18
	float m_flGripAnalogValue; // 0x1c
	float m_flFinger0; // 0x20
	float m_flFinger1; // 0x24
	float m_flFinger2; // 0x28
	float m_flFinger3; // 0x2c
	float m_flFinger4; // 0x30
	float m_flTrackpadAnalogValueX; // 0x34
	float m_flTrackpadAnalogValueY; // 0x38
	float m_flJoystickAnalogValueX; // 0x3c
	float m_flJoystickAnalogValueY; // 0x40
	CPropVRHand* m_pHand; // 0xd8
};

// Aligment: 4
// Size: 1736
class CBaseVRHandAttachment : public CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnAttachedToHand; // 0x670
	CEntityIOOutput m_OnDetachedFromHand; // 0x698
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPropVRHand > m_hAttachedHand; // 0x6c0
	// MNetworkEnable
	// MNetworkEnable
	bool m_bIsAttached; // 0x6c4
};

// Aligment: 0
// Size: 1736
class CVRHandModelOverride : public CBaseVRHandAttachment, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 40
// Size: 1256
class CPointValueRemapper : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDisabled; // 0x350
	// MNetworkEnable
	// MNetworkEnable
	bool m_bUpdateOnClient; // 0x351
	// MNetworkEnable
	// MNetworkEnable
	ValueRemapperInputType_t m_nInputType; // 0x354
	CUtlSymbolLarge m_iszRemapLineStartName; // 0x358
	CUtlSymbolLarge m_iszRemapLineEndName; // 0x360
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hRemapLineStart; // 0x368
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hRemapLineEnd; // 0x36c
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaximumChangePerSecond; // 0x370
	// MNetworkEnable
	// MNetworkEnable
	float m_flDisengageDistance; // 0x374
	// MNetworkEnable
	// MNetworkEnable
	float m_flEngageDistance; // 0x378
	// MNetworkEnable
	// MNetworkEnable
	bool m_bRequiresUseKey; // 0x37c
	// MNetworkEnable
	// MNetworkEnable
	ValueRemapperOutputType_t m_nOutputType; // 0x380
	CUtlSymbolLarge m_iszOutputEntityName; // 0x388
	CUtlSymbolLarge m_iszOutputEntity2Name; // 0x390
	CUtlSymbolLarge m_iszOutputEntity3Name; // 0x398
	CUtlSymbolLarge m_iszOutputEntity4Name; // 0x3a0
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< CBaseEntity > > m_hOutputEntities; // 0x3a8
	// MNetworkEnable
	// MNetworkEnable
	ValueRemapperHapticsType_t m_nHapticsType; // 0x3c0
	// MNetworkEnable
	// MNetworkEnable
	ValueRemapperMomentumType_t m_nMomentumType; // 0x3c4
	// MNetworkEnable
	// MNetworkEnable
	float m_flMomentumModifier; // 0x3c8
	// MNetworkEnable
	// MNetworkEnable
	float m_flSnapValue; // 0x3cc
	float m_flCurrentMomentum; // 0x3d0
	// MNetworkEnable
	// MNetworkEnable
	ValueRemapperRatchetType_t m_nRatchetType; // 0x3d4
	float m_flRatchetOffset; // 0x3d8
	// MNetworkEnable
	// MNetworkEnable
	float m_flInputOffset; // 0x3dc
	bool m_bEngaged; // 0x3e0
	bool m_bFirstUpdate; // 0x3e1
	float m_flPreviousValue; // 0x3e4
	float m_flPreviousUpdateTickTime; // 0x3e8
	float m_flCustomOutputValue; // 0x3ec
	CUtlSymbolLarge m_iszSoundEngage; // 0x3f0
	CUtlSymbolLarge m_iszSoundDisengage; // 0x3f8
	CUtlSymbolLarge m_iszSoundReachedValueZero; // 0x400
	CUtlSymbolLarge m_iszSoundReachedValueOne; // 0x408
	CUtlSymbolLarge m_iszSoundMovingLoop; // 0x410
	CEntityIOOutput m_OnReachedValueZero; // 0x420
	CEntityIOOutput m_OnReachedValueOne; // 0x448
	CEntityIOOutput m_OnReachedValueCustom; // 0x470
	CEntityIOOutput m_OnEngage; // 0x498
	CEntityIOOutput m_OnDisengage; // 0x4c0
};

// Aligment: 3
// Size: 864
class CRagdollManager : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "6"
	int8_t m_iCurrentMaxRagdollCount; // 0x350
	int32_t m_iMaxRagdollCount; // 0x354
	bool m_bSaveImportant; // 0x358
};

// Aligment: 21
// Size: 1440
class CRopeKeyframe : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_RopeFlags; // 0x550
	CUtlSymbolLarge m_iNextLinkName; // 0x558
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "12"
	int16_t m_Slack; // 0x560
	// MNetworkEnable
	// MNetworkEnable
	float m_Width; // 0x564
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkMinValue "0.1"
	// MNetworkMaxValue "10"
	float m_TextureScale; // 0x568
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "4"
	uint8_t m_nSegments; // 0x56c
	// MNetworkEnable
	// MNetworkEnable
	bool m_bConstrainBetweenEndpoints; // 0x56d
	CUtlSymbolLarge m_strRopeMaterialModel; // 0x570
	// MNetworkEnable
	// MNetworkEnable
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x578
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "4"
	uint8_t m_Subdiv; // 0x580
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint8_t m_nChangeCount; // 0x581
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "15"
	int16_t m_RopeLength; // 0x582
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "4"
	uint8_t m_fLockedPoints; // 0x584
	bool m_bCreatedFromMapFile; // 0x585
	// MNetworkEnable
	// MNetworkEnable
	float m_flScrollSpeed; // 0x588
	bool m_bStartPointValid; // 0x58c
	bool m_bEndPointValid; // 0x58d
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hStartPoint; // 0x590
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hEndPoint; // 0x594
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "5"
	int16_t m_iStartAttachment; // 0x598
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "5"
	int16_t m_iEndAttachment; // 0x59a
};

// Aligment: 0
// Size: 1440
class CRopeKeyframeAlias_move_rope : public CRopeKeyframe, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 81
// Size: 2032
class CSceneEntity : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iszSceneFile; // 0x358
	CUtlSymbolLarge m_iszResumeSceneFile; // 0x360
	CUtlSymbolLarge m_iszTarget1; // 0x368
	CUtlSymbolLarge m_iszTarget2; // 0x370
	CUtlSymbolLarge m_iszTarget3; // 0x378
	CUtlSymbolLarge m_iszTarget4; // 0x380
	CUtlSymbolLarge m_iszTarget5; // 0x388
	CUtlSymbolLarge m_iszTarget6; // 0x390
	CUtlSymbolLarge m_iszTarget7; // 0x398
	CUtlSymbolLarge m_iszTarget8; // 0x3a0
	CHandle< CBaseEntity > m_hTarget1; // 0x3a8
	CHandle< CBaseEntity > m_hTarget2; // 0x3ac
	CHandle< CBaseEntity > m_hTarget3; // 0x3b0
	CHandle< CBaseEntity > m_hTarget4; // 0x3b4
	CHandle< CBaseEntity > m_hTarget5; // 0x3b8
	CHandle< CBaseEntity > m_hTarget6; // 0x3bc
	CHandle< CBaseEntity > m_hTarget7; // 0x3c0
	CHandle< CBaseEntity > m_hTarget8; // 0x3c4
	// MNetworkEnable
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x3c8
	// MNetworkEnable
	// MNetworkEnable
	bool m_bPaused; // 0x3c9
	// MNetworkEnable
	// MNetworkEnable
	bool m_bMultiplayer; // 0x3ca
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAutogenerated; // 0x3cb
	// MNetworkEnable
	// MNetworkEnable
	float m_flForceClientTime; // 0x3cc
	float m_flCurrentTime; // 0x3d0
	float m_flFrameTime; // 0x3d4
	bool m_bCancelAtNextInterrupt; // 0x3d8
	float m_fPitch; // 0x3dc
	bool m_bAutomated; // 0x3e0
	int32_t m_nAutomatedAction; // 0x3e4
	float m_flAutomationDelay; // 0x3e8
	float m_flAutomationTime; // 0x3ec
	CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x3f0
	bool m_bWaitingForResumeScene; // 0x3f4
	bool m_bPausedViaInput; // 0x3f5
	bool m_bPauseAtNextInterrupt; // 0x3f6
	bool m_bWaitingForActor; // 0x3f7
	bool m_bWaitingForInterrupt; // 0x3f8
	bool m_bInterruptedActorsScenes; // 0x3f9
	bool m_bBreakOnNonIdle; // 0x3fa
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< CBaseFlex > > m_hActorList; // 0x400
	CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x418
	int32_t m_nSceneFlushCounter; // 0x438
	// MNetworkEnable
	// MNetworkEnable
	uint16_t m_nSceneStringIndex; // 0x43c
	CEntityIOOutput m_OnStart; // 0x440
	CEntityIOOutput m_OnCompletion; // 0x468
	CEntityIOOutput m_OnCanceled; // 0x490
	CEntityIOOutput m_OnPaused; // 0x4b8
	CEntityIOOutput m_OnResumed; // 0x4e0
	CEntityIOOutput m_OnTrigger1; // 0x508
	CEntityIOOutput m_OnTrigger2; // 0x530
	CEntityIOOutput m_OnTrigger3; // 0x558
	CEntityIOOutput m_OnTrigger4; // 0x580
	CEntityIOOutput m_OnTrigger5; // 0x5a8
	CEntityIOOutput m_OnTrigger6; // 0x5d0
	CEntityIOOutput m_OnTrigger7; // 0x5f8
	CEntityIOOutput m_OnTrigger8; // 0x620
	CEntityIOOutput m_OnTrigger9; // 0x648
	CEntityIOOutput m_OnTrigger10; // 0x670
	CEntityIOOutput m_OnTrigger11; // 0x698
	CEntityIOOutput m_OnTrigger12; // 0x6c0
	CEntityIOOutput m_OnTrigger13; // 0x6e8
	CEntityIOOutput m_OnTrigger14; // 0x710
	CEntityIOOutput m_OnTrigger15; // 0x738
	CEntityIOOutput m_OnTrigger16; // 0x760
	CHandle< CSceneEntity > m_hInterruptScene; // 0x788
	int32_t m_nInterruptCount; // 0x78c
	bool m_bSceneMissing; // 0x790
	bool m_bInterrupted; // 0x791
	bool m_bCompletedEarly; // 0x792
	bool m_bInterruptSceneFinished; // 0x793
	bool m_bRestoring; // 0x794
	bool m_bGenerated; // 0x795
	CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x798
	CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x7b0
	CUtlSymbolLarge m_iszSoundName; // 0x7c8
	CHandle< CBaseFlex > m_hActor; // 0x7d0
	CHandle< CBaseEntity > m_hActivator; // 0x7d4
	CHandle< CBaseEntity > m_hCamera; // 0x7d8
	int32_t m_BusyActor; // 0x7dc
	int32_t m_iPlayerDeathBehavior; // 0x7e0
	CRecipientFilter* m_pRecipientFilter; // 0x7e8
public:
	static int32_t &Get_s_nSceneFlushCounter() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CSceneEntity")->m_static_fiels[0]->m_instance); }
};

// Aligment: 0
// Size: 2032
class CSceneEntityAlias_logic_choreographed_scene : public CSceneEntity, CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 6
// Size: 2312
class CInstancedSceneEntity : public CSceneEntity, CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CHandle< CBaseEntity > m_hOwner; // 0x7f0
	bool m_bHadOwner; // 0x7f4
	float m_flPostSpeakDelay; // 0x7f8
	float m_flPreDelay; // 0x7fc
	char[260] m_szInstanceFilename; // 0x800
	bool m_bIsBackground; // 0x904
};

// Aligment: 3
// Size: 1064
class CSceneListManager : public CLogicalEntity, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x350
	CUtlSymbolLarge[16] m_iszScenes; // 0x368
	CHandle< CBaseEntity >[16] m_hScenes; // 0x3e8
};

// Aligment: 5
// Size: 872
class CShadowControl : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	Vector m_shadowDirection; // 0x350
	// MNetworkEnable
	// MNetworkEnable
	Color m_shadowColor; // 0x35c
	// MNetworkEnable
	// MNetworkEnable
	float m_flShadowMaxDist; // 0x360
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDisableShadows; // 0x364
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnableLocalLightShadows; // 0x365
};

// Aligment: 8
// Size: 920
class CSoundOpvarSetEntity : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iszStackName; // 0x358
	CUtlSymbolLarge m_iszOperatorName; // 0x360
	CUtlSymbolLarge m_iszOpvarName; // 0x368
	int32_t m_nOpvarType; // 0x370
	int32_t m_nOpvarIndex; // 0x374
	float m_flOpvarValue; // 0x378
	CUtlSymbolLarge m_OpvarValueString; // 0x380
	bool m_bSetOnSpawn; // 0x388
};

// Aligment: 19
// Size: 1040
class CSoundOpvarSetPointEntity : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnEnter; // 0x350
	CEntityIOOutput m_OnExit; // 0x378
	float m_flDistanceMin; // 0x3a0
	float m_flDistanceMax; // 0x3a4
	float m_flValSetOnDisable; // 0x3a8
	bool m_bSetValueOnDisable; // 0x3ac
	bool m_bDisabled; // 0x3ad
	bool m_bAutoDisable; // 0x3ae
	CEntityHandle m_hSource; // 0x3c8
	CUtlSymbolLarge m_iszStackName; // 0x3d8
	CUtlSymbolLarge m_iszOperatorName; // 0x3e0
	CUtlSymbolLarge m_iszOpvarName; // 0x3e8
	CUtlSymbolLarge m_iszSourceEntityName; // 0x3f0
	int32_t m_iOpvarIndex; // 0x3f8
	float m_flDistanceMapMin; // 0x3fc
	float m_flDistanceMapMax; // 0x400
	float m_flOcclusionRadius; // 0x404
	float m_flOcclusionMin; // 0x408
	float m_flOcclusionMax; // 0x40c
};

// Aligment: 9
// Size: 1144
class CSoundOpvarSetAABBEntity : public CSoundOpvarSetPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vDistanceInnerMins; // 0x410
	Vector m_vDistanceInnerMaxs; // 0x41c
	Vector m_vDistanceOuterMins; // 0x428
	Vector m_vDistanceOuterMaxs; // 0x434
	int32_t m_nAABBDirection; // 0x440
	Vector m_vInnerMins; // 0x444
	Vector m_vInnerMaxs; // 0x450
	Vector m_vOuterMins; // 0x45c
	Vector m_vOuterMaxs; // 0x468
};

// Aligment: 0
// Size: 1144
class CSoundOpvarSetOBBEntity : public CSoundOpvarSetAABBEntity, CSoundOpvarSetPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 6
// Size: 880
class CAISound : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_iSoundType; // 0x350
	int32_t m_iSoundContext; // 0x354
	int32_t m_iVolume; // 0x358
	int32_t m_iSoundIndex; // 0x35c
	float m_flDuration; // 0x360
	CUtlSymbolLarge m_iszProxyEntityName; // 0x368
};

// Aligment: 4
// Size: 16
class CSoundEnvelope
{
public:
	float m_current; // 0x0
	float m_target; // 0x4
	float m_rate; // 0x8
	bool m_forceupdate; // 0xc
};

// Aligment: 2
// Size: 40
class CCopyRecipientFilter : public IRecipientFilter
{
public:
	int32_t m_Flags; // 0x8
	CUtlVector< CEntityIndex > m_Recipients; // 0x10
};

// Aligment: 15
// Size: 160
class CSoundPatch
{
public:
	CSoundEnvelope m_pitch; // 0x8
	CSoundEnvelope m_volume; // 0x18
	float m_shutdownTime; // 0x30
	float m_flLastTime; // 0x34
	CUtlSymbolLarge m_iszSoundScriptName; // 0x38
	CHandle< CBaseEntity > m_hEnt; // 0x40
	int32_t m_entityChannel; // 0x44
	CEntityIndex m_soundEntityIndex; // 0x48
	Vector m_soundOrigin; // 0x4c
	int32_t m_flags; // 0x58
	int32_t m_baseFlags; // 0x5c
	int32_t m_isPlaying; // 0x60
	CCopyRecipientFilter m_Filter; // 0x68
	float m_flCloseCaptionDuration; // 0x90
	CUtlSymbolLarge m_iszClassName; // 0x98
public:
	static int32_t &Get_g_SoundPatchCount() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CSoundPatch")->m_static_fiels[0]->m_instance); }
};

// Aligment: 6
// Size: 928
class CSoundEventEntity : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bStartOnSpawn; // 0x350
	bool m_bToLocalPlayer; // 0x351
	CUtlSymbolLarge m_iszSoundName; // 0x358
	CUtlSymbolLarge m_iszSourceEntityName; // 0x360
	CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x368
	CEntityHandle m_hSource; // 0x398
};

// Aligment: 0
// Size: 928
class CSoundEventEntityAlias_snd_event_point : public CSoundEventEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 2
// Size: 952
class CSoundEventAABBEntity : public CSoundEventEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vMins; // 0x3a0
	Vector m_vMaxs; // 0x3ac
};

// Aligment: 2
// Size: 872
class CSoundEventParameter : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iszParamName; // 0x358
	float m_flFloatValue; // 0x360
};

// Aligment: 8
// Size: 984
class CEnvSoundscape : public CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnPlay; // 0x350
	float m_flRadius; // 0x378
	CUtlSymbolLarge m_soundscapeName; // 0x380
	int32_t m_soundscapeIndex; // 0x388
	int32_t m_soundscapeEntityListId; // 0x38c
	CUtlSymbolLarge[8] m_positionNames; // 0x390
	CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x3d0
	bool m_bDisabled; // 0x3d4
};

// Aligment: 1
// Size: 992
class CEnvSoundscapeProxy : public CEnvSoundscape, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_MainSoundscapeName; // 0x3d8
};

// Aligment: 0
// Size: 992
class CEnvSoundscapeProxyAlias_snd_soundscape_proxy : public CEnvSoundscapeProxy, CEnvSoundscape, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 0
// Size: 984
class CEnvSoundscapeAlias_snd_soundscape : public CEnvSoundscape, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 0
// Size: 984
class CEnvSoundscapeTriggerable : public CEnvSoundscape, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 0
// Size: 984
class CEnvSoundscapeTriggerableAlias_snd_soundscape_triggerable : public CEnvSoundscapeTriggerable, CEnvSoundscape, CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 3
// Size: 1816
class CTriggerSoundscape : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CHandle< CEnvSoundscapeTriggerable > m_hSoundscape; // 0x6f0
	CUtlSymbolLarge m_SoundscapeName; // 0x6f8
	CUtlVector< CHandle< CBasePlayer > > m_spectators; // 0x700
};

// Aligment: 0
// Size: 1464
class CSpriteAlias_env_glow : public CSprite, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 11
// Size: 1960
class CPointWorldText : public CModelPointEntity, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	char[512] m_messageText; // 0x548
	// MNetworkEnable
	// MNetworkEnable
	char[64] m_FontName; // 0x748
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnabled; // 0x788
	// MNetworkEnable
	// MNetworkEnable
	bool m_bFullbright; // 0x789
	// MNetworkEnable
	// MNetworkEnable
	float m_flWorldUnitsPerPx; // 0x78c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFontSize; // 0x790
	// MNetworkEnable
	// MNetworkEnable
	float m_flDepthOffset; // 0x794
	// MNetworkEnable
	// MNetworkEnable
	Color m_Color; // 0x798
	// MNetworkEnable
	// MNetworkEnable
	PointWorldTextJustifyHorizontal_t m_nJustifyHorizontal; // 0x79c
	// MNetworkEnable
	// MNetworkEnable
	PointWorldTextJustifyVertical_t m_nJustifyVertical; // 0x7a0
	// MNetworkEnable
	// MNetworkEnable
	PointWorldTextReorientMode_t m_nReorientMode; // 0x7a4
};

// Aligment: 0
// Size: 848
class CNullEntity : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 856
class CBaseDMStart : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_Master; // 0x350
};

// Aligment: 0
// Size: 848
class CInfoLandmark : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 1816
class CTriggerRemove : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnRemove; // 0x6f0
};

// Aligment: 14
// Size: 1936
class CTriggerHurt : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_flOriginalDamage; // 0x6f0
	float m_flDamage; // 0x6f4
	float m_flDamageCap; // 0x6f8
	float m_flLastDmgTime; // 0x6fc
	float m_flDmgResetTime; // 0x700
	int32_t m_bitsDamageInflict; // 0x704
	int32_t m_damageModel; // 0x708
	bool m_bNoDmgForce; // 0x70c
	Vector m_vDamageForce; // 0x710
	bool m_thinkAlways; // 0x71c
	float m_hurtThinkPeriod; // 0x720
	CEntityIOOutput m_OnHurt; // 0x728
	CEntityIOOutput m_OnHurtPlayer; // 0x750
	CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x778
};

// Aligment: 1
// Size: 1952
class CScriptTriggerHurt : public CTriggerHurt, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vExtent; // 0x790
};

// Aligment: 1
// Size: 1816
class CTriggerMultiple : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnTrigger; // 0x6f0
};

// Aligment: 1
// Size: 1832
class CScriptTriggerMultiple : public CTriggerMultiple, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vExtent; // 0x718
};

// Aligment: 0
// Size: 1816
class CTriggerOnce : public CTriggerMultiple, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 1832
class CScriptTriggerOnce : public CTriggerOnce, CTriggerMultiple, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vExtent; // 0x718
};

// Aligment: 15
// Size: 1976
class CTriggerLook : public CTriggerOnce, CTriggerMultiple, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CHandle< CBaseEntity > m_hLookTarget; // 0x718
	float m_flFieldOfView; // 0x71c
	float m_flLookTime; // 0x720
	float m_flLookTimeTotal; // 0x724
	float m_flLookTimeLast; // 0x728
	float m_flTimeoutDuration; // 0x72c
	bool m_bTimeoutFired; // 0x730
	bool m_bIsLooking; // 0x731
	bool m_b2DFOV; // 0x732
	bool m_bUseVelocity; // 0x733
	CHandle< CBaseEntity > m_hActivator; // 0x734
	// MNetworkEnable
	// MNetworkEnable
	bool m_bTestOcclusion; // 0x738
	CEntityIOOutput m_OnTimeout; // 0x740
	CEntityIOOutput m_OnStartLook; // 0x768
	CEntityIOOutput m_OnEndLook; // 0x790
};

// Aligment: 0
// Size: 1352
class CTriggerVolume : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 6
// Size: 1840
class CChangeLevel : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlString m_sMapName; // 0x6f0
	CUtlString m_sLandmarkName; // 0x6f8
	CEntityIOOutput m_OnChangeLevel; // 0x700
	bool m_bTouched; // 0x728
	bool m_bNoTouch; // 0x729
	bool m_bNewChapter; // 0x72a
};

// Aligment: 5
// Size: 1800
class CTriggerPush : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vecPushDir; // 0x6f0
	bool m_bPushDirIsLocal; // 0x6fc
	bool m_bTriggerOnStartTouch; // 0x6fd
	float m_flAlternateTicksFix; // 0x700
	float m_flPushSpeed; // 0x704
};

// Aligment: 1
// Size: 1816
class CScriptTriggerPush : public CTriggerPush, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vExtent; // 0x708
};

// Aligment: 1
// Size: 1784
class CTriggerTeleport : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iLandmark; // 0x6f0
};

// Aligment: 0
// Size: 848
class CInfoTeleportDestination : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 1784
class CTriggerToggleSave : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bDisabled; // 0x6f0
};

// Aligment: 3
// Size: 1792
class CTriggerSave : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bForceNewLevelUnit; // 0x6f0
	float m_fDangerousTimer; // 0x6f4
	int32_t m_minHitPoints; // 0x6f8
};

// Aligment: 0
// Size: 1776
class CTriggerGravity : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 1
// Size: 856
class CAI_ChangeTarget : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iszNewTarget; // 0x350
};

// Aligment: 5
// Size: 880
class CAI_ChangeHintGroup : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_iSearchType; // 0x350
	CUtlSymbolLarge m_strSearchName; // 0x358
	CUtlSymbolLarge m_strNewHintGroup; // 0x360
	float m_flRadius; // 0x368
	bool m_bHintGroupNavLimiting; // 0x36c
};

// Aligment: 5
// Size: 1840
class CTriggerProximity : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CHandle< CBaseEntity > m_hMeasureTarget; // 0x6f0
	CUtlSymbolLarge m_iszMeasureTarget; // 0x6f8
	float m_fRadius; // 0x700
	int32_t m_nTouchers; // 0x704
	CEntityOutputTemplate< float32 > m_NearestEntityDistance; // 0x708
};

// Aligment: 0
// Size: 848
class CLogicProximity : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 4
// Size: 1872
class CTriggerImpact : public CTriggerMultiple, CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_flMagnitude; // 0x718
	float m_flNoise; // 0x71c
	float m_flViewkick; // 0x720
	CEntityOutputTemplate< Vector > m_pOutputForce; // 0x728
};

// Aligment: 0
// Size: 1776
class CTriggerPlayerMovement : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 0
// Size: 1776
class CServerRagdollTrigger : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 2
// Size: 1824
class CTriggerActiveWeaponDetect : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CEntityIOOutput m_OnTouchedActiveWeapon; // 0x6f0
	CUtlSymbolLarge m_iszWeaponClassName; // 0x718
};

// Aligment: 11
// Size: 1824
class CPostProcessingVolume : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CStrongHandle< InfoForResourceTypeCPostProcessingResource > m_hPostSettings; // 0x6f0
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeDuration; // 0x6f8
	// MNetworkEnable
	// MNetworkEnable
	float m_flMinLogExposure; // 0x6fc
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxLogExposure; // 0x700
	// MNetworkEnable
	// MNetworkEnable
	float m_flMinExposure; // 0x704
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxExposure; // 0x708
	// MNetworkEnable
	// MNetworkEnable
	float m_flExposureCompensation; // 0x70c
	// MNetworkEnable
	// MNetworkEnable
	float m_flExposureFadeSpeedUp; // 0x710
	// MNetworkEnable
	// MNetworkEnable
	float m_flExposureFadeSpeedDown; // 0x714
	// MNetworkEnable
	// MNetworkEnable
	bool m_bMaster; // 0x718
	// MNetworkEnable
	// MNetworkEnable
	bool m_bExposureControl; // 0x719
};

// Aligment: 12
// Size: 1864
class CTriggerPhysics : public CBaseTrigger, CBaseToggle, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_gravityScale; // 0x700
	float m_linearLimit; // 0x704
	float m_linearDamping; // 0x708
	float m_angularLimit; // 0x70c
	float m_angularDamping; // 0x710
	float m_linearForce; // 0x714
	float m_flFrequency; // 0x718
	float m_flDampingRatio; // 0x71c
	Vector m_vecLinearForcePointAt; // 0x720
	bool m_bCollapseToForcePoint; // 0x72c
	Vector m_vecLinearForcePointAtWorld; // 0x730
	Vector m_vecLinearForceDirection; // 0x73c
};

// Aligment: 5
// Size: 1400
class CFuncNavBlocker : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_CachedMins; // 0x548
	Vector m_CachedMaxs; // 0x554
	bool[2] m_isBlockingNav; // 0x568
	int32_t m_blockedTeamNumber; // 0x56c
	bool m_bAffectsFlow; // 0x570
};

// Aligment: 1
// Size: 1416
class CScriptNavBlocker : public CFuncNavBlocker, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	Vector m_vExtent; // 0x578
};

// Aligment: 1
// Size: 1368
class CFuncNavObstruction : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bDisabled; // 0x550
};

// Aligment: 25
// Size: 100
struct dynpitchvol_base_t
{
public:
	int32_t preset; // 0x0
	int32_t pitchrun; // 0x4
	int32_t pitchstart; // 0x8
	int32_t spinup; // 0xc
	int32_t spindown; // 0x10
	int32_t volrun; // 0x14
	int32_t volstart; // 0x18
	int32_t fadein; // 0x1c
	int32_t fadeout; // 0x20
	int32_t lfotype; // 0x24
	int32_t lforate; // 0x28
	int32_t lfomodpitch; // 0x2c
	int32_t lfomodvol; // 0x30
	int32_t cspinup; // 0x34
	int32_t cspincount; // 0x38
	int32_t pitch; // 0x3c
	int32_t spinupsav; // 0x40
	int32_t spindownsav; // 0x44
	int32_t pitchfrac; // 0x48
	int32_t vol; // 0x4c
	int32_t fadeinsav; // 0x50
	int32_t fadeoutsav; // 0x54
	int32_t volfrac; // 0x58
	int32_t lfofrac; // 0x5c
	int32_t lfomult; // 0x60
};

// Aligment: 0
// Size: 100
struct dynpitchvol_t : public dynpitchvol_base_t
{
public:
// <no members described>
};

// Aligment: 10
// Size: 1000
class CAmbientGeneric : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_radius; // 0x350
	float m_flMaxRadius; // 0x354
	soundlevel_t m_iSoundLevel; // 0x358
	dynpitchvol_t m_dpv; // 0x35c
	bool m_fActive; // 0x3c0
	bool m_fLooping; // 0x3c1
	CUtlSymbolLarge m_iszSound; // 0x3c8
	CUtlSymbolLarge m_sSourceEntName; // 0x3d0
	CHandle< CBaseEntity > m_hSoundSource; // 0x3d8
	CEntityIndex m_nSoundSourceEntIndex; // 0x3dc
};

// Aligment: 5
// Size: 20
struct Relationship_t
{
public:
	CHandle< CBaseEntity > entity; // 0x0
	Class_T classType; // 0x4
	int32_t faction; // 0x8
	Disposition_t disposition; // 0xc
	int32_t priority; // 0x10
};

// Aligment: 2
// Size: 24
class CBaseCombatCharacter::DamageHistory
{
public:
	int32_t team; // 0x0
	IntervalTimer interval; // 0x8
};

// Aligment: 34
// Size: 2336
class CBaseCombatCharacter : public CBaseFlex, CBaseAnimatingOverlay, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bForceServerRagdoll; // 0x708
	bool m_bPreventWeaponPickup; // 0x709
	bool m_bApplyStressDamage; // 0x70a
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkSendProxyRecipientsFilter
	float m_flNextAttack; // 0x70c
	Hull_t m_eHull; // 0x710
	uint32_t m_navHullCategory; // 0x714
	float m_flNavHullRadius; // 0x718
	float m_flNavHullHeight; // 0x71c
	int32_t m_bloodColor; // 0x720
	// MNetworkEnable
	float m_flFieldOfView; // 0x724
	Vector m_HackedGunPos; // 0x728
	CUtlSymbolLarge m_RelationshipString; // 0x738
	float m_impactEnergyScale; // 0x740
	int32_t m_LastHitGroup; // 0x744
	float m_flDamageAccumulator; // 0x748
	int32_t m_iDamageCount; // 0x74c
	WeaponProficiency_t m_CurrentWeaponProficiency; // 0x750
	CUtlVector< Relationship_t > m_Relationship; // 0x758
	int32_t m_nFaction; // 0x770
	CUtlVector< CHandle< CBaseEntity > > m_hTriggerFogList; // 0x778
	CHandle< CBaseEntity > m_hLastFogTrigger; // 0x790
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32[32] m_iAmmo; // 0x794
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< CBaseCombatWeapon > > m_hMyWeapons; // 0x818
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseCombatWeapon > m_hActiveWeapon; // 0x830
	IntervalTimer m_aliveTimer; // 0x838
	uint32_t m_hasBeenInjured; // 0x848
	CBaseCombatCharacter::DamageHistory[4] m_damageHistory; // 0x850
	CAI_MoveMonitor m_NavAreaUpdateMonitor; // 0x8d0
	int32_t m_registeredNavTeam; // 0x8e0
	int32_t m_navMeshID; // 0x8e4
	CountdownTimer m_footstepTimer; // 0x8e8
	int32_t m_spawnID; // 0x8f8
	Vector m_vecSpawnOrigin; // 0x8fc
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< CEconWearable > > m_hMyWearables; // 0x908
public:
	static int32_t &Get_m_lastInteraction() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseCombatCharacter")->m_static_fiels[0]->m_instance); }
	static Relationship_t** &Get_m_DefaultRelationship() { return *reinterpret_cast<Relationship_t***>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseCombatCharacter")->m_static_fiels[1]->m_instance); }
	static Relationship_t** &Get_m_FactionRelationship() { return *reinterpret_cast<Relationship_t***>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseCombatCharacter")->m_static_fiels[2]->m_instance); }
	static CUtlVector< CUtlVector< CHandle< CBaseEntity > > > &Get_m_aFactions() { return *reinterpret_cast<CUtlVector< CUtlVector< CHandle< CBaseEntity > > >*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseCombatCharacter")->m_static_fiels[3]->m_instance); }
	static int32_t &Get_m_nextSpawnID() { return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseCombatCharacter")->m_static_fiels[4]->m_instance); }
};

// Aligment: 3
// Size: 24
struct ResponseContext_t
{
public:
	CUtlSymbolLarge m_iszName; // 0x0
	CUtlSymbolLarge m_iszValue; // 0x8
	float m_fExpirationTime; // 0x10
};

// Aligment: 0
// Size: 848
class CServerOnlyPointEntity : public CServerOnlyEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 166
// Size: 4976
class CBasePlayer : public CBaseCombatCharacter, CBaseFlex, CBaseAnimatingOverlay, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_StuckLast; // 0x920
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkSendProxyRecipientsFilter
	CPlayerLocalData m_Local; // 0x928
	// MNetworkEnable
	// MNetworkEnable
	fogplayerparams_t m_PlayerFog; // 0xb38
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPostProcessController > m_hPostProcessCtrl; // 0xb90
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0xb94
	CUtlVector< CHandle< CBaseEntity > > m_hTriggerSoundscapeList; // 0xb98
	CPlayerState m_pl; // 0xbb0
	uint64_t m_nButtons; // 0xbf8
	uint64_t m_afButtonPressed; // 0xc00
	uint64_t m_afButtonReleased; // 0xc08
	uint64_t m_afButtonLast; // 0xc10
	uint64_t m_afButtonDisabled; // 0xc18
	uint64_t m_afButtonForced; // 0xc20
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_fOnTarget; // 0xc28
	char[32] m_szAnimExtension; // 0xc29
	int32_t m_nUpdateRate; // 0xc4c
	float m_fLerpTime; // 0xc50
	bool m_bLagCompensation; // 0xc54
	bool m_bPredictWeapons; // 0xc55
	int32_t m_Activity; // 0xc58
	Vector m_vecAdditionalPVSOrigin; // 0xc5c
	Vector m_vecCameraPVSOrigin; // 0xc68
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	CHandle< CBaseEntity > m_hUseEntity; // 0xc74
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hHeldEntity; // 0xc78
	float m_flPreventUseTime; // 0xc7c
	int32_t m_iTrain; // 0xc80
	float m_iRespawnFrames; // 0xc84
	uint32_t m_afPhysicsFlags; // 0xc88
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	CHandle< CBaseEntity > m_hVehicle; // 0xc8c
	int32_t m_iVehicleAnalogBias; // 0xc90
	bool m_bPauseBonusProgress; // 0xc94
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "15"
	int32_t m_iBonusProgress; // 0xc98
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "4"
	int32_t m_iBonusChallenge; // 0xc9c
	int32_t m_lastDamageAmount; // 0xca0
	float m_fTimeLastHurt; // 0xca4
	Vector m_DmgOrigin; // 0xca8
	float m_DmgTake; // 0xcb4
	float m_DmgSave; // 0xcb8
	int32_t m_bitsDamageType; // 0xcbc
	int32_t m_bitsHUDDamage; // 0xcc0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flDeathTime; // 0xcc4
	float m_flDeathAnimTime; // 0xcc8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	uint8_t m_iObserverMode; // 0xccc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint32_t m_iFOV; // 0xcd0
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint32_t m_iDefaultFOV; // 0xcd4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint32_t m_iFOVStart; // 0xcd8
	// MNetworkEnable
	// MNetworkEnable
	float m_flFOVTime; // 0xcdc
	int32_t m_iObserverLastMode; // 0xce0
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hObserverTarget; // 0xce4
	bool m_bForcedObserverMode; // 0xce8
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hZoomOwner; // 0xcec
	float m_tbdPrev; // 0xcf0
	int32_t m_idrowndmg; // 0xcf4
	int32_t m_idrownrestored; // 0xcf8
	int32_t m_nPoisonDmg; // 0xcfc
	int32_t m_nPoisonRestored; // 0xd00
	uint8[8] m_rgbTimeBasedDamage; // 0xd04
	int32_t m_vphysicsCollisionState; // 0xd0c
	float m_fNextSuicideTime; // 0xd10
	int32_t m_iSuicideCustomKillFlags; // 0xd14
	float m_fDelay; // 0xd18
	float m_fReplayEnd; // 0xd1c
	CEntityIndex m_iReplayEntity; // 0xd20
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	CHandle< CBaseEntity > m_hTonemapController; // 0xd24
	int32_t m_nHighestCommandNumberReceived; // 0xd58
	IPhysicsPlayerController* m_pPhysicsController; // 0xd60
	Vector m_oldOrigin; // 0xd78
	Vector m_vecSmoothedVelocity; // 0xd84
	bool m_touchedPhysObject; // 0xd90
	bool m_bPhysicsWasFrozen; // 0xd91
	int32_t m_iPlayerSound; // 0xd94
	int32_t m_iTargetVolume; // 0xd98
	int32[5] m_rgItems; // 0xd9c
	IntervalTimer m_lastHeldVoteTimer; // 0xdb0
	float m_flgeigerRange; // 0xdc0
	float m_flgeigerDelay; // 0xdc4
	int32_t m_igeigerRangePrev; // 0xdc8
	bool m_fInitHUD; // 0xdcc
	bool m_fGameHUDInitialized; // 0xdcd
	bool m_fWeapon; // 0xdce
	int32_t m_iUpdateTime; // 0xdd0
	int32_t m_iFrags; // 0xdd4
	int32_t m_iDeaths; // 0xdd8
	float m_flNextDecalTime; // 0xddc
	float m_flNextTauntTime; // 0xde0
	PlayerConnectedState m_iConnected; // 0xde4
	bool m_bIsLowViolence; // 0xde8
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_ArmorValue; // 0xdec
	float m_AirFinished; // 0xdf0
	float m_PainFinished; // 0xdf4
	int32_t m_iPlayerLocked; // 0xdf8
	CSimpleSimTimer m_AutoaimTimer; // 0xdfc
	QAngle m_vecAutoAim; // 0xe00
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseViewModel >[2] m_hViewModel; // 0xe0c
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPropHMDAvatar > m_hPropHMDAvatar; // 0xe14
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CPointHMDAnchor > m_hPointHMDAnchor; // 0xe18
	Vector m_vecLastAnchorPosition; // 0xe20
	bool m_bReceivedInitialAnchorPos; // 0xe2c
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_VRControllerType; // 0xe30
	IntervalTimer m_timeSinceCommandSimulated; // 0x1168
	float m_flStepSoundTime; // 0x1178
	bool m_bAllowInstantSpawn; // 0x117c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "2048"
	// MNetworkEncodeFlags
	float m_flMaxspeed; // 0x1180
	// MNetworkEnable
	// MNetworkEnable
	CUtlStringToken m_ladderSurfaceProps; // 0x1184
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_vecLadderNormal; // 0x1188
	float m_flWaterJumpTime; // 0x1194
	Vector m_vecWaterJumpVel; // 0x1198
	int32_t m_nImpulse; // 0x11a4
	float m_flSwimSoundTime; // 0x11a8
	float m_flFlashTime; // 0x11ac
	int32_t m_nDrownDmgRate; // 0x11b0
	int32_t m_nNumCrouches; // 0x11b4
	bool m_bDuckToggled; // 0x11b8
	float m_flForwardMove; // 0x11bc
	float m_flSideMove; // 0x11c0
	int32_t m_nNumCrateHudHints; // 0x11c4
	Vector m_vForcedOrigin; // 0x11c8
	bool m_bForceOrigin; // 0x11d4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32_t m_nTickBase; // 0x11d8
	int32_t m_nOldTickBase; // 0x11dc
	bool m_bGamePaused; // 0x11e0
	float m_fLastPlayerTalkTime; // 0x11e4
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	CHandle< CBaseCombatWeapon > m_hLastWeapon; // 0x11e8
	float m_flOldPlayerZ; // 0x11ec
	float m_flOldPlayerViewOffsetZ; // 0x11f0
	bool m_bPlayerUnderwater; // 0x11f4
	float m_flLastAttackTime; // 0x11f8
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	CHandle< CBaseEntity > m_hViewEntity; // 0x11fc
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	CHandle< CBaseEntity > m_hConstraintEntity; // 0x1200
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	Vector m_vecConstraintCenter; // 0x1204
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flConstraintRadius; // 0x1210
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flConstraintWidth; // 0x1214
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flConstraintSpeedFactor; // 0x1218
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bConstraintPastRadius; // 0x121c
	char[32] m_szNetname; // 0x121d
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flLaggedMovementValue; // 0x1240
	Vector m_vNewVPhysicsPosition; // 0x1244
	Vector m_vNewVPhysicsVelocity; // 0x1250
	Vector m_vecVehicleViewOrigin; // 0x125c
	QAngle m_vecVehicleViewAngles; // 0x1268
	float m_flVehicleViewFOV; // 0x1274
	int32_t m_nVehicleViewSavedFrame; // 0x1278
	Vector m_vecPreviouslyPredictedOrigin; // 0x127c
	int32_t m_nBodyPitchPoseParam; // 0x1288
	// MNetworkEnable
	// MNetworkEnable
	char[18] m_szLastPlaceName; // 0x128c
	char[64] m_szNetworkIDString; // 0x129e
	CPlayerInfo m_PlayerInfo; // 0x12e0
	CUtlStringToken m_surfaceProps; // 0x12f8
	float m_surfaceFriction; // 0x1308
	char m_chTextureType; // 0x130c
	char m_chPreviousTextureType; // 0x130d
	bool m_bSinglePlayerGameEnding; // 0x130e
	CHandle< CBaseEntity > m_hPlayerProxy; // 0x1310
	bool m_bhasHaptics; // 0x1314
	bool m_autoKickDisabled; // 0x1315
	Vector m_movementCollisionNormal; // 0x1318
	Vector m_groundNormal; // 0x1324
	CHandle< CBaseCombatCharacter > m_stuckCharacter; // 0x1330
	float m_lastEntitySteadyState; // 0x1334
	int32_t m_availableEntitySteadyState; // 0x1338
	CBitVec< 64 > m_playerInPVS; // 0x133c
	bool m_hasAnySteadyStateEnts; // 0x1344
	bool m_bSplitScreenPlayer; // 0x1345
	CHandle< CBasePlayer > m_hSplitOwner; // 0x1348
	CUtlVector< CHandle< CBasePlayer > > m_hSplitScreenPlayers; // 0x1350
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint64_t m_nUnHoldableButtons; // 0x1368
public:
	static bool &Get_ms_bUseSessionPersisterPosAng() { return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBasePlayer")->m_static_fiels[0]->m_instance); }
	static Vector &Get_ms_vSessionPersisterPosition() { return *reinterpret_cast<Vector*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBasePlayer")->m_static_fiels[1]->m_instance); }
	static QAngle &Get_ms_angSessionPersisterAngles() { return *reinterpret_cast<QAngle*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBasePlayer")->m_static_fiels[2]->m_instance); }
};

// Aligment: 9
// Size: 5032
class CBaseMultiplayerPlayer : public CBasePlayer, CBaseCombatCharacter, CBaseFlex, CBaseAnimatingOverlay, CBaseAnimating, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_iIgnoreGlobalChat; // 0x1378
	float m_flAreaCaptureScoreAccumulator; // 0x137c
	float m_flCapPointScoreRate; // 0x1380
	int32_t m_iCurrentConcept; // 0x1384
	CMultiplayer_Expresser* m_pExpresser; // 0x1388
	float m_flConnectionTime; // 0x1390
	float m_flLastForcedChangeTeamTime; // 0x1394
	int32_t m_iBalanceScore; // 0x1398
	KeyValues* m_pAchievementKV; // 0x13a0
};

// Aligment: 17
// Size: 1168
class CColorCorrection : public CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeInDuration; // 0x350
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutDuration; // 0x354
	float m_flStartFadeInWeight; // 0x358
	float m_flStartFadeOutWeight; // 0x35c
	float m_flTimeStartFadeIn; // 0x360
	float m_flTimeStartFadeOut; // 0x364
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxWeight; // 0x368
	bool m_bStartDisabled; // 0x36c
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnabled; // 0x36d
	// MNetworkEnable
	// MNetworkEnable
	bool m_bMaster; // 0x36e
	// MNetworkEnable
	// MNetworkEnable
	bool m_bClientSide; // 0x36f
	// MNetworkEnable
	// MNetworkEnable
	bool m_bExclusive; // 0x370
	// MNetworkEnable
	// MNetworkEnable
	float m_MinFalloff; // 0x374
	// MNetworkEnable
	// MNetworkEnable
	float m_MaxFalloff; // 0x378
	// MNetworkEnable
	// MNetworkEnable
	float m_flCurWeight; // 0x37c
	// MNetworkEnable
	// MNetworkEnable
	char[260] m_netlookupFilename; // 0x380
	CUtlSymbolLarge m_lookupFilename; // 0x488
};

// Aligment: 4
// Size: 872
class CRagdollMagnet : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bDisabled; // 0x350
	float m_radius; // 0x354
	float m_force; // 0x358
	Vector m_axis; // 0x35c
};

// Aligment: 0
// Size: 1352
class CEntityBlocker : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
// <no members described>
};

// Aligment: 10
// Size: 1400
class CEntityDissolve : public CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartTime; // 0x548
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeInStart; // 0x54c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeInLength; // 0x550
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutModelStart; // 0x554
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutModelLength; // 0x558
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutStart; // 0x55c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFadeOutLength; // 0x560
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	EntityDisolveType_t m_nDissolveType; // 0x564
	// MNetworkEnable
	// MNetworkEnable
	Vector m_vDissolverOrigin; // 0x568
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "8"
	uint32_t m_nMagnitude; // 0x574
};

// Aligment: 10
// Size: 896
class CEnvDOFController : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	float m_flFocusTargetRange; // 0x350
	CUtlSymbolLarge m_strFocusTargetName; // 0x358
	CHandle< CBaseEntity > m_hFocusTarget; // 0x360
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDOFEnabled; // 0x364
	// MNetworkEnable
	// MNetworkEnable
	float m_flNearBlurDepth; // 0x368
	// MNetworkEnable
	// MNetworkEnable
	float m_flNearFocusDepth; // 0x36c
	// MNetworkEnable
	// MNetworkEnable
	float m_flFarFocusDepth; // 0x370
	// MNetworkEnable
	// MNetworkEnable
	float m_flFarBlurDepth; // 0x374
	// MNetworkEnable
	// MNetworkEnable
	float m_flNearBlurRadius; // 0x378
	// MNetworkEnable
	// MNetworkEnable
	float m_flFarBlurRadius; // 0x37c
};

// Aligment: 5
// Size: 944
class CEnvPlayerSurfaceTrigger : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	int32_t m_iTargetGameMaterial; // 0x350
	int32_t m_iCurrentGameMaterial; // 0x354
	bool m_bDisabled; // 0x358
	CEntityIOOutput m_OnSurfaceChangedToTarget; // 0x360
	CEntityIOOutput m_OnSurfaceChangedFromTarget; // 0x388
};

// Aligment: 30
// Size: 1712
class CEnvProjectedTexture : public CModelPointEntity, CBaseModelEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	// MNetworkEnable
	// MNetworkEnable
	CHandle< CBaseEntity > m_hTargetEntity; // 0x548
	// MNetworkEnable
	// MNetworkEnable
	bool m_bState; // 0x54c
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAlwaysUpdate; // 0x54d
	// MNetworkEnable
	// MNetworkEnable
	float m_flLightFOV; // 0x550
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnableShadows; // 0x554
	// MNetworkEnable
	// MNetworkEnable
	bool m_bSimpleProjection; // 0x555
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightOnlyTarget; // 0x556
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightWorld; // 0x557
	// MNetworkEnable
	// MNetworkEnable
	bool m_bCameraSpace; // 0x558
	// MNetworkEnable
	// MNetworkEnable
	float m_flBrightnessScale; // 0x55c
	// MNetworkEnable
	// MNetworkEnable
	Color m_LightColor; // 0x560
	// MNetworkEnable
	// MNetworkEnable
	float m_flIntensity; // 0x564
	// MNetworkEnable
	// MNetworkEnable
	float m_flLinearAttenuation; // 0x568
	// MNetworkEnable
	// MNetworkEnable
	float m_flQuadraticAttenuation; // 0x56c
	// MNetworkEnable
	// MNetworkEnable
	bool m_bVolumetric; // 0x570
	// MNetworkEnable
	// MNetworkEnable
	float m_flNoiseStrength; // 0x574
	// MNetworkEnable
	// MNetworkEnable
	float m_flFlashlightTime; // 0x578
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_nNumPlanes; // 0x57c
	// MNetworkEnable
	// MNetworkEnable
	float m_flPlaneOffset; // 0x580
	// MNetworkEnable
	// MNetworkEnable
	float m_flVolumetricIntensity; // 0x584
	// MNetworkEnable
	// MNetworkEnable
	float m_flColorTransitionTime; // 0x588
	// MNetworkEnable
	// MNetworkEnable
	float m_flAmbient; // 0x58c
	// MNetworkEnable
	// MNetworkEnable
	char[260] m_SpotlightTextureName; // 0x590
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nSpotlightTextureFrame; // 0x694
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "1"
	uint32_t m_nShadowQuality; // 0x698
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "500"
	// MNetworkEncodeFlags
	float m_flNearZ; // 0x69c
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "18"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1500"
	// MNetworkEncodeFlags
	float m_flFarZ; // 0x6a0
	// MNetworkEnable
	// MNetworkEnable
	float m_flProjectionSize; // 0x6a4
	// MNetworkEnable
	// MNetworkEnable
	float m_flRotation; // 0x6a8
	// MNetworkEnable
	// MNetworkEnable
	bool m_bFlipHorizontal; // 0x6ac
};

// Aligment: 6
// Size: 920
class CMessage : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	CUtlSymbolLarge m_iszMessage; // 0x350
	float m_MessageVolume; // 0x358
	int32_t m_MessageAttenuation; // 0x35c
	float m_Radius; // 0x360
	CUtlSymbolLarge m_sNoise; // 0x368
	CEntityIOOutput m_OnShowMessage; // 0x370
};

// Aligment: 17
// Size: 1296
class CEnvMicrophone : public CPointEntity, CBaseEntity, CGameEntity, CEntityInstance, IHandleEntity
{
public:
	bool m_bDisabled; // 0x350
	CHandle< CBaseEntity > m_hMeasureTarget; // 0x354
	int32_t m_nSoundMask; // 0x358
	float m_flSensitivity; // 0x35c
	float m_flSmoothFactor; // 0x360
	float m_flMaxRange; // 0x364
	CUtlSymbolLarge m_iszSpeakerName; // 0x368
	CHandle< CBaseEntity > m_hSpeaker; // 0x370
	bool m_bAvoidFeedback; // 0x374
	int32_t m_iSpeakerDSPPreset; // 0x378
	CUtlSymbolLarge m_iszListenFilter; // 0x380
	CHandle< CBaseFilter > m_hListenFilter; // 0x388
	CEntityOutputTemplate< float32 > m_SoundLevel; // 0x390
	CEntityIOOutput m_OnRoutedSound; // 0x3b8
	CEntityIOOutput m_OnHeardSound; // 0x3e0
	char[256] m_szLastSound; // 0x408
	int32_t m_iLastRoutedFrame; // 0x508
};

